{"input": "Q: Hydrogen ions are formed when:\nOptions:\n(A)glycogen becomes depleted.\n(D)glycolysis is being used as a major means of resynthesising ATP.", "target": "(D)"}
{"input": "Q: Which of the following is true of a lower motor neurone lesion in the arm?\nOptions:\n(A)It leads to increased tone in the arm (hypertonia)\n(D)An ulna nerve palsy is an example of a lower motor neurone lesion", "target": "(D)"}
{"input": "Q: The rate of blood lactate accumulation is determined by:\nOptions:\n(B)the rate of anaerobic glycolysis.\n(D)the difference between the rate of lactate appearance and the rate of lactate clearance.", "target": "(D)"}
{"input": "Q: The frontal lobe of the brain's cortex is responsible for which of the following?\nOptions:\n(B)The ability to draw shapes.\n", "target": "(B)"}
{"input": "Q: Who has legal responsibility for a patient's care during hospital admission, stay, and discharge?\nOptions:\n(A)The named nurse.\n(B)The named consultant.", "target": "(B)"}
{"input": "Q: Eccrine and apocrine glands are both types of:\nOptions:\n(A)sweat glands.\n(B)salivary glands.", "target": "(A)"}
{"input": "Q: Which of the following factors can affect enzyme activity?\nOptions:\n(A)Temperature.\n(D)All of the above.", "target": "(D)"}
{"input": "Q: What is the second commonest hospital acquired infection?\nOptions:\n(B)Wound infection.\n(D)Ventilator-associated pneumonia.", "target": "(D)"}
{"input": "Q: Which organ secretes insulin?\nOptions:\n(B)The pancreas.\n(C)The walls of the large intestine.", "target": "(B)"}
{"input": "Q: Collagen fibres:\nOptions:\n(A)are re-established in the first five days of wound healing.\n(C)take some time to re-establish.", "target": "(C)"}
{"input": "Q: Who is the publication Your guide to the NHS written for?\nOptions:\n(A)GPs.\n(C)The general public.", "target": "(C)"}
{"input": "Q: Under what circumstances would you use antibiotics prior to catheterization?\nOptions:\n(A)If the patient has had a catheter in situ for a week.\n(C)If patient has an artificial heart valve.", "target": "(C)"}
{"input": "Q: Which of the following physiological characteristics is not important for success in endurance events such as the marathon race?\nOptions:\n(C)The availability of body stores of carbohydrate.\n(D)Muscle ATP and phosphocreatine content.", "target": "(D)"}
{"input": "Q: Glucose is transported into the muscle cell:\nOptions:\n(A)via protein transporters called GLUT4.\n", "target": "(A)"}
{"input": "Q: When teaching a patient inhaler technique, how will you ensure that a large proportion of the drug reaches the lower airways?\nOptions:\n(C)Ask them to perform the procedure as quickly as they can.\n(D)Ask them to hold their breath at the end of the inspiration on using the inhaler.", "target": "(D)"}
{"input": "Q: One of the most common reasons for stoma formation is:\nOptions:\n(C)carcinoma.\n", "target": "(C)"}
{"input": "Q: Most of the free fatty acids are transported in the blood:\nOptions:\n(A)inside the red blood cells.\n(D)bound to albumin.", "target": "(D)"}
{"input": "Q: For very high force contractions lasting 1-2 seconds, the initial energy source is from:\nOptions:\n(C)phosphocreatine stores.\n(D)ATP stores.", "target": "(D)"}
{"input": "Q: Your patient has diabetes. Why is this important?\nOptions:\n(A)These patients are more likely to bleed.\n(B)These patients are more likely to get urinary tract infections if their blood sugar is unstable.", "target": "(B)"}
{"input": "Q: Which of the following is not a controlled drug?\nOptions:\n(B)A sustained release Morphine tablet.\n(D)A 500 ml bottle of Morphine 10 mg in 5 ml in oral suspension.", "target": "(D)"}
{"input": "Q: Which of the following is true of hypothyroidism?\nOptions:\n(C)A raised TSH level\n", "target": "(C)"}
{"input": "Q: Which of the following processes is not used to modify protein structure after translation has occurred?\nOptions:\n(A)Lipidation.\n(B)Attachment of more amino acids via peptide bonds.", "target": "(B)"}
{"input": "Q: Which of the following is true of calcium metabolism?\nOptions:\n(B)Primary hyperparathyroidism is usually asymptomatic\n", "target": "(B)"}
{"input": "Q: Which one of the following manoeuvres is not a central painful stimulus?\nOptions:\n(B)Pressure on the little finger pulp.\n(C)Trapezius squeeze.", "target": "(B)"}
{"input": "Q: Which products of ADP degradation increase in concentration in the blood during multiple sprint sports?\nOptions:\n(A)Ammonia, hypoxanthine and uric acid.\n", "target": "(A)"}
{"input": "Q: The energy released from the breakdown of the high-energy phosphates, ATP and phosphocreatine, can sustain maximal exertion exercise for about:\nOptions:\n(B)5-10 seconds.\n", "target": "(B)"}
{"input": "Q: Which of the following is true regarding the complications of a large goitre?\nOptions:\n(B)Dysphagia is an indication for surgery\n(D)It causes a more florid thyrotoxicosis than a smaller goitre", "target": "(B)"}
{"input": "Q: What is a tracheostomy?\nOptions:\n(A)An opening in the anterior wall of the trachea above the cricoid cartilage.\n(B)An opening in the anterior wall of the trachea below the cricoid cartilage.", "target": "(B)"}
{"input": "Q: Which of these options is not recognized as a cause of chronic cough?\nOptions:\n(D)Sodium valproate\n", "target": "(D)"}
{"input": "Q: Glycogen breakdown in muscle initially results in the formation of:\nOptions:\n(B)glucose-1-phosphate.\n", "target": "(B)"}
{"input": "Q: Endurance training increases the muscle's capacity to:\nOptions:\n(A)contract faster.\n(C)burn fat and carbohydrate.", "target": "(C)"}
{"input": "Q: Blood clots are responsible for repeatedly blocking a catheter. What should you do?\nOptions:\n(A)Call for help.\n(B)Inform medical staff.", "target": "(B)"}
{"input": "Q: Name the bones of the middle finger in the correct order from the hand.\nOptions:\n(A)Proximal phalynx, middle phalynx, distal phalynx.\n", "target": "(A)"}
{"input": "Q: Which of the following can act as an intracellular buffer to limit pH changes when the rate of glycolysis is high?\nOptions:\n(C)Carnosine\n(D)Amylase", "target": "(C)"}
{"input": "Q: Which of the following molecules does not form part of DNA?\nOptions:\n(B)Pyrimidine\n(D)Amino acid", "target": "(D)"}
{"input": "Q: Which of the following statements is false?\nOptions:\n(A)Phosphofructokinase is the rate limiting enzyme in glycolysis.\n(D)Oxygen is consumed in the TCA cycle.", "target": "(D)"}
{"input": "Q: In the discharge checklist recommended by the Department of Health (2004), who should be involved in completing the form?\nOptions:\n(B)The nurse, patient, and ward clerk.\n(C)The nurse, ward clerk, and consultant.", "target": "(B)"}
{"input": "Q: The normal respiratory rate for an adult male is:\nOptions:\n(A)10-12 breaths per minute.\n(D)14-16 breaths per minute.", "target": "(D)"}
{"input": "Q: Which of the following is the same strength as Adrenaline 1 in 1000? Choose one answer from the following:\nOptions:\n(A)1 mg/mL\n(B)1 mg/L", "target": "(A)"}
{"input": "Q: Why should the short-acting bronchodilator be taken first?\nOptions:\n(A)It works to dilate the airways quickly, allowing better deposition of other medications.\n(C)It is warmer than the others.", "target": "(A)"}
{"input": "Q: The creatine kinase reaction is:\nOptions:\n(D)inhibited by low pH in the muscle.\n", "target": "(D)"}
{"input": "Q: Muscle lactate production increases when:\nOptions:\n(D)glycolysis is activated at the onset of exercise.\n", "target": "(D)"}
{"input": "Q: Which of the following releases most energy when completely oxidised in the body?\nOptions:\n(A)One gram of glucose\n(B)One gram of palmitic acid", "target": "(B)"}
{"input": "Q: Which of the following is not an abnormal breathing pattern seen in head injury and altered conscious level?\nOptions:\n(A)Cheyne-Stokes respiration.\n(B)Anaerobic respiration.", "target": "(B)"}
{"input": "Q: A person weighs 62 kg. Their drug dose is 15 mg/kg. How many grams is their dose? Choose one answer from the following:\nOptions:\n(B)93\n(D)0.93", "target": "(D)"}
{"input": "Q: Which of the following is true about involuntary movements in the arm?\nOptions:\n(D)Writer's cramp is an example of a focal dystonia\n", "target": "(D)"}
{"input": "Q: The β-oxidation of a molecule of palmitic acid, CH3(CH2)14CO2H:\nOptions:\n(A)yields 8 molecules of acetyl-CoA and some ATP and water.\n(B)yields 16 molecules of acetyl-CoA only.", "target": "(A)"}
{"input": "Q: How often should a cannula be flushed?\nOptions:\n(A)Every 4 hours.\n(C)Every 12 hours.", "target": "(C)"}
{"input": "Q: The rate limiting enzyme of glycolysis is:\nOptions:\n(D)phosphofructokinase.\n", "target": "(D)"}
{"input": "Q: Which of the following should patients remember when taking paracetamol?\nOptions:\n(A)It can interfere with the effectiveness of other drugs such as Warfarin.\n(C)Patients should carefully check the contents of over-the-counter cold remedies in order to prevent accidental overdose, as such preparations often contain additional paracetamol.", "target": "(C)"}
{"input": "Q: Which of the following is the commonest cause of dementia in the UK?\nOptions:\n(A)Alzheimer's disease.\n(C)Lewy body dementia.", "target": "(A)"}
{"input": "Q: Which of the following groups of drugs may cause a dry mouth?\nOptions:\n(A)Steroids.\n(C)Antidepressants.", "target": "(C)"}
{"input": "Q: How many chromosomes do all human somatic cells contain?\nOptions:\n(D)46\n", "target": "(D)"}
{"input": "Q: Which of the following is present in saliva and has an antibacterial action?\nOptions:\n(A)Lysozyme.\n(C)Sodium chloride.", "target": "(A)"}
{"input": "Q: A 14-16 gauge needle is most likely to be used for:\nOptions:\n(C)inserting in the back of the hand.\n(D)trauma or burns patients.", "target": "(D)"}
{"input": "Q: The carpal bones are the small bones of the wrist - name them.\nOptions:\n(A)Scaphoid, lunate, triquetral, pisiform, trapezium, trapezoid, capitate, hamate.\n(C)Scaphoid, proximal phalynx, humerus, hamate, capitate.", "target": "(A)"}
{"input": "Q: The enzymes of glycolysis are located in the:\nOptions:\n(C)cytoplasm.\n(D)lysosomes.", "target": "(C)"}
{"input": "Q: Which of the following is true of haematemesis?\nOptions:\n(A)A low blood pressure (<90mmHg systolic) and a tachycardia (>100/min) are worrying features\n(D)An alcohol history is not essential", "target": "(A)"}
{"input": "Q: A person is prescribed Ropinirole 1.5 mg divided into three doses. How many micrograms is each dose? Choose one answer from the following:\nOptions:\n(A)5\n(D)500", "target": "(D)"}
{"input": "Q: If a blood unit has been out of refrigeration for longer than the accepted time limit, you should:\nOptions:\n(C)return it to the blood bank and inform them of why you have done so.\n(D)refrigerate for a minimum of 12 hours and then administer it.", "target": "(C)"}
{"input": "Q: Which of the following best describes nociceptive pain?\nOptions:\n(A)Pain resulting from actual or potential tissue damage, which causes the release of chemical mediators that stimulate nerve fibres to initiate pain signals to the brain.\n(B)Pain resulting from pressure upon a nerve or group of nerves.", "target": "(A)"}
{"input": "Q: How much toothpaste is recommended for cleaning teeth?\nOptions:\n(B)A pea-sized amount.\n", "target": "(B)"}
{"input": "Q: The two principal contractile proteins found in skeletal muscle are:\nOptions:\n(B)actin and myosin.\n(C)troponin and tropomyosin.", "target": "(B)"}
{"input": "Q: Which of the following is true of the assessment of power in the arms?\nOptions:\n(A)Grade 3/5 (MRC scale) represents movement of the arm only when gravity is eliminated\n(C)The root value of shoulder abduction is C5", "target": "(C)"}
{"input": "Q: Patients with the apolipoprotein E gene are at risk of which disease?\nOptions:\n(C)Alzheimer's disease.\n", "target": "(C)"}
{"input": "Q: Which of the following tools is the first choice for cleaning the mouth?\nOptions:\n(A)Small, soft toothbrush.\n", "target": "(A)"}
{"input": "Q: The main factors determining success in sport are:\nOptions:\n(A)a high energy diet and large appetite.\n(D)innate ability and the capacity to respond to the training stimulus.", "target": "(D)"}
{"input": "Q: The blood glucose concentration during 80-90 minutes of intermittent high intensity exercise:\nOptions:\n(A)frequently rises by 1 - 3 mM.\n", "target": "(A)"}
{"input": "Q: Which of the following is true of the spine?\nOptions:\n(B)Schober's test is designed to quantify the flexion of the lumbar spine\n(C)Ankylosing spondylitis is a cause of hypermobility of the spine", "target": "(B)"}
{"input": "Q: Which of the following best describes the Golgi tendon organ?\nOptions:\n(B)Proprioceptive sensory receptor found at the junction between muscle and tendon.\n", "target": "(B)"}
{"input": "Q: Which of the following is true?\nOptions:\n(B)Creatine supplements can increase muscle strength and power.\n", "target": "(B)"}
{"input": "Q: Wound drainage should be assessed for volume and consistency:\nOptions:\n(A)each time post-operative observations are undertaken.\n(C)every hour.", "target": "(A)"}
{"input": "Q: What is the purpose of the cuff on a tracheostomy tube?\nOptions:\n(A)To create an air seal within the trachea and reduce the risk of aspirating saliva or gastric contents.\n(B)To reduce local oedema.", "target": "(A)"}
{"input": "Q: How many different types of microorganisms may colonize the mouth?\nOptions:\n(C)350\n(D)500", "target": "(C)"}
{"input": "Q: Embedded in the inner membrane of the mitochondrion are:\nOptions:\n(A)the enzymes of the tricarboxylic acid cycle (Krebs' cycle).\n(B)the components of the electron transport chain.", "target": "(B)"}
{"input": "Q: The conversion of one molecule of glucose to two molecules of pyruvate results in the net formation of:\nOptions:\n(B)two molecules of ATP.\n", "target": "(B)"}
{"input": "Q: Metabolism is determined by the:\nOptions:\n(C)proteins formed as dictated by the genetic material.\n(D)amino acid composition of the ribonucleic acids.", "target": "(C)"}
{"input": "Q: A keloid is:\nOptions:\n(A)evidence of infection.\n(B)a firm mass of scar tissue.", "target": "(B)"}
{"input": "Q: What commonly causes skin excoriation?\nOptions:\n(C)Leakage of effluent onto peristomal skin.\n", "target": "(C)"}
{"input": "Q: Codons are composed of:\nOptions:\n(A)triplet sequences of nucleotide bases in mRNA or DNA .\n(D)triplet sequences of deoxyribose sugars in DNA.", "target": "(A)"}
{"input": "Q: A hypertonic solution is:\nOptions:\n(A)a solution that has a higher concentration of solutes than the normal human cell.\n(C)a solution that has a lower concentration of solutes than the normal human cell.", "target": "(A)"}
{"input": "Q: Which of the following is true about possible rectal findings?\nOptions:\n(B)Impacted faeces can sometimes be mistaken for a rectal tumour\n(D)Peri-anal warts can only be demonstrated on proctoscopy", "target": "(B)"}
{"input": "Q: What is hypochlorhydria?\nOptions:\n(A)Increased amount of gastric acid.\n(C)Reduced amount of gastric acid.", "target": "(C)"}
{"input": "Q: Women's world record performances have improved rapidly in recent years mainly because:\nOptions:\n(C)women have started training at an earlier age.\n(D)more women are now engaged in sport.", "target": "(D)"}
{"input": "Q: The main fate of lactate that leaves muscle and enters the circulation is:\nOptions:\n(D)uptake and oxidation by other tissues.\n", "target": "(D)"}
{"input": "Q: What must you ensure before a speaking valve is used?\nOptions:\n(C)The cuff is deflated.\n(D)The cuff is inflated.", "target": "(C)"}
{"input": "Q: What type of covalent bonds link the amino acids in a protein?\nOptions:\n(A)Peptide bonds\n(C)Ionic bonds", "target": "(A)"}
{"input": "Q: Which of the following is true about Cushing's Syndrome?\nOptions:\n(A)It is due to a deficiency of cortisol hormone\n(D)A moon face and a buffalo hump are characteristic of the disease", "target": "(D)"}
{"input": "Q: Alterations in which neurotransmitters in the brain by pharmacological agents has been shown to influence fatigue development?\nOptions:\n(B)Dopamine and acetyl choline.\n(D)Dopamine and serotonin.", "target": "(D)"}
{"input": "Q: Oedema is the presence of:\nOptions:\n(B)excessive extravascular fluid.\n(C)excessive intracranial fluid.", "target": "(B)"}
{"input": "Q: Which of the following drugs is most commonly responsible for patients who present with acute confusion?\nOptions:\n(B)Ecstasy.\n(C)Alcohol.", "target": "(C)"}
{"input": "Q: Which of the following is true about jaundice?\nOptions:\n(C)Itching may be a sign of obstructive jaundice\n(D)Putting a danger of infection sticker on blood samples from an intravenous drug user with jaundice is optional", "target": "(C)"}
{"input": "Q: Once a prescribed unit of blood product has been obtained from the blood bank and is out of refrigeration, the transfusion should commence within what period of time before it starts to deteriorate (as of 2020 medical knowledge)?\nOptions:\n(A)30 minutes.\n(D)12 hours.", "target": "(A)"}
{"input": "Q: Which of the following is true about Addisons Disease?\nOptions:\n(A)It is due to a deficiency of prolactin hormone\n(B)Leads to generalized pigmentation", "target": "(B)"}
{"input": "Q: The complete resynthesis of phosphocreatine after very high intensity exercise normally takes:\nOptions:\n(C)about 1 minute.\n(D)about 4 minutes.", "target": "(D)"}
{"input": "Q: Which of the following is thought to be implicated in the development of peripheral muscle fatigue during multiple sprint activities?\nOptions:\n(A)An accumulation of inorganic phosphate.\n(B)Development of hyperosmolality in the muscles.", "target": "(A)"}
{"input": "Q: Removal of adhesive strips:\nOptions:\n(A)can be carried out by the patient.\n(C)is a specialist skill.", "target": "(A)"}
{"input": "Q: The net production of ATP via substrate-level phosphorylation in glycolysis is:\nOptions:\n(A)2 from glucose and 3 from glycogen.\n", "target": "(A)"}
{"input": "Q: How many CO2 and ATP molecules are formed during one complete turn of the tricarboxylic acid cycle (Krebs' cycle)?\nOptions:\n(A)2CO2 and 2ATP\n(D)2CO2 and 1ATP", "target": "(D)"}
{"input": "Q: If a patient is cyanosed, what might their oxygen saturation level be?\nOptions:\n(C)80% or below.\n(D)85% or above.", "target": "(C)"}
{"input": "Q: What is an urgent reason for catheterizing a patient?\nOptions:\n(A)Acute urinary retention.\n(D)Because they asked.", "target": "(A)"}
{"input": "Q: Why might a patient need a tracheostomy?\nOptions:\n(A)To repair vocal cords after paralysis.\n(C)As an aid to weaning patients from a ventilator.", "target": "(C)"}
{"input": "Q: Lactate and hydrogen ions leave the muscle:\nOptions:\n(C)via a protein transporter molecule.\n", "target": "(C)"}
{"input": "Q: If a transfusion reaction is suspected, you should:\nOptions:\n(A)turn off the transfusion, inform medical staff immediately, and follow transfusion policy advice on dealing with acute transfusion reactions.\n(C)disconnect and dispose of the blood bag immediately.", "target": "(A)"}
{"input": "Q: Which of the following is true of psoriatic arthropathy?\nOptions:\n(D)Nail pitting may give a clue to the diagnosis\n", "target": "(D)"}
{"input": "Q: The most rapid method to resynthesize ATP during exercise is through:\nOptions:\n(A)glycolysis.\n(B)phosphocreatine breakdown.", "target": "(B)"}
{"input": "Q: A muscle fibre relaxes when:\nOptions:\n(A)the nerve stimulus is removed.\n(D)the actin binding sites are saturated.", "target": "(A)"}
{"input": "Q: The cardiac cycle consists of the phases:\nOptions:\n(B)contraction, relaxation, and rest.\n(C)diastole and systole.", "target": "(C)"}
{"input": "Q: With an increasing number of sprints the:\nOptions:\n(C)blood glucose concentration falls below 3 mmol/L.\n(D)relative contribution of aerobic metabolism increases.", "target": "(D)"}
{"input": "Q: Which one of the following groups of patients should be assessed using an Early Warning Score (EWS)?\nOptions:\n(A)Only patients over 60 years of age.\n(D)Any patient who is acutely unwell pre-operatively or post-operatively and those who have undergone major surgery.", "target": "(D)"}
{"input": "Q: Which of the following parameters are seen on typical neurological observation charts?\nOptions:\n(B)Temperature.\n(D)Blood glucose.", "target": "(B)"}
{"input": "Q: The term gene doping refers to:\nOptions:\n(B)the use of genetic manipulation techniques to enhance performance in sport.\n", "target": "(B)"}
{"input": "Q: Which of the following drugs may be used to enhance gastric motility?\nOptions:\n(C)Erythromycin.\n", "target": "(C)"}
{"input": "Q: Which of the following is true in peripheral neuropathy?\nOptions:\n(A)Sensory loss is demonstrated in a stocking distribution\n(D)Weakness is more marked proximally than distally", "target": "(A)"}
{"input": "Q: As a general principle what is the best approach to the use of analgesic drugs following surgery?\nOptions:\n(B)Give drugs regularly with provision for additional 'as required' pain relief for breakthrough pain.\n", "target": "(B)"}
{"input": "Q: In a double stranded molecule of DNA, the ratio of purines : pyrimidines is:\nOptions:\n(C)genetically determined.\n(D)always 1:1.", "target": "(D)"}
{"input": "Q: The ATP store in muscle can only supply energy in high intensity exercise for about:\nOptions:\n(A)2 milliseconds.\n(B)2 seconds.", "target": "(B)"}
{"input": "Q: Why should careful consideration be given to providing people aged over 65 with information sources that are internet based?\nOptions:\n(B)Less than 30% of people over 65 years have access to the internet.\n(C)The internet is aimed at younger people.", "target": "(B)"}
{"input": "Q: An action potential arriving at the motor endplate causes release of:\nOptions:\n(A)acetylcholine which traverses the neuromuscular junction.\n(D)noradrenaline which increases muscle metabolic activity.", "target": "(A)"}
{"input": "Q: What three factors regulate stroke volume?\nOptions:\n(B)Preload, contractility, and afterload.\n(C)Contractility, blood volume, and blood pressure.", "target": "(B)"}
{"input": "Q: Which of the following is true of Graves Disease of the thyroid?\nOptions:\n(A)It is a cause of ophthalmoplegia\n(B)It causes a large multi-nodular goitre", "target": "(A)"}
{"input": "Q: Why would you need to carry out a bladder washout for a patient at home?\nOptions:\n(B)When the catheter is blocked.\n", "target": "(B)"}
{"input": "Q: Dopamine is prescribed at a rate of 4 micrograms/kg/min. For a 65 kg person, how many milligrams will they receive in an hour?\nOptions:\n(B)15.6\n(D)15600", "target": "(B)"}
{"input": "Q: Which of the following is true about a thyroid swelling?\nOptions:\n(C)An ultrasound of the swelling is the best test to determine whether the nodule is actively secreting hormone\n(D)A functioning nodule on isotope scanning is unlikely to be due to cancer", "target": "(D)"}
{"input": "Q: Which of these is most likely to cause deviation of the trachea?\nOptions:\n(C)Previous tuberculosis of the right upper lobe\n", "target": "(C)"}
{"input": "Q: Performance enhancing synthetic steroids are based on the structure of the hormone:\nOptions:\n(A)testosterone.\n", "target": "(A)"}
{"input": "Q: Which of these features suggest that a pulsation in the neck is arterial?\nOptions:\n(B)Positive for hepatojugular reflux\n(C)No variation with posture", "target": "(C)"}
{"input": "Q: Which of the following is true about an abdominal mass?\nOptions:\n(C)A large mass arising out of the pelvis which disappears following urethral catheterization is caused by an ovarian cyst\n(D)An indentible mass is caused by faecal loading of the colon", "target": "(D)"}
{"input": "Q: Two of the following are evident - pain at IV site, erythema, and swelling. What stage on the phlebitis scale is this and what should you do?\nOptions:\n(B)Stage 2 - re-site cannula.\n(D)Stage 0 - do nothing.", "target": "(B)"}
{"input": "Q: Measuring the blood pressure in an arm that is above the level of the heart will:\nOptions:\n(A)accurately estimate the blood pressure.\n(D)underestimate the blood pressure.", "target": "(D)"}
{"input": "Q: Prior to undergoing a painful procedure, a patient should be informed about what to expect and how their pain will be controlled, as this is associated with:\nOptions:\n(A)a reduction in anxiety and perceived pain intensity.\n", "target": "(A)"}
{"input": "Q: After what period of time does maximal dynamic exercise become predominantly aerobic?\nOptions:\n(A)10 seconds\n(C)1 minute", "target": "(C)"}
{"input": "Q: The pulse can be palpated:\nOptions:\n(A)every time the atria contracts.\n(D)when an artery is close to the surface of the skin.", "target": "(D)"}
{"input": "Q: Which of the following is true about haemorrhoids?\nOptions:\n(B)Pregnancy is a predisposing factor in causing haemorrhoids\n(C)Bleeding from first degree haemorrhoids is associated with pain", "target": "(B)"}
{"input": "Q: A surgical support can be used for:\nOptions:\n(A)prolapsed stomas.\n(C)herniation around the stoma.", "target": "(C)"}
{"input": "Q: Mutations are errors in DNA that:\nOptions:\n(B)only occur in the presence of carcinogens.\n(D)occur spontaneously at a low rate.", "target": "(D)"}
{"input": "Q: The heart has:\nOptions:\n(B)four valves and four chambers.\n(D)four valves and two chambers.", "target": "(B)"}
{"input": "Q: Exhaustion, confusion, and unresponsiveness can be indicators of:\nOptions:\n(A)respiratory failure.\n", "target": "(A)"}
{"input": "Q: What size of cannula would you use in a patient who needed a rapid blood transfusion (as of 2020 medical knowledge)?\nOptions:\n(A)18 gauge.\n", "target": "(A)"}
{"input": "Q: During CPR, chest compressions should be delivered at a rate of:\nOptions:\n(C)100/minute.\n", "target": "(C)"}
{"input": "Q: Which of the following is not a category used to classify patients according to the Glasgow Coma Scale?\nOptions:\n(C)Best motor response.\n(D)Pupil response.", "target": "(D)"}
{"input": "Q: A 67-year-old man, three hours post-transurethral resection of prostate with irrigation, has a blocked catheter. Which solution should be used to complete bladder washout?\nOptions:\n(B)Normal saline.\n(D)Any of the above.", "target": "(B)"}
{"input": "Q: A normal heart rate for an adult at rest is:\nOptions:\n(B)60-100 bpm.\n", "target": "(B)"}
{"input": "Q: Which one of the following represents a IIIrd cranial nerve palsy and is a neurosurgical emergency?\nOptions:\n(A)Unilateral constricted pupil.\n(C)Unilateral fixed dilated pupil.", "target": "(C)"}
{"input": "Q: Which hormone is primarily responsible for fluid regulation?\nOptions:\n(A)Antidiuretic hormone.\n(D)Testosterone.", "target": "(A)"}
{"input": "Q: The pyruvate dehydrogenase complex:\nOptions:\n(A)is located in the sarcoplasm.\n(B)catalyses the conversion of pyruvate to acetyl CoA.", "target": "(B)"}
{"input": "Q: When using an inhaler, when should a patient be asked to rinse their mouth?\nOptions:\n(D)After using their steroid inhaler.\n", "target": "(D)"}
{"input": "Q: Complete the following: A variation of serial peak flow readings over a two week period are considered diagnostic in . . .\nOptions:\n(A). . . asthma.\n(B). . . COPD.", "target": "(A)"}
{"input": "Q: The trigger to initiate the contractile process in skeletal muscle is:\nOptions:\n(D)calcium binding to troponin.\n", "target": "(D)"}
{"input": "Q: What is a colles fracture?\nOptions:\n(D)Fracture of the radius and ulna at the wrist.\n", "target": "(D)"}
{"input": "Q: Phosphocreatine in the muscle cell is found in:\nOptions:\n(C)the sarcolemma.\n(D)the cytoplasm.", "target": "(D)"}
{"input": "Q: Which of the following is true about the knee joint?\nOptions:\n(A)The knee is a ball and socket joint\n(C)The patellar tap is used to demonstrate an effusion", "target": "(C)"}
{"input": "Q: The energy charge of the cell is:\nOptions:\n(C)the overall rate of energy use by the cell.\n(D)the extent to which the total adenine nucleotide pool is phosphorylated.", "target": "(D)"}
{"input": "Q: The synthesis of glucose from lactate, glycerol, or amino acids is called:\nOptions:\n(A)glycogenolysis.\n(D)gluconeogenesis.", "target": "(D)"}
{"input": "Q: What is 'coring'?\nOptions:\n(A)A symptom of phlebitis.\n(D)When drugs are withdrawn from a sealed vial, fragments of the rubber bung can be cut out by the needle.", "target": "(D)"}
{"input": "Q: In what situation are closed pouches applied?\nOptions:\n(B)The patient has a colostomy.\n(C)In the immediate post-operative period.", "target": "(B)"}
{"input": "Q: Which of the answers below best indicates the compatible blood types that can be given to a person with a blood group B (rhesus negative)?\nOptions:\n(C)Blood type B (rhesus negative) and blood type O (rhesus negative).\n(D)Blood type B (rhesus negative) only.", "target": "(C)"}
{"input": "Q: Fast-twitch fibres contain:\nOptions:\n(C)a relatively small number of mitochondria and high ATPase activity.\n(D)a relatively large number of mitochondria and high ATPase activity.", "target": "(C)"}
{"input": "Q: A palpable left parasternal impulse suggests which abnormality?\nOptions:\n(A)Right ventricular hypertrophy\n", "target": "(A)"}
{"input": "Q: Selective Androgen Receptor Modulators (SARMs) are:\nOptions:\n(B)steroid drugs that act on androgen receptors antagonising the effects of natural steroid hormones.\n(C)non-steroid drugs that act on androgen receptors mimicking the effects of natural steroid hormones.", "target": "(C)"}
{"input": "Q: Insensible loss does not come from:\nOptions:\n(A)pyrexia.\n(C)excessive weight loss.", "target": "(C)"}
{"input": "Q: What might make the nurse think a patient could not use an inhaler?\nOptions:\n(C)Forthcoming surgery.\n(D)Poor technique, physical impairment, or lack of understanding.", "target": "(D)"}
{"input": "Q: Phophocreatine resynthesis during recovery from exercise is inhibited by:\nOptions:\n(B)hyperventilation.\n(D)a lack of oxygen.", "target": "(D)"}
{"input": "Q: During CPR chest compressions and ventilations should be delivered in a ratio of:\nOptions:\n(B)15:02\n(D)30:02:00", "target": "(D)"}
{"input": "Q: Which of the following is true about the rectal examination?\nOptions:\n(C)The optimum position of the patient is on their right side with their knees extended\n(D)The rectal examination is indicated for the assessment of some gastrointestinal disorders", "target": "(D)"}
{"input": "Q: Our genetic material is made up of:\nOptions:\n(A)deoxyribonucleic acid.\n(C)dinitronucleic acid.", "target": "(A)"}
{"input": "Q: What type of joint is the elbow?\nOptions:\n(C)Synovial hinge joint.\n", "target": "(C)"}
{"input": "Q: Wound drainage is described as serous if:\nOptions:\n(C)it contains microorganisms.\n(D)it is clear or slightly yellow.", "target": "(D)"}
{"input": "Q: What is the most likely cause of acute urinary retention of urine?\nOptions:\n(B)Bladder outflow obstruction.\n", "target": "(B)"}
{"input": "Q: Which of the following best describes the effects of morphine?\nOptions:\n(A)Reduces pain intensity and increases alertness.\n(B)Reduces pain intensity but also causes sedation.", "target": "(B)"}
{"input": "Q: Which of the following is recommended for cleaning the mouth?\nOptions:\n(B)Water.\n(C)Lemon and glycerine swabs.", "target": "(B)"}
{"input": "Q: Which of the following is true about the assessment of arm reflexes?\nOptions:\n(A)The root value of the biceps reflex is C5, C6\n", "target": "(A)"}
{"input": "Q: Between contractions of the left ventricle the blood continues to flow through the vessels because:\nOptions:\n(C)the right ventricle is relaxed.\n(D)the arteries have elastic recoil.", "target": "(D)"}
{"input": "Q: An expected side effect of creatine supplementation is:\nOptions:\n(B)gain in body mass.\n", "target": "(B)"}
{"input": "Q: Which of the following is true of hepatomegaly?\nOptions:\n(A)Emphysema is a cause\n(C)The presence of jaundice, spider naevi and purpura suggest alcohol as a cause", "target": "(C)"}
{"input": "Q: The process of translation requires the presence of:\nOptions:\n(A)mRNA, tRNA and ribosomes.\n(B)mRNA, ribosomes and RNA polymerase.", "target": "(A)"}
{"input": "Q: Oxygen is used:\nOptions:\n(B)in the conversion of fatty acids to acetyl CoA.\n(D)in glycogenolysis.", "target": "(B)"}
{"input": "Q: Which of the following is true about the carpal tunnel syndrome?\nOptions:\n(A)It can be caused by rheumatoid arthritis\n(D)Paraesthesia is worse during the day", "target": "(A)"}
{"input": "Q: When assessing a patient's breathing:\nOptions:\n(C)look for chest movements, listen for breath sounds, and feel for exhaled air on your cheek.\n(D)assess for 30 seconds.", "target": "(C)"}
{"input": "Q: The maximum sustainable power:\nOptions:\n(B)declines with the distance of the race.\n", "target": "(B)"}
{"input": "Q: A change in blood pressure is detected by the:\nOptions:\n(A)baroreceptors.\n", "target": "(A)"}
{"input": "Q: Your first action following confirmation of cardiac arrest is to:\nOptions:\n(A)ensure the emergency team/services are called.\n(C)give 30 chest compressions.", "target": "(A)"}
{"input": "Q: In hypovolaemic shock, what percentage of blood can be lost before it is reflected in changes in heart rate and blood pressure?\nOptions:\n(D)30%\n", "target": "(D)"}
{"input": "Q: In all-out exercise such as sprinting the first fibre types to fatigue are the:\nOptions:\n(B)Type Ia fibres.\n(D)Type IIX fibres.", "target": "(D)"}
{"input": "Q: Which of the following statements is false?\nOptions:\n(B)Muscle lactate accumulation does not begin until at least 5 seconds of intermittent muscle contractions have taken place.\n", "target": "(B)"}
{"input": "Q: The auscultatory gap is:\nOptions:\n(C)when the Korotkoff sounds disappear then return during phase 2 as the bladder is deflated.\n", "target": "(C)"}
{"input": "Q: Pairs of electrons carried in the form, FADH2 and NADH+H, collectively contain enough free energy to rephosphorylate:\nOptions:\n(B)5 ATP.\n(D)3 ATP.", "target": "(B)"}
{"input": "Q: The low intake of carbohydrate in the diet:\nOptions:\n(C)may impair high intensity exercise performance.\n(D)results in greater reliance on muscle glycogen during exercise.", "target": "(C)"}
{"input": "Q: Name three of the five main uses of the hand.\nOptions:\n(B)Grip, percussion, sensory.\n(D)Touch, pinch, grasp.", "target": "(B)"}
{"input": "Q: Which of the following is true regarding reflexes?\nOptions:\n(B)An extensor plantar response indicates a lower motor neurone lesion\n(C)The root value of the ankle reflex is S1", "target": "(C)"}
{"input": "Q: Which of the following nucleotide bases is not found in RNA?\nOptions:\n(A)Thymine\n(D)Guanine", "target": "(A)"}
{"input": "Q: Which of these features suggest that a crackling sound is more likely due to a pleural friction rub than crackles?\nOptions:\n(A)More prominent in expiration\n(D)Clubbing", "target": "(A)"}
{"input": "Q: When developing a plan of care relating to the management of a person's pain, attention should be given to the following needs:\nOptions:\n(A)physical and pharmacological needs only.\n(C)physical, psychological, and pharmacological needs followed by regular reassessment.", "target": "(C)"}
{"input": "Q: Approximately how many kJ of energy are expended if an athlete's steady-rate oxygen uptake averages 3.0 l/min for 5 minutes of exercise?\nOptions:\n(C)300 kJ\n(D)500 kJ", "target": "(C)"}
{"input": "Q: Bladder washout solution should be:\nOptions:\n(D)room temperature.\n", "target": "(D)"}
{"input": "Q: Why can't a patient talk if the cuff is inflated?\nOptions:\n(B)They are unable to swallow properly.\n(D)They are unable to pass air through their vocal cords.", "target": "(D)"}
{"input": "Q: Which potential complication of IV therapy is described thus: 'Leakage of vesicant (irritant) medication or fluid into surrounding tissues, causing tissue damage'?\nOptions:\n(A)Extravasation.\n", "target": "(A)"}
{"input": "Q: Which of the following are indicative signs and symptoms of circulatory overload?\nOptions:\n(D)Dyspnoea, tachycardia, and distended neck veins.\n", "target": "(D)"}
{"input": "Q: What is the pH of water?\nOptions:\n(B)7\n", "target": "(B)"}
{"input": "Q: Fatty acids are transported into the mitochondria bound to:\nOptions:\n(D)carnitine.\n", "target": "(D)"}