{"input": "Q: A psychologist emphasizes that parents should use appropriate consequences when dealing with their children’s misbehavior. In addition, the psychologist explains that the goal of misbehavior can be to confirm an assumed disability, or to get attention, power, or revenge. Which of the following theoretical orientations is being used\nOptions:\n(C)Adlerian\n", "target": "(C)"}
{"input": "Q: The American health care system is primarily dominated by which network?\nOptions:\n(B)The private sector\n", "target": "(B)"}
{"input": "Q: Research into ___________ has helped us understand paradoxical reward.\nOptions:\n(A)Frustration\n(B)Conditioning", "target": "(A)"}
{"input": "Q: A mother complains thar her 15-year-old daughter “lives like a pig, she is so sloppy and dirty.” She adds, “The more I yell at her, the worse she gets.” In operant conditioning terms, the yelling can best be explained as\nOptions:\n(A)positive reinforcement\n(D)a discriminating stimulus for the sloppy behavior", "target": "(A)"}
{"input": "Q: Which of the following is true of strong organizational culture?\nOptions:\n(B)It is correlated with low levels of job commitment\n(C)It is correlated with high levels of job performance", "target": "(C)"}
{"input": "Q: What two theories provide the conceptual framework for the evolution of mating adaptations?\nOptions:\n(B)Parental investment and ecological warming\n(C)Sexual selection and parental investment", "target": "(C)"}
{"input": "Q: The primary goal of quality assurance is best described as:\nOptions:\n(B)improving the health status and satisfaction of patients.\n", "target": "(B)"}
{"input": "Q: According to Piaget, children are ___________.\nOptions:\n(C)“Little scientists”\n(D)Shaped by culture", "target": "(C)"}
{"input": "Q: The procedure involving repeated presentation of a stimulus to the client until the attractiveness of that stimulus is reduced is best described as\nOptions:\n(A)stimulus satiation\n(B)response-prevention", "target": "(A)"}
{"input": "Q: A father brings his 22-year-old son to you for evaluation. Within the past 6 weeks, this formerly socially active young man has quit his job as a restaurant manager, has become withdrawn, and now spends most of his time in his room watching TV. He reports that he occasionally receives messages from aliens through the TV. Based on this information, which of the following is the most appropriate DSM-IV diagnosis\nOptions:\n(A)Schizophreniform Disorder\n(C)Schizophrenia", "target": "(A)"}
{"input": "Q: Which of the following satisfies the criteria for tertiary prevention in a school setting\nOptions:\n(A)Individual counseling for students resuming from an institutional care facility\n(D)Large-group programs emphasizing development of children's self- esteem", "target": "(A)"}
{"input": "Q: The items for 2 machinist proficiency test have been based on 2 job analysis of machinists in 50 plants, each employing five or more machinists doing comparable work. Such 2 procedure would contribute directly to the test's\nOptions:\n(D)content validity\n", "target": "(D)"}
{"input": "Q: Which of the following training methods will develop 2 response most resistant to extinction\nOptions:\n(A)Partial reinforcement\n(C)Mild punishment for each failure to respond", "target": "(A)"}
{"input": "Q: You are subpoenaed to appear at a deposition to testify about a former client of yours. During the deposition, the attorney for the opposing party asks you to provide confidential client information. You should:\nOptions:\n(B)assert the privilege unless the client has signed a waiver.\n(C)provide the information if you believe it is pertinent to the case.", "target": "(B)"}
{"input": "Q: In a research study, a social psychologist offers participants either $1.00 or $20.00 to tell potential participants that a dull experiment was very interesting. With regard to cognitive dissonance theory and self-perception theory, which of the following is true?\nOptions:\n(C)Cognitive dissonance theory and self-perception theory both predict that participants in the $1.00 condition will subsequently report greater liking for the dull experiment than will those in the $20.00 condition.\n(D)Cognitive dissonance theory and self-perception theory both predict that participants in the $20.00 condition will subsequently report greater liking for the dull experiment than will those in the $1.00 condition.", "target": "(C)"}
{"input": "Q: Which of the following is true of low-context communication?\nOptions:\n(C)It is a less unifying form of communication\n", "target": "(C)"}
{"input": "Q: When preparing a psychological testing report, a psychologist is ethically bound to include\nOptions:\n(B)interpretations of the data and limiting circumstances involving the test administration\n(C)raw data, where this is appropriate in the psychologist’s professional judgment", "target": "(B)"}
{"input": "Q: Which of the following changes would be characteristic of the “classic aging pattern” as it applies to performance on psychometric tests of intelligence\nOptions:\n(A)Verbal functions are preserved relatively well, bur performance decreases on tests of perceptual-integrative ability\n", "target": "(A)"}
{"input": "Q: Attempting to teach a new behavior through the use of aversive techniques is difficult because of which of the following\nOptions:\n(A)Emotional reactivity is often increased\n(C)The frequency of behavior is often low", "target": "(A)"}
{"input": "Q: The primary purpose of a(n) ____________ is to obtain detailed information about job requirements in order to facilitate decisions related to compensation.\nOptions:\n(B)organizational analysis\n(D)job evaluation", "target": "(D)"}
{"input": "Q: Focal damage to the portion of the left frontal lobe known as Broca's area is likely to impair\nOptions:\n(A)recall of words\n(D)production of speech", "target": "(D)"}
{"input": "Q: For Kohlberg, morality:\nOptions:\n(D)Shows a logical progression from egocentric thought to broad moral principles\n", "target": "(D)"}
{"input": "Q: Self-control procedures such as those used for controlling alcohol abuse are most easily implemented\nOptions:\n(A)early in a response chain\n(B)when the drive level is strongest", "target": "(B)"}
{"input": "Q: When the spread of scores increases, the variance\nOptions:\n(B)increases\n", "target": "(B)"}
{"input": "Q: You receive a phone call from Hermann H., age 28, who says he is “totally miserable” because of the recent breakup with his girlfriend and that he would like to begin therapy with you. During the first session with Hermann, you find out that his political views are completely repugnant to you, and you feel that you would not enjoy working with him. As an ethical psychologist, you should:\nOptions:\n(A)consult with another psychologist during the course of treatment to make sure your feelings don’t interfere with your objectivity.\n(D)provide Hermann with appropriate referrals.", "target": "(D)"}
{"input": "Q: You have been treating a teenage male you suspect may have some neurologic difficulties. You inform his parents about your concerns and suggest they send him to a neurologist for an evaluation. Sometime later, the neurologist contacts you and requests your progress notes. You should ___________.\nOptions:\n(C)Inform the neurologist that you would need a release of information signed by your client’s parents\n", "target": "(C)"}
{"input": "Q: If a psychologist acts as both a fact witness for the plaintiff and an expert witness for the court in a criminal trial, she has acted:\nOptions:\n(C)ethically as long as she clarifies her roles with all parties.\n", "target": "(C)"}
{"input": "Q: The research indicates that, when Total Quality Management (TQM) fails to live up to its potential, this is most often because:\nOptions:\n(C)employees were not sufficiently involved in decision-making.\n(D)pay and other benefits were not adequately linked to team performance.", "target": "(C)"}
{"input": "Q: Of the following, the best predictor of a child’s post-divorce adjustment during the 2 years following divorce is the\nOptions:\n(B)degree of continued conflict between the parents after the divorce\n(C)residence of the child with the preferred parent", "target": "(B)"}
{"input": "Q: Dr. Sam Stone has been hired by a consulting firm to assist with an ongoing research project being conducted at a large company. Dr. Stone is to work directly under the project director, Dr. Thompson, a licensed organizational psychologist. Dr. Thompson asks Dr. Stone to review the preliminary report she has prepared for the project; and, in doing so, Dr. Stone discovers that some of the reported data is misleading and may be inaccurate. Dr. Stone expresses his concerns to Dr. Thompson and is told that “it will be taken care of.” Subsequently, Dr. Stone learns that the report was submitted to the company without any changes. Dr. Stone reviews the ethical guidelines and decides that pursuing the matter further isn't necessary. Dr. Stone's conclusion:\nOptions:\n(A)is correct since this situation is not covered by ethical guidelines.\n(D)is incorrect because he has a responsibility to ensure that the company is provided with complete and accurate data.", "target": "(D)"}
{"input": "Q: In regard to memory, aging is most closely associated with a decline in\nOptions:\n(A)the efficiency of controlled memory processes\n(D)the amount of factual memory knowledge available", "target": "(A)"}
{"input": "Q: Gestalt therapy is designed to achieve integration of\nOptions:\n(A)motive patterns and habit patterns\n(B)thought, feeling, and action", "target": "(B)"}
{"input": "Q: In counseling and psychotherapy, the trend since 1980 has been toward\nOptions:\n(B)dominance of the analytic models\n(D)greater acceptance of eclecticism", "target": "(D)"}
{"input": "Q: Which of the following best describes ethical guidelines regarding barter as a substitute for the collection of fees for professional psychological services?\nOptions:\n(A)Barter may be acceptable when certain conditions are met.\n(D)Barter of any kind is prohibited by ethical guidelines.", "target": "(A)"}
{"input": "Q: Kohlberg’s cognitive-developmental theory identifies which of the following as the initial stage of gender-role acquisition?\nOptions:\n(B)gender identity\n", "target": "(B)"}
{"input": "Q: When performing a(n) ________ task, group members select a solution offered by one of the group members as the group’s solution.\nOptions:\n(B)disjunctive\n(D)additive", "target": "(B)"}
{"input": "Q: Whenever her clients cancel an appointment with Dr. Penny Pincher within less than 24 hours of the appointment, Dr. Pincher routinely bills the client’s insurance company for her full hourly fee. This practice is:\nOptions:\n(A)illegal and unethical.\n(C)legal and ethical.", "target": "(A)"}
{"input": "Q: Expectancy theory predicts that worker motivation depends on several factors including “valence,” which refers to:\nOptions:\n(A)the employee’s beliefs about the value of rewards provided for successful performance.\n(C)the strength of the worker's motivation and organizational commitment.", "target": "(A)"}
{"input": "Q: The Buckley Amendment establishes:\nOptions:\n(A)the right of parents or legal guardians of a child to inspect the child’s school records.\n", "target": "(A)"}
{"input": "Q: Transformed scores increase the interpretability of raw scores and allow comparison to the rest of the distribution. From your knowledge about Transformed Scores, which statement is not about the Z SCOREs?\nOptions:\n(A)raw scores stated in SD terms\n(D)tells you how many SDs away from the mean a score is", "target": "(D)"}
{"input": "Q: Most babies say their first words at about _____ months of age.\nOptions:\n(B)9\n(C)12", "target": "(C)"}
{"input": "Q: The belief that a child's misbehavior has one of four goals — i.e., attention, revenge, power, or to display inadequacy — is most consistent with:\nOptions:\n(B)Adler’s individual psychology.\n(C)Perls’s Gestalt therapy.", "target": "(B)"}
{"input": "Q: On the basis of his investigation of the relationship between affiliation and anxiety, Schachter concluded that which of the following best accounted for the desire of high-anxiety research participants to wait with other high-anxiety participants?\nOptions:\n(D)social comparison\n", "target": "(D)"}
{"input": "Q: \"A 14-year old boy is arrested for the third time for shoplifting. His mother seems unconcerned and says \"\"he's just going through a phase.\"\" His father decides to go fishing on the day of the boy's court hearing, and his sister says she can't attend his court hearing because she has too much homework. From the perspective of structural family therapy, this family is best described as:\"\nOptions:\n(A)disengaged.\n(C)\"emotionally \"\"cut-off.\"\"\"", "target": "(A)"}
{"input": "Q: Which of the following is most likely a violation of ethical guidelines?\nOptions:\n(B)an advertisement offering a free initial therapy session that is published in the campus newspaper just prior to final exams\n(C)uninvited in-person solicitations for therapy of hurricane victims that destroyed their homes", "target": "(C)"}
{"input": "Q: According to Kubler-Ross, when a terminally ill patient is informed of his/her condition, the patient's initial reaction will likely be\nOptions:\n(B)“No. it’s not possible!”\n(D)“If you help me, God, I’ll reform my life!”", "target": "(B)"}
{"input": "Q: Which of the following is not represented in DSM-5 diagnostic criteria for problem gambling?\nOptions:\n(A)Tolerance\n(C)Legal problems", "target": "(C)"}
{"input": "Q: Research on second-language acquisition has shown which of the following about children who acquire a second language\nOptions:\n(C)Their native language proficiency has no effect on the rate of acquiring the second language\n(D)They have increased cognitive flexibility", "target": "(D)"}
{"input": "Q: A 38-year-old person is afraid to travel on public transportation. A program of treatment that relies on graduated exposure to traveling by bus, with actual real-life behavioral activities increased across trials, is called\nOptions:\n(C)reinforced practice\n(D)implosion", "target": "(C)"}
{"input": "Q: An evaluation of a particular treatment fails to show an overall effect. However, the experimenter does find thar the most severely disturbed do show considerable improvement, and therefore concludes that the treatment is effective with extreme cases. This conclusion\nOptions:\n(B)fails to take into account regression toward the mean\n(D)fails to take into account the fact thar the “placebo effect” is most pronounced in severely disturbed patients", "target": "(B)"}
{"input": "Q: A psychologist is the supervisor of several interns at a community hospital in a small town and notices that one of the interns seems unenthusiastic and depressed. When he talks to her, she tells him that she’s been very unhappy lately and feels she has no one to turn to. The intern asks the psychologist to see her in therapy, and he agrees to do so. The psychologist has acted:\nOptions:\n(A)unethically by agreeing to get involved in a dual relationship.\n(D)ethically because the intern is in desperate need of help.", "target": "(A)"}
{"input": "Q: A 60-year-old fire chiefs referred to you because department policy requires a fitness evaluation when an employee reaches this age. You have been asked to assist in cis fitness evaluation. Which of the following would be the most important factor to consider in your evaluation\nOptions:\n(A)Emotional fitness\n(D)Functional abilities", "target": "(D)"}
{"input": "Q: There are specific research designs and strategies used to gain the desired information. From your knowledge about the research designs and strategies, in which case is the MULTIPLE BASELINE DESIGN used?\nOptions:\n(A)when reversal is not possible\n(B)when assignment is not possible", "target": "(A)"}
{"input": "Q: In Gestalt therapy, transference is usually\nOptions:\n(A)created ab a fantasy of the client\n", "target": "(A)"}
{"input": "Q: \"According to the elaboration likelihood model, a person is most likely to rely on the “central route\"\" for processing information when:\"\nOptions:\n(A)he thinks the message is boring.\n(D)he is in a neutral or slightly negative mood.", "target": "(D)"}
{"input": "Q: Which of the following best describes ethical guidelines regarding sexual intimacies with former therapy clients?\nOptions:\n(B)Psychologists are prohibited from having sexual intimacies with former therapy clients for at least one year following the termination of therapy.\n(C)Psychologists are prohibited from having sexual intimacies with former therapy clients in certain circumstances (e.g., when there is a risk of exploitation).", "target": "(C)"}
{"input": "Q: The TRANSTHEORETICAL MODEL OF CHANGE was originally developed to treat addictive behaviors and 5 stages people pass through in the process of change. Which stage is correctly defined?\nOptions:\n(C)ACTION: time and effort into modifying behavior\n(D)MAINTENANCE: behavior change lasted at least 8 months", "target": "(C)"}
{"input": "Q: Unilateral damage to the left (dominant) hemisphere is least likely to result in an inability to:\nOptions:\n(A)memorize vocabulary words.\n(C)read a map.", "target": "(C)"}
{"input": "Q: In a study where groups of children competed against each other, intergroup hostility was lessened by finding tasks that required the efforts of all the children. This approach is an example of\nOptions:\n(B)superordinate goals\n", "target": "(B)"}
{"input": "Q: Although concurrent individual and group therapy may be necessary for some patients, many therapists do not support it. One of the major concerns is that\nOptions:\n(B)patients wait until they are in their individual sessions before reacting to what occurred in the group\n", "target": "(B)"}
{"input": "Q: A regression model predicting frequency of tantrums from (a) effectiveness of parental commands, (b) consistency of parental discipline, and (c) parental warmth, would result in a model with:\nOptions:\n(B)Four regression coefficients\n(D)One y-intercept and three regression coefficients", "target": "(D)"}
{"input": "Q: A psychologist is asked to see a 10-year-old child for counseling in a school setting. Which of the following statements describes the best way for the psychologist to meet the prescribed ethical responsibility\nOptions:\n(A)The child provides verbal assent to participate in therapy\n(C)The parent(s) provide(s) written consent and the child assents verbally to participate in therapy", "target": "(C)"}
{"input": "Q: A correct statement regarding the many different types of treatment available for alcohol abuse is that\nOptions:\n(C)there is no established evidence to support the greater efficacy of any one technique overall others\n", "target": "(C)"}
{"input": "Q: A patient wishes to use data from your recent neuropsychological evaluation in a civil hearing in which he is suing the supermarket where he slipped and fell. Which answer should be the first step in fulfilling this request after a release has been duly executed?\nOptions:\n(C)Provide the data to an appropriately qualified psychologist as indicated on the release form\n", "target": "(C)"}
{"input": "Q: Down Syndrome is caused by:\nOptions:\n(A)a dominant gene.\n(C)a chromosomal abnormality.", "target": "(C)"}
{"input": "Q: Which is NOT a contributor to individual differences in the development of vocal language skills?\nOptions:\n(C)The quality of nonparental early care and education experiences\n(D)The particular native language in a child’s environment", "target": "(D)"}
{"input": "Q: A client whom Dr. Oliver Olivetti has been seeing for several months has recently changed jobs, and the client has learned that her new insurance plan does not begin covering pre-existing conditions for 12 months. The client asks Dr. Olivetti if he could write his bills so that it appears that she has just started therapy. If Dr. Olivetti complies with the client's request, he is acting:\nOptions:\n(D)unethically.\n", "target": "(D)"}
{"input": "Q: According to EQUITY THEORY in any work situation, people assess both their inputs and outcomes and compare the ratio to other workers and underpayment has a greater impact on worker performance than overpayment. To what does the PROCEDURAL JUSTICE refer to?\nOptions:\n(A)fairness of outcomes\n(C)fairness of procedures", "target": "(C)"}
{"input": "Q: A graduate student designed and conducted a research project for her dissertation and subsequently wrote a journal article describing the study and its results. The original idea for the study was derived from the work of the student’s faculty advisor who also provided the facilities for the student's research. The faculty advisor wants to be listed as first author on the article when it is published. In this situation:\nOptions:\n(A)the student should be listed as the first author.\n(B)it is up to the student to determine authorship credit.", "target": "(A)"}
{"input": "Q: Research on EMDR (eye movement desensitization and reprocessing) suggests that its effectiveness for alleviating the symptoms of PTSD is attributable to which of the following?\nOptions:\n(A)imaginal exposure\n(C)relaxation training", "target": "(A)"}
{"input": "Q: Vicarious liability is most likely to be an issue when a psychologist is acting in which of the following capacities?\nOptions:\n(B)supervisor\n(C)mentor", "target": "(B)"}
{"input": "Q: In classical psychoanalytic theory, a maladaptive behavior that emerges as a compromise between an unconscious impulse and the resulting defense process is called\nOptions:\n(C)repression\n(D)symptom", "target": "(D)"}
{"input": "Q: Female applicants consistently obtain lower scores on a selection test than do male applicants. However, when they are hired, females perform as well on the job as do males. This situation illustrates which of the following?\nOptions:\n(B)differential selection\n(D)unfairness", "target": "(D)"}
{"input": "Q: A psychologist is designing a study that will investigate the impact of age on intelligence. The results of the psychologist’s study will most likely indicate that intelligence test scores begin to decline in early adulthood if she uses which of the following research designs?\nOptions:\n(B)cross-sectional\n", "target": "(B)"}
{"input": "Q: \"To \"\"inoculate\"\" someone against a persuasive message. you would:\"\nOptions:\n(D)provide the person with arguments against her beliefs and weak refutations of those arguments.\n", "target": "(D)"}
{"input": "Q: With regard to the effects of crowding, which of the following is true?\nOptions:\n(B)Men are less likely than women to be stressed by crowded conditions.\n(D)Men and women react aggressively to crowded conditions to about the same degree", "target": "(B)"}
{"input": "Q: A small bit of meat powder in the dog’s mouth was Pavlov’s ___________.\nOptions:\n(A)US\n(B)CS", "target": "(A)"}
{"input": "Q: ___________ is a communication disorder that is characterized by difficulties in regulating the rate, rhythm, pitch, and loudness of speech.\nOptions:\n(B)Paraphasia\n(C)Dysprosody", "target": "(C)"}
{"input": "Q: People rely on which of the following to determine how to act in specific situations (e.g., at a faculty meeting, at a wedding, or in a restaurant)?\nOptions:\n(C)scripts\n(D)life space", "target": "(C)"}
{"input": "Q: Which of the following statements best characterizes short-term memory\nOptions:\n(B)Its span is limited by the number and form of the items presented\n(D)It is the initial level of processing of sensory information", "target": "(B)"}
{"input": "Q: The Frequency Distribution provides a summary of a set of data and indicates the number of cases that fall at a given score within a given range. From your knowledge about this topic, which statement out of the following ones is about the SKEWED DISTRIBUTION?\nOptions:\n(C)It has asymmetrical frequency distributions\n(D)It is used most common with a large number of data points", "target": "(C)"}
{"input": "Q: Which of the following values is least characteristic of Asians and Asian Americans?\nOptions:\n(B)self-control\n(C)egalitarianism", "target": "(C)"}
{"input": "Q: Research comparing heterogeneous and homogeneous work groups has found that, in general, heterogeneous groups:\nOptions:\n(A)are more creative and better at decision-making.\n(C)make better decisions but are less productive overall.", "target": "(A)"}
{"input": "Q: One of the key features for making a differential diagnosis between bulimia nervosa and anorexia nervosa is:\nOptions:\n(B)Maintaining a normal body weight\n", "target": "(B)"}
{"input": "Q: A 15-year-old consistency engaging in unprotected sexual intercourse and denying the possibility of pregnancy and/or contracting sexually transmitted diseases is an example of\nOptions:\n(A)formal operational thought\n(B)adolescent egocentrism", "target": "(B)"}
{"input": "Q: Asking an obese person to restrict eating to limited situations, such as a specific place in the kitchen at particular predetermined times of day, is best described as an example of\nOptions:\n(A)stimulus control\n(D)self-monitoring", "target": "(D)"}
{"input": "Q: A physician refers an asthmatic patient to you for therapy and requests regular progress reports. The most appropriate course of action for you to take is to\nOptions:\n(A)comply with this request, since a physician must be involved whenever you treat someone for a physical condition\n(C)tell the physician thar you can send progress reports only with a written release by the patient", "target": "(C)"}
{"input": "Q: You have been hired as a research assistant for a study that will compare two brief treatments for Social Phobia. The procedures and methods used in the study are ethically sound; however, your supervisor is not informing participants that they may withdraw from the study at any time if they desire to do so. Your best course of action would be to:\nOptions:\n(C)discuss the possible ethical violation with the supervisor.\n", "target": "(C)"}
{"input": "Q: Hypnosis is best described as a response to suggestion involving:\nOptions:\n(B)an alteration in memory, mood, and perception.\n(C)increased compliance to situational demands.", "target": "(B)"}
{"input": "Q: According to ethics codes published by the American and Canadian Psychological Associations, psychologists participating in forensic activities should avoid misleading testimony or reports by\nOptions:\n(B)refusing to testify if they have had 2 prior professional relationship with one of the parties\n(D)acknowledging the limits of their data or conclusions", "target": "(D)"}
{"input": "Q: Dr. Vic Vasquez, a licensed psychologist, provides secretarial services and office space to Dr. Bernice Banquist in exchange for 20% of the fee that Dr. Banquist collects from her therapy clients. When Dr. Vasquez finds that he does not have time to see all of the clients who want to begin therapy with him, he begins referring some of them to Dr. Banquist and charges her 30% of the fee that Dr. Banquist collects from these referred clients. Acording to the ethics codes published by the American and Canadian Psychological Associations, charging more for referred clients is:\nOptions:\n(C)ethical only if the higher fee for referred clients reﬂects the actual costs associated with the referrals.\n", "target": "(C)"}
{"input": "Q: Identify the only construct that is not pertinent to developmental models on intelligence:\nOptions:\n(A)Investment theory\n(D)Primary mental ability theory", "target": "(A)"}
{"input": "Q: Information disclosed by a child client to a psychologist may be kept confidential except when the client reports\nOptions:\n(A)sexual abuse\n(C)strong feelings of attraction to the therapist", "target": "(A)"}
{"input": "Q: The research indicates that which of the following therapist factors has the greatest impact on therapy progress?\nOptions:\n(D)empathy\n", "target": "(D)"}
{"input": "Q: A child with an insecure/anxious-avoidant pattern of attachment:\nOptions:\n(C)is very distressed when separated from his/her mother but pulls away from her when she returns.\n(D)shows little distress when separated from his/her mother and turns away from her when she returns.", "target": "(D)"}
{"input": "Q: You are a psychologist in a state/province that grants the right of privileged communication to clients of psychologist. The attorney of the spouse of a client you are seeing requests that you testify in their divorce hearing. What is the most appropriate course of action if divorce is not specifically covered under the privilege law\nOptions:\n(A)Refuse to testify unless you get written permission from your clients\n", "target": "(A)"}
{"input": "Q: Stress Inoculation Training involves both skills training and modification of maladaptive cognitions. Which of the following steps is incorrectly defined by a young inexperienced therapist:\nOptions:\n(B)SKILLS ACQUISITION→ learning relaxation, self-statements, escape routes not necessary with rehearsing them\n(D)SKILLS ACQUISITION→ learning and rehearsing new skills relaxation, self-statements, escape routes", "target": "(B)"}
{"input": "Q: Vocational interest inventories are generally not recommended as\nOptions:\n(A)educational decision-making aids\n(B)employment selection devices", "target": "(B)"}
{"input": "Q: A psychologist is subpoenaed to testify at a deposition about a current therapy client. This means that the psychologist:\nOptions:\n(B)must appear at the deposition as requested.\n(C)must provide the requested documents.", "target": "(B)"}
{"input": "Q: The reticular formation and reticular activating system are associated with all of the following functions, EXCEPT:\nOptions:\n(A)Decussation of auditory stimuli\n", "target": "(A)"}
{"input": "Q: The match between a child’s temperament and the demands and responses of the environment in which she develops is known as ___________.\nOptions:\n(B)Goodness of fit\n(C)Bidirectionality", "target": "(B)"}
{"input": "Q: A female client finds her financial circumstances altered drastically after her divorce and she can no longer afford your fee. Your responsibility is to\nOptions:\n(C)make sure that she is provided with needed services, from you or from others, at a fee she can afford\n(D)write letter of termination, stating your willingness to resume therapy when she is again able to afford it", "target": "(C)"}
{"input": "Q: With respect to the relationship between achievement and anxiety in schoolchildren, it appears that\nOptions:\n(A)mildly anxious children are better achievers than more anxious ones\n(B)non-anxious children are better achievers than mildly anxious ones", "target": "(A)"}
{"input": "Q: A psychologist at a pain clinic is helping design a medication reduction schedule to address the learned aspects of a patient's medication use. The psychologist’s best recommendation would be to administer medication\nOptions:\n(A)in the patient’s food, because reduction will occur sooner as the patient's awareness of the medication decreases\n(B)at specific times, because then the medication will not be given in response to pain", "target": "(B)"}
{"input": "Q: An organizational psychologist would most likely recommend the use of vestibule training for which of the following jobs?\nOptions:\n(A)airline pilot\n", "target": "(A)"}
{"input": "Q: An educational psychologist designs a screening test to identify underachieving first- and second-grade children who have a learning disability. The psychologist will probably be most concerned that her test has adequate __________ validity.\nOptions:\n(C)concurrent\n", "target": "(C)"}
{"input": "Q: Dr. Ja-Hoon Jang is conducting a research study that involves interviewing junior high school students about their relationships with peers. Prior to beginning the study, Dr. Jang obtained informed consents from the parents of the students as well as assents from the students themselves. During the course of the study, one of the students says he doesn’t want to complete the interview. Dr. Jang should:\nOptions:\n(B)tell the student that he cannot withdraw from the study since he (the student) agreed to participate at the beginning of the study.\n(D)allow the student to withdraw from the study.", "target": "(D)"}
{"input": "Q: Attentional load theory posits:\nOptions:\n(B)The degree to which an ignored stimulus is processed depends on the extent of processing required by the attended stimulus\n", "target": "(B)"}
{"input": "Q: The highest levels of learning and performance are usually associated with:\nOptions:\n(A)low levels of arousal.\n(B)moderate levels of arousal.", "target": "(B)"}
{"input": "Q: The Self-Concept is the individual’s belief about their own attributes. What can happen according to the OVERJUSTIFICATION HYPOTHESIS?\nOptions:\n(A)rewarding people for an enjoyable activity can undermine their interest\n(B)to experience an emotion, a person must first experience physiological arousal, then a cognitive interpretation of that arousal", "target": "(A)"}
{"input": "Q: The primary value underlying the existence of ethical principles is:\nOptions:\n(D)The advancement and protection of the welfare of clients of psychologists\n", "target": "(D)"}
{"input": "Q: Which of the following terms is the best synonym for test validity\nOptions:\n(A)Truthfulness\n", "target": "(A)"}
{"input": "Q: A graduate student’s dissertation chair, Dr. X, turns out to be of little help, and the student ends up obtaining advice and assistance from an associate professor, Dr. Z. Dr. X does review the dissertation when it is completed and she is listed as the dissertation chair. Several months later, the student decides to write an article for a professional journal that is based his dissertation research. In terms of publication credit:\nOptions:\n(B)Dr. Z should be listed as second author if her contribution warrants it.\n", "target": "(B)"}
{"input": "Q: \"\"\"Vicarious liability\"\" is most likely to be a concern when a psychologist is acting in the role of:\"\nOptions:\n(A)supervisor.\n", "target": "(A)"}
{"input": "Q: A key accomplishment of Piaget's preoperational stage is the emergence of:\nOptions:\n(C)formal operations.\n(D)the symbolic function.", "target": "(D)"}
{"input": "Q: A senior psychologist hires a junior psychologist to conduct a research study. The junior psychologist “runs the experiment” and helps analyze and write up the results. When the research is submitted for publication, professional ethics require thar the junior psychologist be\nOptions:\n(B)listed as the first author\n(D)listed as an author", "target": "(D)"}
{"input": "Q: A college freshman obtains a score of 150 on his English final exam, a score of 100 on his math exam, a score of 55 on his chemistry exam, and a score of 30 on his history exam. The means and standard deviations for these tests are, respectively, 125 and 20 for the English exam, 90 and 10 for the math exam, 45 and 5 for the chemistry exam, and 30 and 5 for the history exam. Based on this information, you can conclude that the young man's test performance was best on which exam?\nOptions:\n(B)math\n(C)chemistry", "target": "(C)"}
{"input": "Q: Which of the following objective criteria for assessing job performance has/have the greatest validity\nOptions:\n(A)Absences\n(B)Productivity", "target": "(B)"}
{"input": "Q: On average, men perform better than women on all the following tasks with the exception of:\nOptions:\n(A)Simultaneous processing\n", "target": "(A)"}
{"input": "Q: If a test has a standard error of measurement of 15 points, itis correct to conclude that\nOptions:\n(A)about 68% of the observed scores for the test population lie within 15 points of the mean score\n(B)about 68% of the individuals with a given cure score will have observed scores within 15 points of the true score", "target": "(B)"}
{"input": "Q: Object relations therapy is similar to Freudian psychodynamic therapy in its primary focus on\nOptions:\n(C)early childhood experiences\n(D)the ego, id, and superego", "target": "(C)"}
{"input": "Q: \"According to Hersey and Blanchard's situational leadership model, \"\"employee maturity\"\" is a function of the employee’s:\"\nOptions:\n(C)skills and willingness to assume responsibility.\n", "target": "(C)"}
{"input": "Q: Dr. Jones, a clinical psychologist, has been seeing Lisa L. in therapy for one month. Dr. Jones considers Lisa to be a very attractive woman and finds himself having sexual fantasies about her. As an ethical psychologist, Dr. Jones should:\nOptions:\n(B)confess his attraction to Lisa and make it a topic for mutual examination in therapy.\n(D)continue working with Lisa but consult with a colleague if he believes his attraction might be interfering with his objectivity.", "target": "(D)"}
{"input": "Q: The 1976 Tarasoff decision established:\nOptions:\n(B)a psychologist’s “duty to protect” the intended victim of a therapy client.\n(C)the “80% rule” as a standard for determining the fairness of a selection test or other employment procedure.", "target": "(B)"}
{"input": "Q: You would use the Solomon four-group design in order to:\nOptions:\n(C)evaluate the impact of pretesting.\n(D)evaluate the effects of history and maturation.", "target": "(C)"}
{"input": "Q: Equity theory predicts that a person's satisfaction in a close personal relationship is related to the person's:\nOptions:\n(A)perceptions of his/her own contribution/reward ratio and the ratio of his/her partner.\n(D)comparisons between his/her own relationship outcomes and the relationship outcomes of others.", "target": "(A)"}
{"input": "Q: In client-centered case consultation, the consultant's primary goal is to:\nOptions:\n(A)help the consultee determine how to work more effectively with a particular client.\n(D)work collaboratively with the consultee in delivering the optimal intervention to a client.", "target": "(A)"}
{"input": "Q: Research in the workplace has shown that a subordinate’s participation in goal setting leads to the selection of goals that, when compared to goals set for subordinates unilaterally by their supervisors, are\nOptions:\n(A)more challenging\n(C)never accomplished", "target": "(A)"}
{"input": "Q: A person in the pseudoindependent stage of White racial identity is currently ___________.\nOptions:\n(A)Developing an awareness of the role of Whites in perpetrating racism\n(D)Attempting to resolve moral dilemmas associated with an awareness of race and racism", "target": "(A)"}
{"input": "Q: According to Noam Chomsky’s nativist theory, language is largely the result of:\nOptions:\n(A)innate factors.\n(D)cognitive development.", "target": "(A)"}
{"input": "Q: Which of the following statements is most closely related to the projective hypothesis\nOptions:\n(A)Social functioning is a reflection of psychological functioning\n(D)The way an individual interprets ambiguous situations will reflect inner aspects of psychological functioning", "target": "(D)"}
{"input": "Q: Parametric Tests are used when data is interval or ration. When is it used the ONE-WAY ANOVA?\nOptions:\n(A)used when there is 1 IV and means of more than 2 groups\n", "target": "(A)"}
{"input": "Q: Behaviorist views have been criticized by other approaches for a number of reasons. Ethologists argued that the behaviorists ignored innate, built-in biases in learning due to evolution, but also disagreed with:\nOptions:\n(A)the use of the animals in laboratory experiments\n", "target": "(A)"}
{"input": "Q: The most common functional psychiatric disorder of later life is\nOptions:\n(B)depression\n", "target": "(B)"}
{"input": "Q: The goodness-of-fit developmental mode! proposed by Alexander Thomas and Stella Chess describes\nOptions:\n(B)ways in which adolescents search for a vocational identity\n(C)how temperamental style and the environment work together to determine later development", "target": "(C)"}
{"input": "Q: If adverse impact on some minority group has been observed, which of the following types of tests probably has the best chance of withstanding legal challenge\nOptions:\n(B)Empirically keyed\n(C)Work sample", "target": "(C)"}
{"input": "Q: In comparing Asian and Asian-American therapy clients to Anglo clients, the experts frequently point out that the former:\nOptions:\n(A)tend to prefer a less directive therapeutic approach.\n(D)are likely to express emotional problems as somatic symptoms.", "target": "(D)"}
{"input": "Q: Which of the following best describes the best ethical position on bartering with clients?\nOptions:\n(C)Bartering is ethical and acceptable if it is not clinically contraindicated and not exploitative\n(D)Bartering is ethical only if the client is not otherwise able to pay for services", "target": "(C)"}
{"input": "Q: In an approach-approach conflict, a discernible move in a given direction should\nOptions:\n(A)resolve the conflict in thar direction\n", "target": "(A)"}
{"input": "Q: A psychiatrist sends a signed patient release form to a psychologist requesting a copy of a report on a patient who was assessed 7 years earlier. The psychologist should\nOptions:\n(D)send the report with a covering letter indicating thar the report may now be obsolete\n", "target": "(D)"}
{"input": "Q: After 6 months of once-2-week therapy and several attempts to evaluate and adjust treatment goals and strategies, a patient continues to complain over several sessions thar therapy has not helped and that therapy goals have not been met. The psychologist should\nOptions:\n(A)immediately terminate treatment and refer the patient elsewhere\n(B)discuss the possibility that the patient consult with another therapist", "target": "(B)"}
{"input": "Q: Research on gender differences in conversation style indicates that, when compared to men, women:\nOptions:\n(B)ask more questions.\n", "target": "(B)"}
{"input": "Q: You regularly waive the co-payment for your low-income clients who are covered by insurance and believe this is acceptable since you normally bill your clients on a sliding fee scale. This is:\nOptions:\n(D)ethical only if the insurance company is aware of the arrangement.\n", "target": "(D)"}
{"input": "Q: Emic approaches to multicultural counseling training are often advocated on the basis of\nOptions:\n(C)the need to focus on personal and cultural meaning for each individual client\n(D)the need to view culturally different groups in similar ways", "target": "(C)"}
{"input": "Q: \"Smith, Glass, and Miller’s (1980) meta-analysis of the psychotherapy outcome research found that people receiving therapy are \"\"better off\"\" than about _____% of people who need treatment but do not receive it.\"\nOptions:\n(C)80\n(D)95", "target": "(C)"}
{"input": "Q: A rattle that a 4-month-old is playing with is hidden underneath a blanket in front of the child. She looks at her mother. This child has not yet developed ___________.\nOptions:\n(C)Hand–eye coordination\n(D)Object permanence", "target": "(D)"}
{"input": "Q: When using factor analysis, a major concern of personality theorists has been specifying the\nOptions:\n(A)number of dimensions necessary 10 describe personality\n(B)developmental sequence of personality dimensions", "target": "(A)"}
{"input": "Q: A person is most likely to be helped in an emergency situation when:\nOptions:\n(A)there is a single bystander.\n", "target": "(A)"}
{"input": "Q: The classic triad of symptoms in Parkinson’s disease is:\nOptions:\n(B)Tremor, rigidity, and gait imbalance\n(D)Tremor, rigidity, and bradykinesia", "target": "(D)"}
{"input": "Q: Which of the following is true?\nOptions:\n(A)Spirituality has been shown to act as a protective factor against disease, and it is imperative to put effort toward understanding and incorporating spirituality into clinical practice\n(D)All choices are false", "target": "(A)"}
{"input": "Q: After studying for an examination, retention of the learned material is best facilitated by\nOptions:\n(A)sleeping\n", "target": "(A)"}
{"input": "Q: The primary function of the psychology licensing board is best described as:\nOptions:\n(C)protecting the public welfare.\n(D)accrediting graduate programs in psychology.", "target": "(C)"}
{"input": "Q: Which of the following has the highest predictive validity in personnel selection in industry\nOptions:\n(D)A biographical inventory\n", "target": "(D)"}
{"input": "Q: For practitioners of humanistic psychotherapy, psychopathology is the result of:\nOptions:\n(A)blocked potential.\n", "target": "(A)"}
{"input": "Q: Therapists considering working with elderly persons should especially keep in mind that, on most variables, the elderly\nOptions:\n(C)usually have great difficulty leaning and remembering things\n(D)show greater within-age-group differences than younger persons", "target": "(D)"}
{"input": "Q: Comparison of an individual’s score with an inappropriate norm group affects all of the following except\nOptions:\n(B)reliably of the score\n(C)decisions about the subject", "target": "(C)"}
{"input": "Q: Behavioral treatments for depression typically include:\nOptions:\n(B)Increasing pleasurable activities\n(D)Exposure and Response Prevention", "target": "(B)"}
{"input": "Q: According to Albert Ellis, our emotional and behavioral reactions to an event are due to our beliefs about the event rather than to the event itself. In other words, our beliefs act as a:\nOptions:\n(A)moderator variable.\n(B)mediator variable.", "target": "(B)"}
{"input": "Q: another person's behavior is referred to as the .\nOptions:\n(B)actor-observer effect\n(C)fundamental attribution bias", "target": "(C)"}
{"input": "Q: Magical thinking would predispose a child of what age range to infer chat his or her father died because of the child’s own misbehavior\nOptions:\n(B)3-6 years\n", "target": "(B)"}
{"input": "Q: Dr. Harold Hanson, a psychologist who heads the personnel committee at a mental health facility, recommends that a psychologist who has an unresolved charge of sexual harassment against him not be considered for a promotion. In terms of his ethical responsibilities, Dr. Hanson:\nOptions:\n(A)has acted ethically since sexual harassment is explicitly prohibited by the ethical guidelines.\n(D)has acted unethically by violating the requirements of the ethical guidelines regarding employment procedures.", "target": "(D)"}
{"input": "Q: A 66-year-old client who is depressed, has rhythmic hand movements, and has a flattened affect is probably suffering from\nOptions:\n(A)Parkinson's disease\n(D)Alzheimer's disease", "target": "(A)"}
{"input": "Q: An employee expects greater consistency in the behavior of his boss than is warranted. The employee’s expectation is best accounted for by which of the following?\nOptions:\n(C)fundamental attribution bias\n", "target": "(C)"}
{"input": "Q: Which of the following is the most common neuropsychological complication of AIDS\nOptions:\n(C)Dementia\n", "target": "(C)"}
{"input": "Q: The major difference between job enrichment and job enlargements thar job enrichment\nOptions:\n(C)gives workers quasi-managerial tasks to perform\n(D)lengthens the work cycle", "target": "(C)"}
{"input": "Q: Experiencing intense feelings of shame and guilt upon admitting to a counselor that a family problem exists is common among traditional\nOptions:\n(A)Asian-Americans\n(B)African-Americans", "target": "(A)"}
{"input": "Q: A psychologist who shares an office with another psychologist reruns around midnight to retrieve some papers and unexpectedly comes upon the colleague engaging in sexual relations with one of that colleague's clients. According to ethics codes published by the American and Canadian Psychological Associations, the first psychologist should\nOptions:\n(B)report the colleague to the appropriate local, state/provincial, or national ethics committee\n(D)contact the colleague's client to offer assistance and/or professional advice", "target": "(B)"}
{"input": "Q: A student participant in a research study involving matched pairs decides to withdraw from the study. The chief investigator (who is a licensed psychologist) stresses to the student the importance of the student’s data to the study, but he insists that his data be withdrawn. The investigator should:\nOptions:\n(C)tell the student that his name will be removed from all data and include his data in the study.\n(D)allow the student to withdraw from the study.", "target": "(D)"}
{"input": "Q: In terms of age, Erikson’s ________ stage of psychosocial development corresponds to Freud’s phallic stage.\nOptions:\n(B)autonomy vs. shame and doubt\n(D)initiative vs. guilt.", "target": "(D)"}
{"input": "Q: The principal effect of the current concern co improve the employment opportunities of the educationally or socially disadvantaged has been to encourage the use in employment testing of\nOptions:\n(A)untimed tests of a wide variety of abilities\n(D)work-sample types of tests", "target": "(D)"}
{"input": "Q: Your client is on probation and your ongoing treatment is a condition of his probation. He informs you that he wishes to terminate treatment. You should ___________.\nOptions:\n(C)Agree to termination because your client has free choice\n(D)Discuss the possible ramifications and legal consequences of terminating therapy without informing his probation officer", "target": "(D)"}
{"input": "Q: According to Irvin Yalom, ________in group therapy is the analogue of the therapist-client relationship in individual therapy.\nOptions:\n(A)universality\n(C)cohesiveness", "target": "(C)"}
{"input": "Q: The mental retardation associated with PKU is preventable with:\nOptions:\n(A)removal of environmental toxins.\n(C)a special diet.", "target": "(A)"}
{"input": "Q: Long-term potentiation is believed to play a critical role in which of the following?\nOptions:\n(C)sexual behavior\n(D)learning and memory", "target": "(D)"}
{"input": "Q: According to ethics codes published by the American and Canadian Psychological Associations, if a psychologist knows of an ethical violation of a minor nature by a colleague, the psychologist\nOptions:\n(C)must report the incident to the state/provincial licensing board\n(D)may attempt to resolve the problem informally", "target": "(D)"}
{"input": "Q: When evaluating a defendant’s competence to stand trial, the focus of the evaluation is on the defendant’s:\nOptions:\n(A)ability to distinguish right from wrong.\n(B)ability to comprehend the charges against him/her.", "target": "(B)"}
{"input": "Q: Which of the following strategies would probably be least effective for reducing aggressiveness in children?\nOptions:\n(B)opportunities for catharsis\n", "target": "(B)"}
{"input": "Q: As described by Kobasa et al. (1982), the personality characteristic of hardiness is characterized by which of the following?\nOptions:\n(B)commitment, challenge, and control\n(C)common sense, commitment, and capability", "target": "(B)"}
{"input": "Q: According to general systems theory, negative feedback\nOptions:\n(C)is a critical component in a system's ability to maintain stability\n(D)is most prevalent in dysfunctional systems", "target": "(C)"}
{"input": "Q: The idea that individuals may have different possible developmental trajectories, given the timing of an environmental experience or lack thereof, is the concept of ___________.\nOptions:\n(B)Sensitive or critical periods\n(C)Discontinuity", "target": "(B)"}
{"input": "Q: Job satisfaction appears to be most negatively correlated with\nOptions:\n(B)turnover rare\n", "target": "(B)"}
{"input": "Q: You have been seeing Leticia Lopez in therapy for several months. Leticia is 24 years old and lives with her widowed mother, who is paying for Leticia’s therapy. One day, Leticia's mother calls and says she is very concerned about Leticia and wants to know what she can do to help Leticia feel better about herself. Mrs. Lopez asks that you not tell Leticia that she has called. Your best course of action in this situation would be to:\nOptions:\n(C)Tell Mrs. Lopez that it would be best if you discussed this matter with Leticia.\n", "target": "(C)"}
{"input": "Q: An examinee who makes a number of confabulatory responses on the Rorschach has overgeneralized from a part of the inkblot to the whole. Such responses suggest which of the following?\nOptions:\n(A)a need for immediate gratification\n(D)brain damage, intellectual disability, or emotional disturbance", "target": "(D)"}
{"input": "Q: From the perspective of feminist therapy, therapist self-disclosure is:\nOptions:\n(A)contraindicated because it puts the client in a passive role.\n(D)useful for promoting an egalitarian relationship between the therapist and client.", "target": "(D)"}
{"input": "Q: At the outset of group counseling, the therapist should explain char the obligation of the group member to respect confidentiality is\nOptions:\n(D)on the “honor system” only\n", "target": "(D)"}
{"input": "Q: A person who has difficulty performing a purposeful skilled movement, such as opening a door with a key, despite having intact motor and sensory functioning, most likely has which of the following disorders:\nOptions:\n(A)Transcortical motor aphasia\n(B)Apraxia", "target": "(B)"}
{"input": "Q: When we convert total number of errors on a test to percent correct, or vice versa, we are performing which type of transformation\nOptions:\n(A)Linear\n(B)Nonlinear", "target": "(A)"}
{"input": "Q: A psychologist who already has an established therapeutic relationship with a child is asked to act as an expert witness in a divorce proceeding involving custody of the child. The psychologist's best course of action would be to:\nOptions:\n(A)decline the request to testify.\n", "target": "(A)"}
{"input": "Q: What are the facets of primary prevention?\nOptions:\n(C)Universal, selective, and indicative\n(D)None of the above", "target": "(C)"}
{"input": "Q: A 40-year-old therapist becomes attracted to a 38-year-old client and soon realizes that the feelings are mutual. They discuss the situation and agree to terminate therapy and begin dating. They eventually get married. This is:\nOptions:\n(C)unethical because the therapist began dating a former client before the required two-year time limit.\n(D)unethical unless the therapist and client both received counseling while dating.", "target": "(C)"}
{"input": "Q: The following are methods of increasing reliability and validity in qualitative research designs, EXCEPT:\nOptions:\n(C)Inductive processes\n(D)Member checking", "target": "(C)"}
{"input": "Q: From a behavioral perspective, phobic reactions to benign objects or events are acquired when those objects or events become associated with a stimulus that naturally produces a fear response. In other words, phobic reactions are due to:\nOptions:\n(A)negative reinforcement.\n(D)classical conditioning.", "target": "(D)"}
{"input": "Q: Nonverbal and primarily nonculturally biased abilities are referred to as:\nOptions:\n(A)Fluid intelligence\n(D)Crystallized intelligence", "target": "(A)"}
{"input": "Q: The STANDARD SCORES express raw score distance from mean by SD and considered the most satisfactory type of NR score. Which statement out of the following ones is about T-scores?\nOptions:\n(B)M=50, SD=10- it is used on many psychological tests, MMPI\n(D)M=100, SD=15 or 16", "target": "(B)"}
{"input": "Q: Compared to individuals in their 20s, which of the following is an advantage to having children after the age of 30?\nOptions:\n(A)Older parents typically have more income for additional expenses due to established careers\n(C)Older parents have not had time to build up expectations about children’s behavior", "target": "(A)"}
{"input": "Q: There are certain ways to increase external validity as well. From your knowledge about this ways, to what does the CLUSTER SAMPLING refer to?\nOptions:\n(A)ensures the sample is representative of the population\n(C)sampling unit is a naturally occurring group", "target": "(C)"}
{"input": "Q: The information that family members continuously exchange and that helps minimize deviation and maintain the family's stability is referred to as ________ feedback.\nOptions:\n(C)negative\n", "target": "(C)"}
{"input": "Q: After three sessions with a therapy client, Dr. Leonard Lykowski realizes that he’s feeling somewhat hostile toward the client because she reminds him of his wife who he’s currently divorcing. Dr. Lykowski’s best course of action would be to:\nOptions:\n(C)recognize that his feelings are the result of countertransference and continue to work with the client.\n(D)consult with another psychologist to determine whether or not to continue seeing the client in therapy.", "target": "(D)"}
{"input": "Q: Berkowitz (1971) revised the original frustration-aggression hypothesis by proposing that frustration leads to aggression when:\nOptions:\n(B)there are aggressive cues in the environment.\n(D)the target of the aggression is of lower-status than the aggressor.", "target": "(B)"}
{"input": "Q: A widely used procedure for matching client aptitudes to job requirements is the\nOptions:\n(B)multiple cut-off technique\n", "target": "(B)"}