{"input": "Q: Approximately how old is the surface of Venus?\nOptions:\n(A)750 million years.\n(C)3 billion years.", "target": "(A)"}
{"input": "Q: Which is not a similarity between Saturn and Jupiter's atmospheres?\nOptions:\n(C)an equatorial wind speed of more than 900 miles per hour\n", "target": "(C)"}
{"input": "Q: Jupiter's orbital distance is roughly 5 AU. How many times brighter would the Sun have to be for Europa to receive the same solar flux that we currently receive on Earth (1380W/m2)?\nOptions:\n(B)25 times brighter\n", "target": "(B)"}
{"input": "Q: The visible part of the electromagnetic spectrum is between ...\nOptions:\n(B)360 to 620 nm.\n(C)380 to 740 nm.", "target": "(C)"}
{"input": "Q: The name of the black hole in the center of our Milky Way is ...\nOptions:\n(A)Altair A*\n(D)Sagittarius A*", "target": "(D)"}
{"input": "Q: Suppose you live on the Moon. How long is a day (i.e. from sunrise to sunrise)?\nOptions:\n(B)24 hours\n(C)29 Earth days", "target": "(C)"}
{"input": "Q: What is the source of the material that causes meteor showers?\nOptions:\n(A)Asteroid impacts elsewhere in the solar system throw sand-sized particles into space and occasionally the Earth passes through a cloud of these particles which burn up in our atmosphere and cause a meteor shower.\n(D)The nuclei of comets gradually disintegrate and spread out along their orbital paths. When the Earth passes through the orbit of an comet we are bombarded by sand-sized particles that cause a meteor shower.", "target": "(D)"}
{"input": "Q: What is the Cassini division of Saturn's rings?\nOptions:\n(A)a dark ring visible from Earth composed of dark dusty particles\n(D)a large gap visible from Earth produced by an orbital resonance with the moon Mimas", "target": "(D)"}
{"input": "Q: The lunar maria are:\nOptions:\n(C)dark lavas filling older impact basins\n(D)the bright regions on the Moon", "target": "(C)"}
{"input": "Q: Why can't we see the Sun's corona except during total solar eclipses?\nOptions:\n(D)It's too diffuse\n", "target": "(D)"}
{"input": "Q: What does the astronomical term ecliptic describe?\nOptions:\n(A)The path of the Sun in the sky throughout a year.\n(D)The central line through the axis of rotation.", "target": "(A)"}
{"input": "Q: Mars might be a place for future human explorations. However humans can not breathe on the surface of Mars because the atmosphere consists mostly of ...\nOptions:\n(B)Argon\n(D)CO2", "target": "(D)"}
{"input": "Q: The terrestrial planet cores contain mostly metal because\nOptions:\n(D)metals differentiated to the center during a time when the interiors were molten throughout.\n", "target": "(D)"}
{"input": "Q: Which of the following is/are common feature(s) of all fresh (i.e. not eroded) impact craters formed on solid surfaces:\nOptions:\n(C)central peaks\n(D)A and B only", "target": "(D)"}
{"input": "Q: The nebular theory of the formation of the solar system successfully predicts all but one of the following. Which one does the theory not predict?\nOptions:\n(B)the equal number of terrestrial and jovian planets\n(D)asteroids Kuiper-belt comets and the Oort cloud", "target": "(B)"}
{"input": "Q: How does the greenhouse effect work?\nOptions:\n(B)Greenhouse gases transmit visible light allowing it to heat the surface but then absorb infrared light from Earth trapping the heat near the surface.\n(D)Greenhouse gases absorb X-rays and ultraviolet light from the Sun which then heat the atmosphere and the surface.", "target": "(B)"}
{"input": "Q: The belts and zones of Jupiter are\nOptions:\n(B)alternating bands of rising and falling air at different latitudes.\n(C)alternating regions of charged particles in Jupiter's magnetic field.", "target": "(B)"}
{"input": "Q: Why do Uranus and Neptune have blue methane clouds but Jupiter and Saturn do not?\nOptions:\n(A)Methane does not condense into ice in the warmer atmospheric temperatures of Jupiter and Saturn.\n(D)Methane reacts with the abundant ammonia clouds in Jupiter and Saturn and is removed from the atmosphere.", "target": "(A)"}
{"input": "Q: Find the best approximation for the surface temperature of the Sun:\nOptions:\n(A)6000 K\n(C)9000 K", "target": "(A)"}
{"input": "Q: What would weigh the most on the moon?\nOptions:\n(A)A kilogram of feathers\n(C)Five kilograms of feathers", "target": "(C)"}
{"input": "Q: Jupiter and the other jovian planets are sometimes called \"gas giants.\" In what sense is this term misleading?\nOptions:\n(B)They actually contain a significant fraction of non-gaseous matter.\n", "target": "(B)"}
{"input": "Q: What is the correct numerical value and unit of the Boltzmann constant?\nOptions:\n(C)1.38 × 10−23 m^2 · kg · s^−2 · K^−1\n(D)1.38 × 10−24 m^2 · kg · s^−2 · K^−2", "target": "(C)"}
{"input": "Q: The axis of the Earth is tilted at an angle of approximately ... relative to the orbital plane around the Sun.\nOptions:\n(A)20.3 degrees\n(D)23.5 degrees", "target": "(D)"}
{"input": "Q: Previous IAAC rounds featured Proxima/Alpha Centauri as closes star(system) to the Earth. Which one is the second closest star(system)?\nOptions:\n(A)Wolf 359\n(D)Barnard’s Star", "target": "(D)"}
{"input": "Q: Some of Mars'water is frozen in the soil and the ice caps and some was lost due to solar wind stripping but much of the original water is thought to have been lost through another mechanism. What happened to this \"lost\"water?\nOptions:\n(B)it was broken into hydrogen and oxygen by ultraviolet light and the hydrogen was lost through thermal escape\n(C)it was consumed by a civilization of thirsty Martians", "target": "(B)"}
{"input": "Q: The sky is blue because\nOptions:\n(A)the Sun mainly emits blue light.\n(D)molecules scatter blue light more effectively than red light.", "target": "(D)"}
{"input": "Q: Our current best observations show that Pluto has\nOptions:\n(A)one medium sized satellite and two small satellites.\n", "target": "(A)"}
{"input": "Q: What do meteorites reveal about the solar system?\nOptions:\n(C)They reveal that the age of the solar system is approximately 4.6 billion years.\n(D)They reveal that the solar system once contained 10 planets.", "target": "(C)"}
{"input": "Q: What is the source of the material that causes meteor showers?\nOptions:\n(A)Near-Earth asteroids gradually disintegrate and spread out along their orbital path. When the Earth passes through the orbit of an asteroid we are bombarded by sand-sized particles which cause a meteor shower.\n(D)The nuclei of comets gradually disintegrate and spread out along the comet's orbital path. When the Earth passes through the orbit of a comet we are bombarded by sand-sized particles which cause a meteor shower.", "target": "(D)"}
{"input": "Q: Suppose the angular separation of two stars is smaller than the angular resolution of your eyes. How will the stars appear to your eyes?\nOptions:\n(B)You will see two distinct stars.\n(C)The two stars will look like a single point of light.", "target": "(C)"}
{"input": "Q: On which planet in our solar system can you find the Great Red Spot?\nOptions:\n(A)Venus\n(C)Jupiter", "target": "(C)"}
{"input": "Q: One astronomical unit (AU) is equal to approximately ...\nOptions:\n(B)150 million km\n(D)190 million km", "target": "(B)"}
{"input": "Q: The Milky Way is part of a giant supercluster with a diameter of 160 Mpc. What is the name of this supercluster?\nOptions:\n(B)Laniakea\n(D)Boötes", "target": "(B)"}
{"input": "Q: As the life of a star progresses heavy elements are produced. The elements form layers around the star in this order (starting from the outer layer):\nOptions:\n(A)H → He → Li → N → O → Si → Fe\n(B)H → He → C → O → Ne → Si → Fe", "target": "(B)"}
{"input": "Q: Where is the crater from the impact that is believed to be responsible for the mass extinction of dinosaurs 65 million years ago?\nOptions:\n(B)Chicxulub Crater Yucatan Peninsula in Mexico.\n(C)Quebec Canada.", "target": "(B)"}
{"input": "Q: Besides large astronomical objects astrophysicists are also interested in small particles from space. Which one of these particles has the weakest interactions with other particles?\nOptions:\n(C)ν Neutrinos\n", "target": "(C)"}
{"input": "Q: What is the second most common element in the solar system?\nOptions:\n(C)Methane\n(D)Helium", "target": "(D)"}
{"input": "Q: Why is Saturn almost as big as Jupiter despite its smaller mass?\nOptions:\n(A)Jupiter's greater mass compresses it more thus increasing its density.\n", "target": "(A)"}
{"input": "Q: Which statement about an atom is not true:\nOptions:\n(A)The nucleus contains most of the atom’s mass but almost none of its volume.\n(C)A neutral atom always has equal numbers of neutrons and protons.", "target": "(C)"}
{"input": "Q: How did Eratosthenes estimate the size of Earth in 240 B.C.?\nOptions:\n(B)By measuring the size of Earth's shadow on the Moon in a lunar eclipse.\n(C)By comparing the maximum altitude of the Sun in two cities at different latitudes at the same time on the same day.", "target": "(C)"}
{"input": "Q: How do we know how old the Earth is?\nOptions:\n(D)From radioactive dating of rocks and meteorites.\n", "target": "(D)"}
{"input": "Q: Why are there no impact craters on the surface of Io?\nOptions:\n(A)Io did have impact craters but they have all been buried in lava flows.\n(C)Jupiter's strong gravity attracted the planetesimals more strongly than Io and thus none landed on its surface.", "target": "(A)"}
{"input": "Q: The constellation ... is a bright W-shaped constellation in the northern sky.\nOptions:\n(C)Cassiopeia\n(D)Cepheus", "target": "(C)"}
{"input": "Q: Which planet(s) in the solar system has/have active plate tectonics?\nOptions:\n(C)Earth\n(D)Mars and Earth", "target": "(C)"}
{"input": "Q: Which of the jovian planets have rings?\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q: Radio telescopes are crucial for astronomical observations. Which one of these well-known radio telescopes has the largest parabolic antenna?\nOptions:\n(B)Arecibo Telescope\n", "target": "(B)"}
{"input": "Q: What is the significance of the 1:2:4 resonance in the Jupiter's moons system?\nOptions:\n(B)It makes the orbit of Io slightly elliptical.\n", "target": "(B)"}
{"input": "Q: What is not true of Jupiter's magnetic field?\nOptions:\n(C)it causes spectacular auroral displays at Jupiter's north and south poles\n(D)it switches polarity every 11 years", "target": "(D)"}
{"input": "Q: If you know both the actual brightness of an object and its apparent brightness from your location then with no other information you can estimate:\nOptions:\n(D)Its distance from you\n", "target": "(D)"}
{"input": "Q: The Large Magellanic Cloud is ...\nOptions:\n(A)a dwarf galaxy orbiting the Milky Way.\n", "target": "(A)"}
{"input": "Q: By locating the north celestial pole (NCP) in the sky how can you determine your latitude?\nOptions:\n(C)The altitude of the NCP is the same as your latitude.\n", "target": "(C)"}
{"input": "Q: What element is most common among the Jovian Planets?\nOptions:\n(A)Hydrogen\n(B)Helium", "target": "(A)"}
{"input": "Q: Which is not an essential requirement for life as we know it?\nOptions:\n(A)The ability to breathe oxygen\n(D)A and B", "target": "(D)"}
{"input": "Q: Why do we look for water-ice in craters at Mercury's pole?\nOptions:\n(A)Actually water-ice is all over Mercury and not just at the poles.\n(D)These craters contain the only permanently shadowed regions on Mercury", "target": "(D)"}
{"input": "Q: Sunspots are black regions that temporarily appear on the Sun. Their number highly increases every ... years. This period is also called the solar cycle.\nOptions:\n(B)11\n(C)13", "target": "(B)"}
{"input": "Q: Which of the following statements about sidereal and solar days is not true?\nOptions:\n(C)A solar day represents more than 360° of rotation for the earth.\n(D)The time it takes for the Moon to make one circuit of our sky is one solar day.", "target": "(D)"}
{"input": "Q: The Pleiades is an open star cluster that plays a role in many ancient stories and is well-known for containing ... bright stars.\nOptions:\n(B)7\n(D)12", "target": "(B)"}
{"input": "Q: Which of the following was not cited as evidence for life in the martian meteorite ALH84001?\nOptions:\n(A)Complex organic molecules specifically PAHs\n(D)Amino acids with a preferred orientation or \"chirality\"", "target": "(D)"}
{"input": "Q: All of the following have been cited as evidence for the Giant Impact Hypothesis except:\nOptions:\n(B)Most rocks on the Moon’s surface are older than those on the Earth’s surface.\n(D)The Moon was once entirely molten.", "target": "(B)"}
{"input": "Q: Which living organisms most resemble the common ancestor of all life according to genetic testing?\nOptions:\n(C)organisms living deep in the oceans around seafloor volcanic vents and in hot springs\n(D)plankton that use sunlight as an energy source through photosynthesis", "target": "(C)"}
{"input": "Q: You observe the visible spectrum of a star viewed through a cloud of cool hydrogen gas.\nOptions:\n(B)You see the star’s blackbody spectrum with absorption lines due to hydrogen.\n(C)You see only emission lines characteristic of hydrogen.", "target": "(B)"}
{"input": "Q: Imagine that the Earth was instantly moved to an orbit three times further away from the Sun. How much longer would a year be?\nOptions:\n(B)about 5.2 times longer\n(C)Not enough information. It will depend on the inclination of the new orbit", "target": "(B)"}
{"input": "Q: From shortest to longest wavelength which of the following correctly orders the different categories of electromagnetic radiation?\nOptions:\n(B)radio infrared visible light ultraviolet X rays gamma rays\n(D)gamma rays X rays ultraviolet visible light infrared radio", "target": "(D)"}
{"input": "Q: We were first able to accurately measure the diameter of Pluto from:\nOptions:\n(A)a New Horizons flyby in the 1990s\n(C)brightness measurements made during mutual eclipses of Pluto and Charon", "target": "(C)"}
{"input": "Q: What type of radiation causes a black hole to evaporate over time?\nOptions:\n(D)Hawking radiation\n", "target": "(D)"}
{"input": "Q: Why do jovian planets bulge around the equator that is have a \"squashed\" appearance?\nOptions:\n(A)Their large systems of moons and rings gravitationally attract the mass around the equator more.\n(C)Their rapid rotation flings the mass near the equator outward.", "target": "(C)"}
{"input": "Q: How does the greenhouse effect work?\nOptions:\n(A)Greenhouse gases absorb infrared light from the Sun which then heats the atmosphere and the surface.\n(C)Greenhouse gases transmit visible light allowing it to heat the surface but then absorb infrared light from Earth trapping the heat near the surface.", "target": "(C)"}
{"input": "Q: How do astronomers think Jupiter generates its internal heat?\nOptions:\n(B)nuclear fusion\n(C)by contracting changing gravitational potential energy into thermal energy", "target": "(C)"}
{"input": "Q: Where are the Trojan asteroids located?\nOptions:\n(B)on orbits that cross Earth's orbit\n(D)along Jupiter's orbit 60° ahead of and behind Jupiter", "target": "(D)"}
{"input": "Q: Mars has an atmospheric pressure of 600 pascals. If the acceleration due to gravity on Mars is (roughly) 4 m/s2 and the surface area of Mars is about 145000000 square km what is the approximate mass of the martian atmosphere?\nOptions:\n(D)2.2x1016 kg\n", "target": "(D)"}
{"input": "Q: When was the telescope invented by Galileo?\nOptions:\n(B)1509\n(C)1609", "target": "(C)"}
{"input": "Q: Why are Cepheid stars relevant for astronomers?\nOptions:\n(B)To measure galactic distances.\n", "target": "(B)"}
{"input": "Q: Which of the following is not one of nor follows directly from Kepler's laws?\nOptions:\n(C)The force of attraction between any two objects decreases with the square of the distance between their centers.\n(D)A planet travels faster when it is nearer to the Sun and slower when it is farther from the Sun.", "target": "(C)"}
{"input": "Q: Approximately how long does it take Pluto to orbit the Sun once?\nOptions:\n(C)250 years\n", "target": "(C)"}
{"input": "Q: Meteorites with high metal content probably are\nOptions:\n(B)chunks of large differentiated asteroids that were shattered by collisions.\n(D)leftover chunks of rock from the earliest period in the formation of the solar system.", "target": "(B)"}
{"input": "Q: If you lived on Venus what phases of the Earth would you see? (Assume your telescope can see through Venus’s thick clouds…)\nOptions:\n(B)Waning crescent New Waxing crescent\n(C)Waxing gibbous Full Waning gibbous", "target": "(C)"}
{"input": "Q: Why did Ptolemy have the planets orbiting Earth on ‘circles upon circles’ in his model of the universe?\nOptions:\n(B)To explain the fact that planets sometimes appear to move westward rather than eastward relative to the stars in our sky.\n(D)To properly account for the varying distances of the planets from Earth.", "target": "(B)"}
{"input": "Q: The astronomical unit parsec (pc) plays a crucial role in astronomy. One parsec is equal to about 3.26 light-years. How is one parsec defined in astronomy?\nOptions:\n(A)Distance at which one astronomical unit measures one arcsecond from Earth.\n(D)Historical distance to the brightest star Sirius.", "target": "(A)"}
{"input": "Q: Calculate the ratio of the solar radiation flux on Mercury's surface for perihelion (0.304 AU) versus aphelion (0.456 AU).\nOptions:\n(B)1:2\n(D)9:4", "target": "(D)"}
{"input": "Q: Why did the solar nebula heat up as it collapsed?\nOptions:\n(B)Radiation from other nearby stars that had formed earlier heated the nebula.\n(D)As the cloud shrank its gravitational potential energy was converted to kinetic energy and then into thermal energy.", "target": "(D)"}
{"input": "Q: Why does Earth have the strongest magnetic field among the terrestrial worlds?\nOptions:\n(B)It is the most volcanically active world.\n(C)It is the only one that has both a partially molten metallic core and reasonably rapid rotation.", "target": "(C)"}
{"input": "Q: Planetary rings are\nOptions:\n(B)composed of a large number of individual particles that orbit their planet in accord with Kepler's third law.\n(D)all of the above", "target": "(D)"}
{"input": "Q: The famous Drake equation attempts to answer the following question:\nOptions:\n(B)Is the universe infinitely large?\n(D)Are we alone in the universe?", "target": "(D)"}
{"input": "Q: What defines the habitable zone around a star?\nOptions:\n(A)the region around a star where liquid water can potentially exist on planetary surfaces\n(C)the region around a star where the ultraviolet radiation does not destroy organisms on a planetary surface", "target": "(A)"}
{"input": "Q: From laboratory measurements we know that a particular spectral line formed by hydrogen appears at a wavelength of 486.1 nanometers (nm). The spectrum of a particular star shows the same hydrogen line appearing at a wavelength of 485.9 nm. What can we conclude?\nOptions:\n(C)The star is moving toward us.\n", "target": "(C)"}
{"input": "Q: In addition to the conditions required for any solar eclipse what must also be true in order for you to observe a total solar eclipse?\nOptions:\n(C)The Earth must be near aphelion in its orbit of the Sun.\n(D)The Moon's umbra must touch the area where you are located.", "target": "(D)"}
{"input": "Q: Why do scientists think Mars was once warmer and wetter?\nOptions:\n(C)there are many geologic features on Mars that are difficult to explain unless liquid water was once stable at the surface\n", "target": "(C)"}
{"input": "Q: How do we think the \"hot Jupiters\" around other stars were formed?\nOptions:\n(B)They formed as gas giants beyond the frost line and then migrated inwards.\n", "target": "(B)"}
{"input": "Q: Which factor s most important in determining the history of volanism and tectonism on a planet?\nOptions:\n(A)size of the planet\n(D)rotation period", "target": "(A)"}
{"input": "Q: You’ve made a scientific theory that there is an attractive force between all objects. When will your theory be proven to be correct?\nOptions:\n(C)You can never prove your theory to be correct only “yet to be proven wrong”.\n", "target": "(C)"}
{"input": "Q: When traveling north from the United States into Canada you’ll see the North Star (Polaris) getting _________.\nOptions:\n(B)Dimmer\n(C)Higher in the sky", "target": "(C)"}
{"input": "Q: You've made a scientific theory that there is a force between all objects. This forcce has both a dark and light side. When will your theory be proven correct?\nOptions:\n(A)When you and many other Jedi have tested the hypothesis\n(C)You can never prove your theory to be correct only \"yet to be proven wrong.\"", "target": "(C)"}
{"input": "Q: A Mars year is approximately how many Earth years long?\nOptions:\n(B)1\n(C)2", "target": "(C)"}
{"input": "Q: How do scientists know that the majority of meteorites come from the asteroid belt?\nOptions:\n(A)The spectra of some meteorites are similar to the spectra of asteroids in the asteroid belt.\n(B)The asteroid belt is the only possible source of meteorites therefore they must originate there.", "target": "(A)"}
{"input": "Q: According to the Solar Nebular theory what are asteroids and comets?\nOptions:\n(D)They are leftover planetesimals that never accreted into planets.\n", "target": "(D)"}
{"input": "Q: Pluto's extremely cold (~40 K) surface is composed of:\nOptions:\n(B)nitrogen methane and carbon monoxide ices which sublimate into an atmosphere near perihelion\n(C)nitrogen methane and carbon monoxide ices which always remain frozen", "target": "(B)"}
{"input": "Q: Mars has an atmosphere that is almost entirely carbon dioxide.Why isn't there a strong greenhouse effect keeping the planet warm?\nOptions:\n(D)the atmosphere on Mars is too thin to trap a significant amount of heat\n", "target": "(D)"}
{"input": "Q: Which of these has NOT been one of the main hypotheses considered for the origin of the Moon?\nOptions:\n(A)The Moon split from the Earth due to tidal forces.\n(B)The Moon was captured into Earth orbit.", "target": "(A)"}
{"input": "Q: How do scientists know that the majority of meteorites come from the asteroid belt?\nOptions:\n(B)The spectra of some meteorites are similar to the spectra of asteroids in the asteroid belt.\n(D)The asteroid belt is the only possible source of meteorites therefore they must originate there.", "target": "(B)"}
{"input": "Q: Why are the season's in Mars' southern hemisphere so extreme?\nOptions:\n(C)because Mars has a more eccentric orbit than the Earth\n", "target": "(C)"}
{"input": "Q: Planet X orbits its sun once every 100 Earth days and rotates in the prograde direction around its axis with a sidereal day of 100 Earth days. How long is a solar day on Planet X?\nOptions:\n(D)There is no solar day Planet X is tidally locked\n", "target": "(D)"}
{"input": "Q: The terrestrial planet cores contain mostly metal because\nOptions:\n(A)the entire planets are made mostly of metal.\n(C)metals sank to the center during a time when the interiors were molten throughout.", "target": "(C)"}
{"input": "Q: Why do we see essentially the same face of the Moon at all times?\nOptions:\n(B)because the Moon does not rotate\n(D)because the Moon's rotational and orbital periods are equal", "target": "(D)"}
{"input": "Q: The so-called “bigfoot” on Mars was actually a rock that was about 5 cm tall. It had an angular size of about 0.5 degrees (~30 pixels). How far away was this rock from the rover?\nOptions:\n(A)About 6 meters\n(D)About 10 feet", "target": "(A)"}
{"input": "Q: The two moons of Mars are called ...\nOptions:\n(D)Phobos and Deimos\n", "target": "(D)"}
{"input": "Q: Why is Saturn almost as big as Jupiter despite its smaller mass?\nOptions:\n(A)Jupiter's greater mass compresses it more thus increasing its density.\n", "target": "(A)"}
{"input": "Q: Venus shows evidence of which of the following surface processes?\nOptions:\n(B)Erosion\n(D)A B and C", "target": "(D)"}
{"input": "Q: Mars has an atmosphere that is almost entirely carbon dioxide.Why isn't there a strong greenhouse effect keeping the planet warm?\nOptions:\n(A)the atmosphere on Mars is too thin to trap a significant amount of heat\n(C)Mars does not have enough internal heat to drive the greenhouse effect", "target": "(A)"}
{"input": "Q: Which of the following is not true?\nOptions:\n(A)The Earth and Venus are in a 1:1 orbital resonance (for every 1 Earth orbit there is exactly 1 Venus orbit)\n(B)Neptune and Pluto are in a 3:2 orbital resonance (for every 3 Neptune orbits there are exactly 2 Pluto orbits)", "target": "(A)"}
{"input": "Q: What Mars mission will be landing on May 25 2008 and will dig a trench into (hopefully) ice-rich soil?\nOptions:\n(B)Mars Exploration Rovers\n(D)Phoenix Mars Lander", "target": "(D)"}
{"input": "Q: Approximately how far away is the Andromeda Galaxy?\nOptions:\n(C)2.5 million light years\n(D)3.2 million light years", "target": "(C)"}
{"input": "Q: The distance between the Earth and the star Altair is one million times greater than the distance between the Earth and the Sun. How far is Altair from the Earth?\nOptions:\n(C)1.5 x 1014 meters\n(D)1.5 x 1017 meters", "target": "(D)"}
{"input": "Q: Moons cause/contribute to which of the following?\nOptions:\n(C)gaps between rings.\n(D)Moons contribute to all of the above.", "target": "(D)"}
{"input": "Q: A comet of mass m impacts the earth (mass M radius R) at the minimum impact speed. What is the expression for the total energy released in the impact?\nOptions:\n(C)0.5*m*(2GM/R)\n", "target": "(C)"}
{"input": "Q: Kirkwood gaps are observed in the main asteroid belt including at the position(s) where:\nOptions:\n(A)asteroids would orbit with a period half that of Jupiter\n", "target": "(A)"}
{"input": "Q: What is the so-called bolometric luminosity in astronomy?\nOptions:\n(A)The luminosity integrated over vertically polarized wavelengths.\n(D)The luminosity integrated over all wavelengths.", "target": "(D)"}
{"input": "Q: The lithosphere of a planet is the layer that consists of\nOptions:\n(D)the rigid rocky material of the crust and uppermost portion of the mantle.\n", "target": "(D)"}
{"input": "Q: Which of the following countries has sent landers to Venus?\nOptions:\n(A)The U.S.S.R.\n(B)The U.S.", "target": "(A)"}
{"input": "Q: Which of the following most likely explains why Venus does not have a strong magnetic field?\nOptions:\n(A)Its rotation is too slow.\n(D)It does not have a metallic core.", "target": "(A)"}
{"input": "Q: Which of the following is/are true?\nOptions:\n(C)Titan's atmosphere is composed mostly of hydrocarbons\n(D)A and D", "target": "(D)"}
{"input": "Q: Why is it thought that the climate on Mars changed when the planet lost its strong magnetic field?\nOptions:\n(C)without a strong magnetic field the solar wind stripped away most of the atmosphere significantly reducing the greenhouse effect and cooling Mars down\n", "target": "(C)"}
{"input": "Q: Why are the inner planets made of denser materials than the outer planets?\nOptions:\n(A)In the beginning when the protoplanetary disk was spinning faster centrifugal forces flung the lighter materials toward the outer parts of the solar nebula.\n(B)In the inner part of the nebula only metals and rocks were able to condense because of the high temperatures whereas hydrogen compounds although more abundant were only able to condense in the cooler outer regions.", "target": "(B)"}
{"input": "Q: Why is the sky blue?\nOptions:\n(B)Because the sky reflects the color of the Earth's oceans.\n(C)Because the atmosphere preferentially scatters short wavelengths.", "target": "(C)"}
{"input": "Q: How do astronomers think Jupiter generates its internal heat?\nOptions:\n(B)by contracting changing gravitational potential energy into thermal energy\n(D)chemical processes", "target": "(B)"}
{"input": "Q: How did Eratosthenes estimate the size of the Earth in 240 B.C.?\nOptions:\n(A)By measuring the maximum altitude of the Sun in two cities at different latitudes at the same time on the same day.\n(D)By sending fleets of ships around the Earth.", "target": "(A)"}
{"input": "Q: A sand bag has a mass of 5kg and weight 50N on Earth. What is the mass and weight of this sand bag on a planet with half the gravity compared to Earth?\nOptions:\n(B)Mass 5kg weight 50N\n(C)Mass 5kg weight 25N", "target": "(C)"}
{"input": "Q: What about asteroids makes them stand out in sky surveys searching for them?\nOptions:\n(D)Asteroids have substantial motion relative to the background stars\n", "target": "(D)"}
{"input": "Q: What effect or effects would be most significant if the Moon's orbital plane were exactly the same as the ecliptic plane?\nOptions:\n(B)Solar eclipses would last much longer.\n(C)Solar eclipses would be much more frequent.", "target": "(C)"}
{"input": "Q: Which of the following lists the ingredients of the solar nebula from highest to lowest percentage of mass in the nebula?\nOptions:\n(A)hydrogen compounds (H2O CH4 NH3) light gases (H He) metals rocks\n(D)light gases (H He) hydrogen compounds (H2O CH4 NH3) rocks metals", "target": "(D)"}
{"input": "Q: Which of the following is/are NOT caused by orbital resonance?\nOptions:\n(A)2:3 periodic ratio of Neptune:Pluto\n(D)Breaking of small Jovian moons to form ring materials.", "target": "(D)"}
{"input": "Q: What are the conditions necessary for a terrestrial planet to have a strong magnetic field?\nOptions:\n(C)a molten metallic core only\n(D)both a molten metallic core and reasonably fast rotation", "target": "(D)"}
{"input": "Q: What is true for a type-Ia (\"type one-a\") supernova?\nOptions:\n(A)This type occurs in binary systems.\n(D)This type produces high amounts of X-rays.", "target": "(A)"}
{"input": "Q: What is true about the rotation of a solid disk?\nOptions:\n(C)The period of rotation is the same on every point on the disk\n(D)The part closer to the axis has a shorter period", "target": "(C)"}
{"input": "Q: How are planetary rings made?\nOptions:\n(A)From the dismantling of small moons by impacts\n", "target": "(A)"}
{"input": "Q: Which of the following methods has led to the most discoveries of massive planets orbiting near their parent stars?\nOptions:\n(A)detecting the gravitational effect of an orbiting planet by looking for the Doppler shifts in the star's spectrum\n(D)detecting the starlight reflected off the planet", "target": "(A)"}
{"input": "Q: Which one of these constellations is not located along the Milky Way in the sky?\nOptions:\n(D)Leo\n", "target": "(D)"}
{"input": "Q: The resolution of a telescope is a measure of its:\nOptions:\n(A)Ability to magnify distant objects\n(B)Ability to measure the angular separation of objects", "target": "(B)"}
{"input": "Q: The star Betelgeuse is one of the brightest stars in the night sky with remarkable red color. In which constellation is Betelgeuse located?\nOptions:\n(D)Orion\n", "target": "(D)"}
{"input": "Q: Why does the plasma (ion) tail of a comet always point away from the Sun?\nOptions:\n(B)The conservation of the angular momentum in the tail keeps it always pointing away from the Sun.\n(D)The solar wind electromagnetically \"blows\" the ions directly away from the Sun.", "target": "(D)"}
{"input": "Q: The so-called dark energy is a model to explain ...\nOptions:\n(C)the acceleration of the universe.\n(D)the microwave background of the universe.", "target": "(C)"}
{"input": "Q: When will the next major impact occur on Earth?\nOptions:\n(D)Could be any time. The probability of impact is the same next year as it is for any later year.\n", "target": "(D)"}
{"input": "Q: The term Schwarzschild radius usually describes properties of ...\nOptions:\n(B)pulsars.\n(C)black holes.", "target": "(C)"}
{"input": "Q: The second cosmic velocity (or escape velocity) is the speed required by an object to escape the gravitational field of a celestial body with mass M and radius R. Which formula correctly calculates this velocity? (G: gravitational constant)\nOptions:\n(C)v = sqrt(2GM/R)\n", "target": "(C)"}
{"input": "Q: 20000 years from now ...\nOptions:\n(C)The Moon will be further from the Earth and the Earth’s day will be longer.\n", "target": "(C)"}
{"input": "Q: Why is the Mars Exploration Rover Spirit currently tilted towards the north?\nOptions:\n(B)Because it’s in the southern hemisphere where it is winter now.\n", "target": "(B)"}
{"input": "Q: Most people use C°(degree Celsius) to measure everyday temperatures. Astronomers prefer to use K (Kelvin) to measure temperatures. Approximately how many Kelvin are 25 C°?\nOptions:\n(A)200 Kelvin\n(C)300 Kelvin", "target": "(C)"}
{"input": "Q: Which of the following characteristics would not necessarily suggest that a rock we found is a meteorite.\nOptions:\n(B)It contains solidified spherical droplets\n(C)It is highly processed", "target": "(C)"}
{"input": "Q: Which of the following moons is NOT one of the Galilean moons?\nOptions:\n(D)Dione\n", "target": "(D)"}
{"input": "Q: Most rocks on the Moon's surface are older than those on the Earth's surface. The best evidence for this is:\nOptions:\n(B)Radioactive dating of lunar samples shows that they are older.\n", "target": "(B)"}
{"input": "Q: The four big moons of Jupiter are Callisto Europa Ganymede and Io. Which one of them has the smallest distance to Jupiter?\nOptions:\n(A)Callisto\n(D)Io", "target": "(D)"}
{"input": "Q: Earth has been gradually warming over the past few decades. Based on a great deal of evidence scientists conclude that this warming is caused by ________.\nOptions:\n(A)human activities that are increasing the concentration of greenhouse gases in Earth's atmosphere\n(C)the human release of chemicals called CFCs into the stratosphere", "target": "(A)"}
{"input": "Q: Life on Earth originated from\nOptions:\n(A)We don't know for sure.\n(C)comets.", "target": "(A)"}