{"input": "Q: There are three basic types of persuasive advertising campaigns. Which of the following is NOT one of them?\nOptions:\n(C)Idea-oriented\n(D)Result-oriented", "target": "(D)"}
{"input": "Q: Which law restricts corporate communications for publicly traded companies before and during the period that new securities are being registered?\nOptions:\n(A)Securities Act of 1933\n(D)Investment Company Act of 1934", "target": "(A)"}
{"input": "Q: Early email was developed in which decade?\nOptions:\n(A)1960s\n(B)1970s", "target": "(B)"}
{"input": "Q: The 'internal factors' portion of a firm's public relations situation analysis often includes\nOptions:\n(A)a communication audit\n(B)strategy suggestions", "target": "(A)"}
{"input": "Q: What is the major advantage of organizational publications?\nOptions:\n(A)Their ability to provide a revenue source for sponsoring organizations\n(B)Their ability to deliver specific, detailed information to narrowly defined target publics", "target": "(B)"}
{"input": "Q: The ________ phase of the PR process consists of making decisions about which strategies and tactics will be used to respond to the goals of the organization and executing those strategies and tactics.\nOptions:\n(B)implementation\n(D)tactical", "target": "(B)"}
{"input": "Q: A(n) ________ campaign is a paid form of impersonal communication, concerned with selling specific products, services, brands, images, and lifestyles to the public.\nOptions:\n(B)public relations\n(C)advertising", "target": "(C)"}
{"input": "Q: Tyler and his wife have been won over by the advertising campaign supporting Stan Johnson, who is running for mayor, so they put a 'Vote for Stan Johnson in November' sign in their front yard. Tyler and his wife are engaging in ________, the third step of the advertising campaign.\nOptions:\n(C)penetration\n(D)participation", "target": "(D)"}
{"input": "Q: Which of these publics does NOT feature in Grunig and Hunt's (1984) situational theory of publics?\nOptions:\n(B)Dormant\n(D)Active", "target": "(B)"}
{"input": "Q: Which factors are mentioned that influence media coverage of a story?\nOptions:\n(B)Timing, content, media liaison\n(D)Timing, relevance, political slant", "target": "(B)"}
{"input": "Q: The process of identifying publics who are involved and affected by a situation central to an organization is called a(n)\nOptions:\n(C)communication audit\n(D)stakeholder analysis", "target": "(D)"}
{"input": "Q: The second stage of the advertising campaign is to establish ________, or to become known as trustworthy and believable.\nOptions:\n(A)legitimacy\n(C)reliability", "target": "(A)"}
{"input": "Q: According to Russian philosopher Mikhail Bakhtin, in order to create ________, or a well-informed public, all communication about an issue must be ________, or take the form of a dialogue.\nOptions:\n(A)intelligentsia, democratic\n(B)democracy, dialogic", "target": "(B)"}
{"input": "Q: Emma is browsing a popular website when she runs across the story of a well-known actor who was recently pulled over for speeding and driving down the wrong side of the street. It turns out he had been drinking, and the arresting police officer found drugs in the car. The actor's publicist issued a statement claiming the actor was just tired and that the drugs belonged to someone else. Emma can't help having the impression that all public relations are ________ and occur only after something negative has occurred.\nOptions:\n(B)reactive\n(C)manipulative", "target": "(B)"}
{"input": "Q: In the public relations field, what is the most common threat to a client-firm relationship?\nOptions:\n(A)Clients' questions about costs\n(B)Resistance to outside advice", "target": "(A)"}
{"input": "Q: How much has the number of practitioners working in consultancies in the UK grown since 25 years ago?\nOptions:\n(B)Doubled\n(C)Tripled", "target": "(C)"}
{"input": "Q: Which traditional news criterion would you expect to be most important in public relations messages distributed through the mass media?\nOptions:\n(B)Timeliness\n(D)Impact", "target": "(D)"}
{"input": "Q: Which form of communication is most effective in forming or changing predispositions toward an issue?\nOptions:\n(B)Media\n(D)Public", "target": "(B)"}
{"input": "Q: Which of the following entities cannot sue for libel?\nOptions:\n(A)A politician\n(C)A government institution", "target": "(C)"}
{"input": "Q: Which statement is NOT true of both issues management and crisis management?\nOptions:\n(B)They both deal with acute risks.\n(D)Both have the potential to damage an organisation's reputation.", "target": "(B)"}
{"input": "Q: Which of these activities might secondary research involve?\nOptions:\n(B)Conducting a survey\n(D)Examining public records", "target": "(D)"}
{"input": "Q: During which step of the Chase Jones model of issues management should the organization's ability to lead the issue be assessed?\nOptions:\n(A)Identification\n(C)Strategy", "target": "(C)"}
{"input": "Q: In what year did the BBC start broadcasting radio?\nOptions:\n(B)1922\n", "target": "(B)"}
{"input": "Q: In recent years social media has had a major impact on the practice of public relations. In which of the following areas has the impact been greatest and experienced most immediately?\nOptions:\n(A)Politics\n(C)Automotive sales", "target": "(A)"}
{"input": "Q: What are two examples of an evaluation of outcome? \nOptions:\n(A)Change in attitude\n(C)Distribution of message", "target": "(A)"}
{"input": "Q: Watson and Noble (2005) lay out a five-step model for circular evaluation. At which step should pre-testing of strategy and tactics be carried out?\nOptions:\n(A)1\n(C)3", "target": "(C)"}
{"input": "Q: Which of the following information about publications does the Audit Bureau of Circulation NOT provide?\nOptions:\n(C)Traffic\n(D)Readership", "target": "(D)"}
{"input": "Q: Which area of public relations deals with emerging issues and their potential impact on an organization?\nOptions:\n(B)Issues management\n(C)Public affairs", "target": "(B)"}
{"input": "Q: In the Westley and MacLean model of communication, which role describes the way in which the public obtain or receive the message?\nOptions:\n(A)The advocacy role\n(B)The channel's role", "target": "(B)"}
{"input": "Q: The ________ part of a PR campaign includes proactively planning a response strategy, implementing that strategy in the event of a crisis, evaluating the crisis response, and revising the initial response strategy in an effort to improve for future crises.\nOptions:\n(B)crisis management\n", "target": "(B)"}
{"input": "Q: Which statement is true about focus group research?\nOptions:\n(A)The participants should be selected at random.\n(D)The findings generate qualitative data that can be used to develop surveys.", "target": "(D)"}
{"input": "Q: What public relations pioneer is credited with being the first practitioner to insist on \"a place at the management table\"?\nOptions:\n(B)Edward Bernays\n(D)Arthur Page", "target": "(D)"}
{"input": "Q: Internet traffic is expected to grow by 400% in the next few years. What is predicted to be the main driver of this?\nOptions:\n(B)Video\n(C)Music", "target": "(B)"}
{"input": "Q: No-Wait Weight Loss, a diet pill brand, promises its potential consumers that if they take one pill once a day they will lose weight without having to change their diet or start exercising. However, many people who have used the product have complained that they haven't lost weight, and some have even gained weight. No-Wait Weight Loss has been unsuccessful in the ________ stage of the advertising campaign.\nOptions:\n(A)distribution\n(B)penetration", "target": "(A)"}
{"input": "Q: Which definition best describes media convergence?\nOptions:\n(D)Information being delivered in different formats via various digital channels.\n", "target": "(D)"}
{"input": "Q: A book launch would be what kind of common tactic?\nOptions:\n(A)Competition\n(B)Event", "target": "(B)"}
{"input": "Q: Segmentation of the population into psychographics, demographics and geodemographics is especially important in which public relations specialisation?\nOptions:\n(A)Issues management\n(D)Marketing communications", "target": "(D)"}
{"input": "Q: According to Macnamara's (2005) pyramid of evaluation, at which stage is the situation analysis done and used to form objectives and implementation plans?\nOptions:\n(A)Inputs\n(B)Outputs", "target": "(A)"}
{"input": "Q: Louis owns a chemical company that has been irresponsibly disposing of chemical waste and contaminating the community's water supply. Although he knew the company was cutting costs in its waste disposal, he publicly claims to have had no knowledge of the irresponsible practices, blames it on the company's general manager and fires him. What image restoration strategy is Louis using?\nOptions:\n(A)denial\n(C)reducing the offensiveness", "target": "(A)"}
{"input": "Q: You are director of communications for a local non-profit chapter organization that is an affiliate of a large national non-profit organization. You are frequently asked to secure media coverage using news releases provided by national headquarters located in another state. Which action would most improve your chances of success with these materials?\nOptions:\n(B)Localize the news releases for audiences in your geography.\n", "target": "(B)"}
{"input": "Q: In what year did the BBC start broadcasting radio?\nOptions:\n(A)1917\n(B)1922", "target": "(B)"}
{"input": "Q: At which stage in the planning process are the objectives decided on?\nOptions:\n(B)Planning the program\n(D)Evaluation of the program", "target": "(B)"}
{"input": "Q: Within which area of public relations do tactics relate to promotion of the overall organisation?\nOptions:\n(A)Corporate\n(B)Internal communications", "target": "(A)"}
{"input": "Q: According to Esman (1972), which publics are related to the organisation through shared industrial interests?\nOptions:\n(C)Normative\n(D)Diffused", "target": "(C)"}
{"input": "Q: According to Macnamara's (2005) pyramid of evaluation, at which stage are opinion polls most useful?\nOptions:\n(B)Outputs\n(C)Outtakes", "target": "(C)"}
{"input": "Q: According to Macnamara's (2005) pyramid of evaluation, at which stage is media coverage most likely to be measured?\nOptions:\n(B)Outputs\n", "target": "(B)"}
{"input": "Q: Which of these sites offers 'microblogging?\nOptions:\n(C)Wikipedia\n(D)Twitter", "target": "(D)"}
{"input": "Q: Publishing and selling the creative work of others and protecting property rights of one's own creative work is regulated by\nOptions:\n(C)Securities and Exchange Commission\n(D)copyright and trademark law", "target": "(D)"}
{"input": "Q: Which of these should an objective NOT be?\nOptions:\n(A)Broad\n", "target": "(A)"}
{"input": "Q: Which statement is true about an open systems model of public relations in an organization?\nOptions:\n(A)It adapts to changing organizational environments.\n", "target": "(A)"}
{"input": "Q: Which communication model describes the encoding and decoding of messages?\nOptions:\n(A)Shannon and Weaver model\n(B)Osgood and Schramm model", "target": "(B)"}
{"input": "Q: As the single-person public relations staff of a public transit agency, you are tasked with increasing the number of people who ride your buses each month. Your target audiences are lower-income individuals, college students, people with basic educations and people for whom English is a Second Language. When preparing to craft a primary message, what should you do first?\nOptions:\n(B)Consider how riding the bus could similarly affect all of the target audiences.\n(C)Consider which mediums would most effectively reach all of the target audiences.", "target": "(B)"}
{"input": "Q: You seek the counsel of one of your peers who designed and implemented a communication program that resulted in the successful permitting of an automotive recycling center, despite strong opposition from community organizations. You have to design a program to win approval for a similar project proposed by your company. Your peer gives you a brief piece of advice that succinctly describes the foundation of his successful program. What is most likely your peer's advice for a successful communication program?\nOptions:\n(A)Solve their problems\n(C)Expose them to ridicule", "target": "(A)"}
{"input": "Q: The American flag is an example of a\nOptions:\n(A)stereotype\n(C)symbol", "target": "(C)"}
{"input": "Q: Which statement describes an idea from Kantian ethics?\nOptions:\n(A)What is right and what is wrong are predetermined.\n(B)People should be treated as an end, not a means to an end.", "target": "(B)"}
{"input": "Q: The Web was effectively invented by Berners-Lee in which year?\nOptions:\n(A)1980\n(C)1991", "target": "(C)"}
{"input": "Q: Which of these definitions best describes the 'spiral of silence'?\nOptions:\n(A)When victims of abuse remain silent about the abuse\n(C)When people hide their opinions if they are in disagreement with their close peers or family members", "target": "(A)"}
{"input": "Q: According to \"working theory,\" what is the step that occurs between an individual gaining information and changing behavior?\nOptions:\n(A)coorientation\n(B)opinion change", "target": "(B)"}
{"input": "Q: Which fashion house sued for damages to its reputation after being accused of stealing a design?\nOptions:\n(C)Chanel\n", "target": "(C)"}
{"input": "Q: Which common public relations tactic can provide a 'halo effect'?\nOptions:\n(A)Placement on TV or radio\n(D)Sponsorship", "target": "(D)"}
{"input": "Q: Which of these adjectives does NOT describe business writing?\nOptions:\n(A)Formal\n(C)Personal", "target": "(C)"}
{"input": "Q: Within which area of public relations is likely to involve lobbying?\nOptions:\n(C)Public affairs\n", "target": "(C)"}
{"input": "Q: Which of these types of survey question seeks qualitative information?\nOptions:\n(B)Multiple choice\n(C)Open-ended", "target": "(C)"}
{"input": "Q: Which type of writing employs the pyramid structure?\nOptions:\n(A)Media writing\n(D)Promotional writing", "target": "(A)"}
{"input": "Q: ________ advertising campaigns are focused on gathering support for a particular message or cause.\nOptions:\n(C)Idea-oriented\n", "target": "(C)"}
{"input": "Q: You are the community relations director for a public water utility that has been targeted by a group of activists opposed to adding fluoride to drinking water. The activists are waging an intense internet campaign against the practice. Your utility has overwhelming evidence of the health benefits to fluoridated water. The manager of the utility asks you to initiate a blog to get the health message out. What is the most appropriate course of action?\nOptions:\n(C)Write the blog yourself, identifying yourself as an employee of the utility, and quote the scientific opinions of a variety of sources.\n", "target": "(C)"}
{"input": "Q: The goal of ________ advertising is to promote a specific product and service to a target audience.\nOptions:\n(B)product-oriented\n", "target": "(B)"}
{"input": "Q: Which of these phrases refers specifically to a crisis, rather than an issue?\nOptions:\n(C)Can be avoided with constant monitoring and relationship building.\n(D)It happens suddenly.", "target": "(D)"}
{"input": "Q: Which phase of public relations audience research is associated with summative evaluation?\nOptions:\n(B)Impact\n(D)Preparation", "target": "(B)"}
{"input": "Q: Approximately half of all public relations practitioners work in\nOptions:\n(B)business and commercial areas\n(D)public relations firms", "target": "(B)"}
{"input": "Q: Which of the following Internet-related challenges is most significant in the public relations field?\nOptions:\n(B)Finding stable, cost-effective Internet providers\n(D)Staying abreast of changing technology", "target": "(D)"}
{"input": "Q: Early theories of mass communication suggested that audiences were passive recipients of media messages and thus vulnerable to manipulation. Which of the following best describes current thinking?\nOptions:\n(C)Active receivers are not uniformly affected by mass communication messages.\n", "target": "(C)"}
{"input": "Q: What are major reasons why organizations retain outside public relations counsel? \nOptions:\n(A)They offer flexibility of talents and skills.\n(D)They can provide more attention and detail to a project that in-house staff.", "target": "(A)"}
{"input": "Q: What World War I-era organization introduced decentralized publicity \"drives\" as a strategy to mobilize U.S. public opinion to support the war?\nOptions:\n(A)The Creel Committee\n(C)The Council on Public Relations", "target": "(A)"}
{"input": "Q: According to Cutlip (2006), which stage of the communications plan should involve planning of what should be said and why?\nOptions:\n(B)Strategy\n", "target": "(B)"}
{"input": "Q: Which guerrilla marketing technique involves the spreading of a message about a product issue or service through online peer-to peer communication?\nOptions:\n(B)Street activities\n(D)Viral campaigns", "target": "(D)"}
{"input": "Q: Newsletters generally fall in to which writing category?\nOptions:\n(A)Media writing\n(D)Promotional writing", "target": "(D)"}
{"input": "Q: ________ is most common to political campaigns because it focuses on raising the public's awareness about a particular person in hopes they will either support or not support the person.\nOptions:\n(C)Person-oriented advertising\n", "target": "(C)"}
{"input": "Q: During which step of the Chase Jones model of issues management should the strengths and weaknesses of the organisation be reviewed?\nOptions:\n(A)Identification\n(B)Analysis", "target": "(B)"}
{"input": "Q: What is the main purpose of licensing public relations practitioners?\nOptions:\n(C)To preserve the well-being of society\n(D)To achieve better wages for licensed practitioners", "target": "(C)"}
{"input": "Q: Which of these organizations is most effective in engaging with customers online?\nOptions:\n(A)Starbucks\n", "target": "(A)"}
{"input": "Q: Who argued that if an organization did not affect a public then there was no need for a practitioner to consider that public in its communications?\nOptions:\n(C)Amaral and Phillips (2010)\n(D)Grunig and Hunt (1984)", "target": "(D)"}
{"input": "Q: Psychographics refers to\nOptions:\n(A)individual values, lifestyles and characteristics\n(D)all of the above", "target": "(A)"}
{"input": "Q: How many regional newspapers are there in the UK?\nOptions:\n(A)270\n(C)2,800", "target": "(C)"}
{"input": "Q: Approximately what proportion of nonprofit sector practitioners conduct audience research?\nOptions:\n(C)Two thirds\n(D)Almost all", "target": "(C)"}
{"input": "Q: Which statement describes an idea from utilitarianism?\nOptions:\n(C)The greatest good for the greatest number.\n(D)Those better off should give to people who are not as well off.", "target": "(C)"}
{"input": "Q: Which of these ways a business impacts on the world do stakeholders NOT normally look at?\nOptions:\n(B)Impact on local communities\n(D)Financial performance", "target": "(D)"}
{"input": "Q: Which of the following information about publications does the Audit Bureau of Circulation NOT provide?\nOptions:\n(C)Traffic\n(D)Readership", "target": "(D)"}
{"input": "Q: Which author emphasised strategy as achieving competitive advantage for an organization?\nOptions:\n(D)Henry (2006)\n", "target": "(D)"}
{"input": "Q: What two elements do the planning models of Hendrix (2002), Kendall (1999), Merston (1963) and Parkinson and Ekachai (2006) have in common?\nOptions:\n(A)Research and evaluation\n", "target": "(A)"}
{"input": "Q: Why should a successful public relations counselor continually review present and future realities for an organization?\nOptions:\n(B)to interpret trends for management\n(D)to consider the role public relations might play", "target": "(B)"}
{"input": "Q: In public relations, ________ deals with an organization's ability to satisfy and create a positive experience for its consumers.\nOptions:\n(B)consumer relations\n", "target": "(B)"}
{"input": "Q: Which of these qualities is NOT listed as something to consider when choosing an opinion leader for a public relations campaigns?\nOptions:\n(A)Reputation\n(C)Familiarity with subject or issue", "target": "(C)"}
{"input": "Q: A 2008 survey showed that what percentage of the world's largest companies are reporting their corporate responsibility?\nOptions:\n(D)80%\n", "target": "(D)"}
{"input": "Q: Leslie is a disgruntled employee who walks into her place of employment and shoots three people, killing two and critically injuring the other. What is Leslie's behavior an example of?\nOptions:\n(A)workplace violence\n(B)organizational misdeeds", "target": "(A)"}
{"input": "Q: In which era did muckraking journalism led to the widespread introduction of public relations in business?\nOptions:\n(B)Roosevelt Era, 1930 - 1945\n(D)Seedbed Era, 1900 ' 1917", "target": "(D)"}
{"input": "Q: Where was the first British newspaper printed?\nOptions:\n(B)Oxford\n(D)Edinburgh", "target": "(B)"}
{"input": "Q: You are the vice president of public relations for a corporation that produces a well-known brand of food products. In the Albany, New York, market, one of your products has recently been found to have some contamination. While apparently not fatal, it has given a large number of consumers severe stomach cramps and other intestinal problems. The cause has been traced back to your product, which is sold throughout the nation. Your CEO wants to know what you would advise to keep the situation from becoming a public relations disaster. What should you recommend?\nOptions:\n(B)Stop all sales of the product throughout the nation and issue a recall for that product.\n", "target": "(B)"}
{"input": "Q: When an attitude is communicated, what does it become?\nOptions:\n(A)An opinion\n", "target": "(A)"}
{"input": "Q: Which type of measurement is the most effective choice for evaluating a campaign's impact on audience attitudes?\nOptions:\n(D)conducting a pre and post analysis of constituents' opinions\n", "target": "(D)"}
{"input": "Q: In recent research, the 14,000 stories that could be accessed on Google News' front page in a day pertained to how many actual news events?\nOptions:\n(A)18\n(B)24", "target": "(B)"}
{"input": "Q: What is the primary reason that you, as a public relations manager, should insist on prioritizing and scheduling activities?\nOptions:\n(A)to help the department stay focused on its strategic plan\n(C)to ensure that the department's events and public relations activities are not neglected", "target": "(A)"}
{"input": "Q: The ________ phase of the PR model consists of primary and secondary research about a client, identifying the target audiences for the campaign, proposing channels of communication and strategies to be used in the campaign, and constructing goals, objectives, messages, and themes.\nOptions:\n(C)implementation\n(D)planning", "target": "(D)"}
{"input": "Q: Which of the following is NOT one of the four categories of persuasive crisis communication strategies identified by W. Timothy Coombs?\nOptions:\n(B)downplaying\n", "target": "(B)"}
{"input": "Q: Which common public relations tactic involves sending journalists on visits to appropriate locations?\nOptions:\n(A)Media release\n(B)Media tour", "target": "(B)"}
{"input": "Q: When a campaign becomes noticed and unavoidable, it has achieved the ________ stage.\nOptions:\n(A)participation\n(B)penetration", "target": "(B)"}
{"input": "Q: Your client has asked you to develop a public relations campaign to promote a college tuition savings program using new technologies. What is the most appropriate first step?\nOptions:\n(C)Conduct a situation analysis to gain a better understanding of the issue.\n(D)Hold a focus group to determine which messages are most effective for the program.", "target": "(C)"}
{"input": "Q: Which outcome, from the evaluation phase of public relations planning, documents the impact a program had on its stakeholders?\nOptions:\n(A)the quality of the messages and activities\n(B)the number who change attitudes and opinions", "target": "(B)"}
{"input": "Q: According to Esman (1972), which publics help an organization to exist by lending authority or assistance?\nOptions:\n(A)Enabling\n", "target": "(A)"}
{"input": "Q: A ________ campaign occurs when people from two or more opposing sides of an argument have emotional convictions about a decision that has the power to impact their lives.\nOptions:\n(A)public relations\n(B)public issues", "target": "(B)"}