{"input": "Q: If the demand for grapes increases simultaneously with an increase in the supply of grapes, we can say that\nOptions:\n(A)equilibrium quantity rises, but the price change is ambiguous.\n", "target": "(A)"}
{"input": "Q: With the presence of a negative externality, which of the following would internalize (or correct) the externality?\nOptions:\n(B)A government tax.\n", "target": "(B)"}
{"input": "Q: When the price of pears increases, we expect the following:\nOptions:\n(B)Quantity supplied of pears falls.\n(C)Quantity demanded of pears falls.", "target": "(C)"}
{"input": "Q: Land, labor, capital and entrepreneurial talent are often referred to as\nOptions:\n(A)production possibilities.\n(D)scarce economic resources.", "target": "(D)"}
{"input": "Q: Which of the following is an example of an economic rent?\nOptions:\n(A)A superstar basketball player's $50 million earnings.\n(D)A check to a college student from a parent or guardian.", "target": "(A)"}
{"input": "Q: Which of the following is true?\nOptions:\n(A)TC = (AVC + AFC)Q.\n", "target": "(A)"}
{"input": "Q: The backward bending supply curve is characterized by which of the following?\nOptions:\n(A)As wage rates rise, the quantity of labor supplied continues to rise at every wage rate increase.\n(C)The labor-leisure trade-off favors the income effect or more leisure at higher wage rates.", "target": "(C)"}
{"input": "Q: When the production or consumption of a good creates a positive externality, it is deemed a market failure because at the market quantity\nOptions:\n(A)the marginal social benefit exceeds the marginal social cost.\n", "target": "(A)"}
{"input": "Q: Which of the following will shift the supply curve for textbooks to the left?\nOptions:\n(C)An increase in printing costs\n(D)Expectations of future surpluses", "target": "(C)"}
{"input": "Q: If the government wants to establish a socially optimal price for a natural monopoly, it should select the price at which\nOptions:\n(C)the marginal cost curve intersects the demand curve\n", "target": "(C)"}
{"input": "Q: Deadweight loss occurs in\nOptions:\n(D)All of the above.\n", "target": "(D)"}
{"input": "Q: If one person has the only original signed copy of The Wealth of Nations by Adam Smith, which of the following would illustrate this situation?\nOptions:\n(C)An invisible hand.\n(D)A perfectly vertical supply curve.", "target": "(D)"}
{"input": "Q: Suppose a price floor is installed in the market for coffee. One result of this policy would be\nOptions:\n(A)a decrease in the demand for coffee-brewing machines.\n(C)an increase in consumer surplus due to lower coffee prices.", "target": "(A)"}
{"input": "Q: One of the reasons that the government discourages and regulates monopolies is that\nOptions:\n(C)monopoly firms do not engage in significant research and development.\n(D)consumer surplus is lost with higher prices and lower levels of output.", "target": "(D)"}
{"input": "Q: Because people with relatively low incomes spend a larger percentage of their income on food than people with relatively high incomes, a sales tax on food would fall into which category of taxes?\nOptions:\n(C)Regressive\n", "target": "(C)"}
{"input": "Q: Labor, human capital, entrepreneurship, natural resources, and physical capital are all examples of which of the following?\nOptions:\n(C)Factors of production\n", "target": "(C)"}
{"input": "Q: You are told that the income elasticity for DVDs is + 1.5. This means that\nOptions:\n(A)a 10 percent increase in income produces a 15 percent increase in consumption of DVDs. DVDs are a normal luxury good.\n(B)a 10 percent increase in income produces a 15 percent increase in consumption of DVDs. DVDs are an inferior good.", "target": "(A)"}
{"input": "Q: The basis for the answer in number 1 is\nOptions:\n(B)P or wage rate of labor < MRP of labor and with one additional unit of labor WI, > MRP.\n", "target": "(B)"}
{"input": "Q: When a perfectly competitive labor market is in equilibrium,\nOptions:\n(A)everyone who wants to work has the opportunity to do so\n(C)unemployment can reach as high as 10-15 percent", "target": "(A)"}
{"input": "Q: Which of the following is true for a firm operating under perfect competition in the long run?\nOptions:\n(A)The firm will engage in non-price competition.\n(D)The firm will realize zero economic profits.", "target": "(D)"}
{"input": "Q: An effective price ceiling in the market for good X likely results in\nOptions:\n(B)a persistent shortage of good X.\n(C)an increase in the demand for good Y, a substitute for good X.", "target": "(B)"}
{"input": "Q: The sales tax that you pay at the grocery store is commonly labeled a\nOptions:\n(B)regressive tax.\n", "target": "(B)"}
{"input": "Q: If the price of one good (A) increases and the quantity demanded of another good (B) increases, the two goods are\nOptions:\n(A)substitute goods.\n", "target": "(A)"}
{"input": "Q: At a Nash equilibrium,\nOptions:\n(A)the supply curve intersects the demand curve\n(B)neither party has an incentive to deviate from his or her strategy", "target": "(B)"}
{"input": "Q: Which of the following is an implicit cost for the owner of a small store in your hometown?\nOptions:\n(B)The cost of purchasing canned goods from a wholesale food distributor\n(C)The value placed on the owner's skills in an alternative career", "target": "(C)"}
{"input": "Q: Which of the following is a characteristic of monopolistic competition?\nOptions:\n(A)P > MC.\n(D)P =MR.", "target": "(A)"}
{"input": "Q: Which of the following is true of the perfectly competitive firm in the short run?\nOptions:\n(A)The firm earns a normal profit.\n(D)The firm may earn positive, negative, or normal profits.", "target": "(D)"}
{"input": "Q: Which of the following causes the supply curve of paper to shift to the left?\nOptions:\n(C)Improvements in the technology used to produce paper.\n(D)Environmental concerns reduce the yearly amount of timber that can be harvested.", "target": "(D)"}
{"input": "Q: A consequence of a price floor is\nOptions:\n(A)a persistent shortage of the good.\n(C)a persistent surplus of the good.", "target": "(C)"}
{"input": "Q: The law of diminishing marginal utility is most useful for explaining the\nOptions:\n(B)law of demand\n(D)shape of the production possibilities frontier", "target": "(B)"}
{"input": "Q: If a monopsony labor market suddenly were transformed into a perfectly competitive labor market, how would the wage and employment change?\nOptions:\n(A)Both would increase.\n(B)Both would decrease.", "target": "(A)"}
{"input": "Q: If the perfectly competitive price is currently above minimum ATC, we can expect which of the following events in the long run?\nOptions:\n(B)Market equilibrium quantity rises as firms exit the industry.\n(D)Price falls as firms enter the industry.", "target": "(D)"}
{"input": "Q: A price ceiling is characterized by\nOptions:\n(A)a price set below the current (or equilibrium) market price of the good.\n", "target": "(A)"}
{"input": "Q: The market demand curve for labor will shift to the right when\nOptions:\n(A)the number of firms increases\n(D)the labor supply curve shifts to the left", "target": "(A)"}
{"input": "Q: Which of the following represents a measure of a firm's monopoly pricing or market power, i.e., the larger the value of the index, the greater the firm's market pricing power?\nOptions:\n(C)(P-MC)/P\n", "target": "(C)"}
{"input": "Q: You are told that the cross-price elasticity between goods X and Y is +2.0. This means that\nOptions:\n(B)goods X and Y are inferior goods.\n(D)goods X and Y are substitute goods.", "target": "(D)"}
{"input": "Q: Price times quantity measures\nOptions:\n(B)the budget deficit.\n(C)total revenue.", "target": "(C)"}
{"input": "Q: Which of the following is most likely to be true in the long run for a monopoly firm?\nOptions:\n(C)P > MR = MC = ATC\n(D)P > ATC > MR = MC", "target": "(D)"}
{"input": "Q: If, for each additional unit of a variable input, the increases in output become smaller, which of the following correctly identifies the concept?\nOptions:\n(A)Diminishing marginal productivity.\n(B)Diminishing marginal utility.", "target": "(A)"}
{"input": "Q: Which of the following was not a landmark antitrust act?\nOptions:\n(A)The Wagner Act\n(B)The Sherman Act", "target": "(A)"}
{"input": "Q: A small business estimates price elasticity of demand for the product to be 3. To raise total revenue, owners should\nOptions:\n(A)decrease price as demand is elastic.\n", "target": "(A)"}
{"input": "Q: Which of the following is NOT a characteristic of perfectly competitive industry?\nOptions:\n(A)Free entry into the industry.\n(B)Product differentiation.", "target": "(B)"}
{"input": "Q: A rational consumer who is eating Girl Scout cookies stops eating when\nOptions:\n(A)the total benefit equals the total cost of eating cookies.\n(B)the marginal benefit equals the marginal cost of the next cookie.", "target": "(B)"}
{"input": "Q: Which of the following might explain how a price decrease might cause a decrease in quantity demanded and an upward-sloping demand curve?\nOptions:\n(A)The good is inferior and the income effect is stronger than the substitution effect.\n(D)The good is inferior and a luxury.", "target": "(A)"}
{"input": "Q: Which characteristic is likely a part of a monopoly market but not of monopolistic competition?\nOptions:\n(A)Differentiated products\n(B)Patents and copyrights", "target": "(B)"}
{"input": "Q: A competitive firm's demand for labor is determined directly by\nOptions:\n(A)profits\n(D)the marginal (physical) product of labor and the output price", "target": "(D)"}
{"input": "Q: When price elasticity of demand is greater than 1, demand is\nOptions:\n(B)elastic.\n(D)unit elastic.", "target": "(B)"}
{"input": "Q: A tax imposed on a supplier will more likely be passed on to the consumer in the form of price increase if\nOptions:\n(A)price elasticity of demand is highly elastic.\n(B)price elasticity of demand is highly inelastic.", "target": "(B)"}
{"input": "Q: Which of the following correctly illustrates why price (P) equals marginal revenue (MR) under perfect competition, and why price (P) is greater than marginal revenue under monopoly or imperfect competition? I. MR = P = demand on horizontal function for perfect competition. II. P > MR as downward sloping functions for imperfect competition. III. Demand and Price are represented as a vertical function for imperfect competition.\nOptions:\n(A)I, II, and III.\n(B)I and II.", "target": "(B)"}
{"input": "Q: If there is a positive externality associated with the production of a private good, which of the following is an action of government that would most likely move the market to an efficient outcome?\nOptions:\n(B)Subsidize the firm or its customers.\n(D)Appoint a commission.", "target": "(B)"}
{"input": "Q: If a consumer is not required to pay a monetary price for each cookie she consumes, the consumer will stop eating cookies when\nOptions:\n(C)the ratio of marginal utility divided by total utility is equal to one.\n(D)the marginal utility from eating the last cookie is zero.", "target": "(D)"}
{"input": "Q: Which of the following is the best example of a negative externality and the appropriate plan for eliminating it?\nOptions:\n(A)Air pollution from a factory blows downwind and harms children in a small community. Tax the citizens of the community.\n(D)Air pollution from a power plant is blowing downwind and harming the trees in your community. Tax the production of electricity.", "target": "(D)"}
{"input": "Q: When the opportunity for price discrimination arises,\nOptions:\n(A)market segments with relatively elastic demand pay higher prices\n(C)consumer surplus decreases", "target": "(C)"}
{"input": "Q: A negative externality in the market for a good exists when\nOptions:\n(A)the market overallocates resources to the production of this good.\n", "target": "(A)"}
{"input": "Q: If total product of labor is rising at an increasing rate,\nOptions:\n(A)marginal product of labor is rising.\n(D)marginal cost is rising.", "target": "(A)"}
{"input": "Q: A monopoly with a straight, downward-sloping demand curve has a marginal revenue curve that is\nOptions:\n(B)halfway between the demand curve and the vertical axis\n(C)initially downward sloping and then upward sloping", "target": "(B)"}
{"input": "Q: Which of the following conditions is characteristic of oligopoly?\nOptions:\n(A)A rival firm matches price decreases of rivals, but fails to match any price increases of rivals.\n(D)(I)) Rival firms act independently of each other.", "target": "(A)"}
{"input": "Q: Which of the following examples would result in consumers paying for the largest burden of an excise tax placed on a producer?\nOptions:\n(C)If the demand curve is price inelastic and the supply curve is price elastic\n(D)If the demand curve is perfectly inelastic and the supply curve is price elastic", "target": "(D)"}
{"input": "Q: The demand curve for labor is derived from\nOptions:\n(B)the demand curve for the output produced by labor\n(C)the labor supply curve for the firm", "target": "(B)"}
{"input": "Q: Firms with the following market structure(s) maximize profits by producing where marginal cost equals marginal revenue, if at all. I. Perfect competition II. Oligopoly III. Monopoly IV. Monopolistic competition\nOptions:\n(C)I and III only\n(D)I, II, III, and IV", "target": "(D)"}
{"input": "Q: Production possibilities frontiers are concave to the origin because\nOptions:\n(B)of opportunity cost.\n(C)of the law of increasing costs.", "target": "(C)"}
{"input": "Q: In the same period there is a drought affecting the supply of pineapples and a discovery that may assist in the avoidance of cancer. How will this combination of events affect the equilibrium price and quantity of pineapples?Equilibrium Quantity\nOptions:\n(B)Increases         Indeterminate\n(D)Decreases         Indeterminate", "target": "(B)"}
{"input": "Q: Relatively free or easy entry (low or nonexistent barriers to entry) is best matched by which of the following?\nOptions:\n(A)More consumer choices, greater price elasticity of demand, more competitors.\n(B)More consumer choices, lower price elasticity of demand, more competitors.", "target": "(A)"}
{"input": "Q: When a monopolist has maximized profit,\nOptions:\n(A)price is set equal to marginal cost, creating zero economic profit.\n(C)price is set above marginal cost, creating allocative inefficiency.", "target": "(C)"}
{"input": "Q: If the government regulates a monopoly to produce at the allocative efficient quantity, which of the following would be true?\nOptions:\n(C)The monopoly would make an economic profit.\n(D)The deadweight loss in this market would decrease.", "target": "(D)"}
{"input": "Q: Which of the following is not the basis for a wage differential?\nOptions:\n(A)Higher risk job.\n(C)Increase in production of SUVs.", "target": "(C)"}
{"input": "Q: The relationship between the marginal revenue curve and the demand curve for a monopoly is most similar to the relationship between the marginal factor cost curve and what curve for a monopsony?\nOptions:\n(B)Labor supply\n(D)Total cost", "target": "(B)"}
{"input": "Q: Suppose that there are only two goods: x and y. Which of the following is NOT correct?\nOptions:\n(A)One can have comparative advantage in producing both goods.\n", "target": "(A)"}
{"input": "Q: Which of the following is a fundamental aspect of the free market system?\nOptions:\n(C)Private property.\n", "target": "(C)"}
{"input": "Q: Jason cleans swimming pools in a perfectly competitive local market. A profit maximizer, he can charge $10 per pool to clean 9 pools per day, incurring total variable costs of $80 and total fixed costs of $20. Which of the following is true?\nOptions:\n(D)Jason should clean 9 pools per day, with economic losses of $10.\n", "target": "(D)"}
{"input": "Q: Which of the following goods is likely to provide both the largest total utility and the smallest marginal utility?\nOptions:\n(C)Computers\n(D)Air", "target": "(D)"}
{"input": "Q: In order to find the market supply curve for a particular good, one would\nOptions:\n(C)aggregate the firm marginal cost curves vertically\n(D)aggregate the firm supply curves horizontally", "target": "(D)"}
{"input": "Q: Which of the following is true?\nOptions:\n(D)Marginal social cost = marginal private cost + negative externality.\n", "target": "(D)"}
{"input": "Q: Which of the following is a characteristic of perfect competition?\nOptions:\n(A)Firms produce a homogeneous product.\n(D)The government regulates the price so that deadweight loss is eliminated.", "target": "(A)"}
{"input": "Q: Which of the following is a characteristic of monopoly?\nOptions:\n(A)A single firm in the industry.\n(C)Perfectly elastic demand curve.", "target": "(A)"}
{"input": "Q: The market for denim jeans is in equilibrium, and the price of polyester pants, a substitute good, rises. In the jean market\nOptions:\n(B)supply falls, increasing the price and increasing the quantity.\n(D)demand rises, increasing the price and increasing the quantity.", "target": "(D)"}
{"input": "Q: Scarcity is best defined as\nOptions:\n(A)the difference between limited wants and limited economic resources.\n(C)the difference between unlimited wants and limited economic resources.", "target": "(C)"}
{"input": "Q: The market for Cincinnati Reds baseball tickets is currently in equilibrium. Which of the following events would most likely increase the consumer surplus received by Reds fans?\nOptions:\n(A)The Reds offer discounted parking for all home games.\n", "target": "(A)"}
{"input": "Q: Which of the following is true in the long run in perfect competition?\nOptions:\n(A)P = MR = MC = ATC\n(B)P = MR = MC > ATC", "target": "(A)"}
{"input": "Q: The law of increasing costs is useful in describing\nOptions:\n(A)a demand curve.\n(D)a concave production possibility frontier.", "target": "(D)"}
{"input": "Q: Which of the following is likely to have a demand curve that is the least elastic?\nOptions:\n(A)Demand for the perfectly competitive firm's output\n(D)Demand for the monopoly firm's output", "target": "(D)"}
{"input": "Q: In order for a firm to successfully carry out price discrimination, which of the following conditions must hold? I. The firm cannot face a downward sloping demand curve. II. The firm must have market power. III. Buyers with differing demand elasticities must be separable. IV. The firm must have motives beyond profit maximization. V. The firm must be able to prevent the re-sale of its products.\nOptions:\n(B)III and IV only\n(D)II, III, and V only", "target": "(D)"}
{"input": "Q: Which of the following describes the theory behind the demand curve?\nOptions:\n(A)Decreasing marginal utility as consumption rises.\n(B)Increasing marginal cost as consumption rises.", "target": "(A)"}
{"input": "Q: What is one reason why the government discourages collusion between large firms in the same industry?\nOptions:\n(B)Consumer surplus falls as the price is driven downward.\n(D)Joint profit maximization costs society consumer surplus as the price rises above competitive levels.", "target": "(D)"}
{"input": "Q: Suppose the county government sends each parent a coupon that can be used to subsidize the cost of sending each child to daycare. What would you expect to occur in the market for daycare services?\nOptions:\n(B)The demand for daycare rises, increasing the market price.\n(D)The supply of daycare falls, increasing the market price.", "target": "(B)"}
{"input": "Q: Patents, control of resources, economies of scale, and exclusive licenses are\nOptions:\n(C)all sources of elastic demand\n(D)all barriers to entry", "target": "(D)"}
{"input": "Q: The owner of a competitive firm making zero economic profit\nOptions:\n(A)should consider shutting down because she could make more elsewhere\n(C)is making exactly what she would make in her next best alternative job", "target": "(C)"}
{"input": "Q: A bilateral monopoly exists when\nOptions:\n(A)a monopsony buys from a monopoly\n(C)a monopoly buys from a monopsony", "target": "(A)"}
{"input": "Q: A student eats 3 slices of pizza while studying for his Economics exam. The marginal utility of the first slice of pizza is 10 utils, the second slice is 7 utils, and the third slice is 3 utils. Which of the statements below holds true with the above data?\nOptions:\n(B)The marginal utility of the 4th slice of pizza will be 0.\n(D)The total utility this student received from eating pizza is 20 utils.", "target": "(D)"}
{"input": "Q: The supply curve for lawn-mowing services is likely to slope upward because of\nOptions:\n(B)increasing opportunity cost of time\n", "target": "(B)"}
{"input": "Q: Which of the following is a characteristic of monopolistic competition?\nOptions:\n(C)Excess capacity.\n(D)Very few competitors.", "target": "(C)"}
{"input": "Q: What you give up to pursue another alternative is known as\nOptions:\n(B)land.\n(D)opportunity cost.", "target": "(D)"}
{"input": "Q: The competitive market for gasoline, a normal good, is currently in a state of equilibrium. Which of the following would most likely increase the price of gasoline?\nOptions:\n(B)Technology used to produce gasoline improves.\n(D)The price of crude oil, a raw material for gasoline, rises.", "target": "(D)"}
{"input": "Q: If the government wishes to regulate a natural monopoly so that it produces an allocatively efficient level of output, it would be at an output\nOptions:\n(A)where price is equal to average total cost.\n(D)where price is equal to marginal cost.", "target": "(D)"}
{"input": "Q: Opportunity costs or implicit costs of a \"Mom & Pop\"-owned business are:\nOptions:\n(C)equal to earnings or profits that could have occurred using resources elsewhere.\n(D)equal to earnings or profits that occurred for Mom & Pop's business.", "target": "(C)"}
{"input": "Q: Your aunt runs a small firm from her home making apple pies. She hires some friends to help her. Which of the following situations would most likely increase her demand for labor?\nOptions:\n(B)Your aunt’s friends gossip all day, slowing their dough-making process.\n(C)There is a sale on ovens.", "target": "(C)"}
{"input": "Q: Every time Mr. Hamm makes another pizza in his shop, he places $0.45 worth of sauce on top. For Mr. Hamm, the cost of pizza sauce is a component of which of the following? I. Total Fixed Costs II. Total Variable Costs III. Marginal Cost IV. Total Costs\nOptions:\n(D)II, III, and IV only\n", "target": "(D)"}
{"input": "Q: Which of the following will increase wages for tuba makers?\nOptions:\n(B)An increase in the price of tubas\n", "target": "(B)"}
{"input": "Q: Which of the following statements accurately describes the relationship between average product (AP) and marginal product (MP) of labor?\nOptions:\n(A)AP rises when MP is above it and falls when MP is below it.\n(B)MP intersects AP at the maximum of MP.", "target": "(A)"}
{"input": "Q: What could the government do to most effectively avoid a free rider problem?\nOptions:\n(C)Supply public goods using tax dollars\n", "target": "(C)"}
{"input": "Q: If the per unit price of labor, a variable resource, increases, it causes which of the following?\nOptions:\n(C)A downward shift in ATC.\n(D)An upward shift in MC.", "target": "(D)"}
{"input": "Q: Elsa values her time at $50 per hour, and tutors David for two hours. David is willing to pay $175 for two hours of tutoring, but they negotiate a price of $125 for the entire two hours. Which of the following statements is true about the transaction above:\nOptions:\n(C)Consumer surplus is greater than producer surplus by more than $75.\n(D)The difference between consumer and producer surplus is $25.", "target": "(D)"}
{"input": "Q: Macroeconomics focuses on\nOptions:\n(B)individuals and their resource use.\n(D)the resource use of the entire nation.", "target": "(D)"}
{"input": "Q: In order to hire the least-cost combination of labor and capital, the firm must do which of the following?\nOptions:\n(C)Find the combination of labor and capital where the marginal product of labor divided by the price of labor is equal to the marginal product of capital divided by the price of capital.\n", "target": "(C)"}
{"input": "Q: A monopoly is less efficient than a perfect competitor because\nOptions:\n(A)a monopoly produces more output and sells for a higher price\n(B)a monopoly produces less output and sells for a higher price", "target": "(B)"}
{"input": "Q: With capital fixed at one unit with 1, 2, 3 units of labor added in equal successive units, production of the output increases from 300 (1 unit of labor), to 350 (2 units of labor) to 375 (3 units of labor). Which of the following is a correct interpretation?\nOptions:\n(D)This is short run diminishing marginal productivity.\n", "target": "(D)"}
{"input": "Q: Which of the following statements is correct?\nOptions:\n(B)Economic Costs = Explicit Costs plus Implicit Costs.\n(C)Economic Costs = Explicit Costs minus Implicit Costs.", "target": "(B)"}
{"input": "Q: Which of the following is the best example of a public good?\nOptions:\n(D)The International Space Station\n", "target": "(D)"}
{"input": "Q: Which is true of monopolistic competition?\nOptions:\n(B)P = MR = MC = ATC.\n(C)Firms spend money to differentiate and advertise their products.", "target": "(C)"}
{"input": "Q: Suppose the price of beef rises by 10 percent and the quantity of beef demanded falls by 20 percent. We can conclude that\nOptions:\n(A)demand for beef is price elastic and consumer spending on beef is falling.\n", "target": "(A)"}
{"input": "Q: Which of the following illustrates the demand curve facing an oligopolist when rival firms follow a price decrease but not a price increase?\nOptions:\n(A)Perfectly horizontal demand curve.\n(D)A demand curve consisting of two discontinuous segments.", "target": "(D)"}
{"input": "Q: A positive sign on cross price elasticity of demand indicates that the two products are\nOptions:\n(B)necessities.\n(C)substitutes.", "target": "(C)"}
{"input": "Q: A production possibility frontier will be a straight line when\nOptions:\n(D)resources are not specialized\n", "target": "(D)"}
{"input": "Q: Monopoly deadweight loss is the result of\nOptions:\n(A)setting the price above marginal cost.\n(C)monopoly output being greater than the competitive output.", "target": "(A)"}
{"input": "Q: Which of the following situations best exemplifies the concept of consumer surplus?\nOptions:\n(D)A consumer pays less for a pizza than she thought it was worth at the margin of the purchase.\n", "target": "(D)"}
{"input": "Q: Which of the following is true of equilibrium in a purely (or perfectly) competitive market for good X?\nOptions:\n(B)The quantity demanded equals the quantity supplied of good X.\n(D)The government regulates the quantity of good X produced at the market price.", "target": "(B)"}
{"input": "Q: If the price of a product decreases with the price of a substitute product remaining constant such that the consumer buys more of this product, this is called the\nOptions:\n(A)income effect.\n(B)substitution effect.", "target": "(B)"}
{"input": "Q: Unlike a perfectly competitive firm, a monopoly\nOptions:\n(B)has a horizontal marginal revenue curve\n(D)faces a downward sloping demand curve", "target": "(D)"}
{"input": "Q: If consumers are advised that multigrained bread will substantially lessen the risk of cancer, which of the following will happen in the market for multigrained bread?\nOptions:\n(A)The demand curve will shift to the left, decreasing the price of multigrained bread.\n(C)The demand curve will shift to the right, increasing the price of multigrained bread.", "target": "(C)"}
{"input": "Q: Which of the following is an example of a transfer earning?\nOptions:\n(A)A superstar basketball player's $40 million earnings.\n(D)A cashier at a restaurant receiving the same $8 an hour that other cashiers receive.", "target": "(D)"}
{"input": "Q: Every day Melanie spends her lunch money consuming apples, at $1 each, and oranges, at $2 each. At her current level of consumption, Melanie's marginal utility of apples is 12 and her marginal utility of oranges is 18. If she has already spent all of her lunch money, how should Melanie change her consumption decision to maximize utility?\nOptions:\n(B)She should increase her apple consumption and decrease her orange consumption until the marginal utility per dollar is equal for both.\n(C)She should decrease her apple consumption and increase her orange consumption until the marginal utility per dollar is equal for both.", "target": "(B)"}
{"input": "Q: Which of the following statements is true for a firm in a perfectly competitive industry?\nOptions:\n(B)Marginal revenue is decreasing.\n(D)Average revenue equals marginal revenue.", "target": "(D)"}
{"input": "Q: Consider a profit-maximizing firm in a perfectly competitive market with several sellers and several buyers (i.e., the firm is a \"price taker\" of the goods it sells and a \"price taker\" of the hourly wages it pays its workers). If a technological innovation made by someone in this firm were to significantly raise the firm's marginal physical product (but not that of any other firm's), then this innovation would\nOptions:\n(C)lead the firm to hire more workers but not to raise their wages\n(D)lead the firm to hire more workers and to pay them higher wages", "target": "(C)"}
{"input": "Q: The greater (higher) the wage elasticity of demand, the\nOptions:\n(A)greater the proportion of capital costs to labor costs in the production of goods.\n(B)greater the price elasticity for the product produced by labor.", "target": "(B)"}
{"input": "Q: The United States is trading salmon to Peru in exchange for anchovies. If these nations are trading based upon relative opportunity costs, what must be the case?\nOptions:\n(B)The United States has comparative advantage in salmon production, and Peru has comparative advantage in anchovy production.\n", "target": "(B)"}
{"input": "Q: A competitive labor market is currently in equilibrium. Which of the following most likely increases the market wage?\nOptions:\n(B)Demand for the good produced by this labor is stronger.\n(D)The Department of Labor removes the need for workers to pass an exam before they can work in this field.", "target": "(B)"}
{"input": "Q: The ability for firms to enter and exit a market over time means that\nOptions:\n(B)the marginal revenue is zero\n(C)the long run supply curve is more elastic", "target": "(C)"}
{"input": "Q: The price of labor is $2, and the price of capital is $1. The marginal product of labor is 200, and the marginal product of capital is 50. What should the firm do?\nOptions:\n(C)Decrease capital and increase labor so that the marginal product of capital rises and the marginal product of labor falls.\n", "target": "(C)"}
{"input": "Q: Which of the following is NOT a source of wage differentials?\nOptions:\n(C)Immobility of workers.\n(D)Decrease in the birth rate.", "target": "(D)"}
{"input": "Q: The Law of Diminishing Marginal Returns is responsible for\nOptions:\n(D)MC that first falls, but eventually rises, as output increases.\n", "target": "(D)"}
{"input": "Q: If the government subsidizes the production of halogen headlights,\nOptions:\n(A)the demand curve will shift to the left.\n(D)the supply curve will shift to the right.", "target": "(D)"}
{"input": "Q: Which of the following is true about the relationship of the average total cost (ATC) curve and the marginal cost (MC) curve?\nOptions:\n(B)ATC and MC are never equal.\n(D)The MC curve intersects the ATC curve at the minimum point of the ATC curve.", "target": "(D)"}
{"input": "Q: After Julia received a raise in her income, she began purchasing more ice cream cones and fewer popsicles. For Julia, popsicles\nOptions:\n(A)disobey the law of demand\n(D)are an inferior good", "target": "(D)"}
{"input": "Q: Economists use the term \"capital\" to mean\nOptions:\n(B)plant and equipment.\n", "target": "(B)"}
{"input": "Q: Which of the following goods is likely to have the most elastic demand curve?\nOptions:\n(A)Demand for white Ford minivans\n", "target": "(A)"}
{"input": "Q: A perfectly competitive employer hires labor up to the point where\nOptions:\n(D)Wage = Marginal revenue product of labor.\n", "target": "(D)"}
{"input": "Q: Which of the following are associated with public goods? I. Free riders II. Adding demand curves vertically to find the demand curve for society III. Nonrivalry in consumption IV. Nonexcludability\nOptions:\n(B)I and IV only\n(D)I, II, III, and IV", "target": "(D)"}
{"input": "Q: The long-run average cost curve\nOptions:\n(A)is always below the short-run average cost curve\n(D)is below the short-run average cost except at one point", "target": "(D)"}
{"input": "Q: If the market price is above the perfectly competitive firm's average total cost curve, we expect that in the long run,\nOptions:\n(C)the industry contracts as firms enter the market.\n(D)the industry expands as firms enter the market.", "target": "(D)"}
{"input": "Q: A price discriminating monopoly differs from a non-discriminating monopoly because a discriminating monopoly\nOptions:\n(A)has a demand curve that is more elastic than a non-discriminating monopoly\n(C)earns more revenue than a non-discriminating monopoly", "target": "(C)"}
{"input": "Q: The law of increasing costs\nOptions:\n(B)is the result of resources not being perfectly adaptable between the production of two goods.\n(D)causes the production possibilities frontier to be a straight line.", "target": "(B)"}
{"input": "Q: Which of the following statements is most consistent with a capitalist market economy?\nOptions:\n(A)Economic resources are allocated according to the decisions of the central bank.\n", "target": "(A)"}
{"input": "Q: In the short run, a firm employs labor and capital to produce gadgets. If the annual price of capital increases, what will happen to the short-run cost curves?\nOptions:\n(B)The average fixed cost and average total cost curves will shift upward.\n(C)The marginal cost and average fixed cost curves will shift upward.", "target": "(B)"}
{"input": "Q: Suppose the market for roses is currently in equilibrium. If the supply of roses falls, while at the same time the demand for roses rises, what can you say about the price and quantity of roses in the market?\nOptions:\n(B)Price rises, but the change in quantity is ambiguous.\n(D)Quantity rises, but the change in price is ambiguous.", "target": "(B)"}
{"input": "Q: According to the principle of diminishing marginal utility,\nOptions:\n(C)marginal utility decreases with each additional unit of a good that is consumed.\n(D)marginal utility and total utility both decrease.", "target": "(C)"}
{"input": "Q: Which of these situations is not an example of price discrimination?\nOptions:\n(A)Brent works nights, so he chooses to buy bread at 7 a.m. rather than at 7 p.m.\n(C)Katie buys 12 Cokes for $3, and Josh buys one Coke at a time for $1.", "target": "(A)"}
{"input": "Q: Which of the following is not correct for the perfectly competitive firm, in the long run?\nOptions:\n(A)price = minimum average cost.\n(C)price = minimum average variable cost.", "target": "(C)"}
{"input": "Q: Which of the following statements about a price ceiling is accurate?\nOptions:\n(A)An effective price ceiling must be at a price below the equilibrium price.\n(D)A price ceiling will have no effect on the quantity of the good supplied.", "target": "(A)"}
{"input": "Q: When a good is taxed, the tax burden falls mainly on the consumer if\nOptions:\n(B)the demand is inelastic and the supply is elastic\n(C)the demand is elastic and the supply is inelastic", "target": "(B)"}
{"input": "Q: Marginal cost always intersects average variable cost at\nOptions:\n(A)the profit-maximizing quantity\n(D)the minimum of average variable cost", "target": "(D)"}
{"input": "Q: The price elasticity of demand for a product is greater if\nOptions:\n(A)the proportion of the good of the consumer's budget is high.\n", "target": "(A)"}
{"input": "Q: A competitive market for coffee, a normal good, is currently in equilibrium. Which of the following would most likely result in an increase in the demand for coffee?\nOptions:\n(B)The price of tea rises.\n(C)The wage of coffee plantation workers falls.", "target": "(B)"}
{"input": "Q: Compared to perfect competition in the long run, monopoly has\nOptions:\n(C)lower prices.\n(D)price greater than marginal revenue.", "target": "(D)"}
{"input": "Q: If a business wants to increase its revenue and it knows that the demand price elasticity of its product is equal to 0.78, it should\nOptions:\n(B)decrease price because demand is unit elastic\n(D)increase price because demand is inelastic", "target": "(D)"}
{"input": "Q: Which of the following is most likely to decrease the demand for kindergarten teachers?\nOptions:\n(C)A decrease in the average number of children per household\n", "target": "(C)"}
{"input": "Q: Which of the following is a characteristic of monopolistic competition in the long run?\nOptions:\n(C)Zero economic profits.\n(D)Minimum average total cost equals price.", "target": "(C)"}
{"input": "Q: A typical characteristic of capitalist market economies is\nOptions:\n(D)private ownership of economic resources.\n", "target": "(D)"}
{"input": "Q: For a competitive firm, what is the most important thing to consider in deciding whether to shut down in the short run?\nOptions:\n(A)Compare AVC to MR.\n(B)Compare TR to TC.", "target": "(A)"}
{"input": "Q: The downward-sloping demand curve is partially explained by which of the following?\nOptions:\n(A)Substitution effects and income effects\n(D)The law of diminishing marginal returns to production", "target": "(A)"}
{"input": "Q: Marginal revenue equals marginal cost at the point where\nOptions:\n(A)total revenue is greater than total cost at its greatest distance\n(C)marginal product is at its highest point", "target": "(A)"}
{"input": "Q: In the absence of intervention, imperfect competition, externalities, public goods, and imperfect information all result in which of the following?\nOptions:\n(A)Demand curves that should be added vertically\n(B)Market failure", "target": "(B)"}
{"input": "Q: An industry described as an oligopoly would most likely have\nOptions:\n(C)significant barriers to entry.\n", "target": "(C)"}
{"input": "Q: Which of the following is the best example of the free-rider effect?\nOptions:\n(B)In exchange for tutoring your friend in economics, she helps you with your geometry assignment.\n(C)You have ordered a big college football game on pay-per-view, and several of your buddies show up unannounced to watch it at your place.", "target": "(C)"}
{"input": "Q: In an oligopoly market, firms\nOptions:\n(B)are interdependent\n(D)are large in number", "target": "(B)"}
{"input": "Q: When a negative externality exists as the result of the production of a good, the socially optimal quantity of output could be achieved by\nOptions:\n(B)placing limits on the quantity that can be produced\n", "target": "(B)"}
{"input": "Q: Which of the following is true about a price ceiling?\nOptions:\n(D)It will be located below the equilibrium price.\n", "target": "(D)"}
{"input": "Q: Which of the following would best complete a short definition of economics? \"Economics is the study of . . .\"\nOptions:\n(A)how unlimited resources are allocated between scarce wants.\n(D)how scarce resources are allocated to satisfy unlimited wants.", "target": "(D)"}
{"input": "Q: Which of the following is not a characteristic of a kinked demand curve?\nOptions:\n(B)P < MC.\n(D)Pricing at the kink.", "target": "(B)"}
{"input": "Q: Which of the following could have caused an increase in the demand for ice cream cones?\nOptions:\n(B)A decrease in the price of ice cream, a complimentary good to ice cream cones\n(C)An increase in the price of ice cream, a complimentary good to ice cream cones", "target": "(B)"}
{"input": "Q: Land refers to\nOptions:\n(A)all productive resources.\n(B)all natural resources.", "target": "(B)"}
{"input": "Q: The total utility from sardines is maximized when they are purchased until\nOptions:\n(A)marginal utility is zero\n", "target": "(A)"}
{"input": "Q: The apple market is in equilibrium. Suppose we observe that apple growers are using more pesticides to increase apple production. At the same time, we hear that the price of pears, a substitute for apples, is rising. Which of the following is a reasonable prediction for the new price and quantity of apples?\nOptions:\n(A)Price rises, but quantity is ambiguous.\n(C)Price is ambiguous, but quantity rises.", "target": "(C)"}
{"input": "Q: Suppose that aluminum is a key production input in the production of bicycles. If the price of aluminum falls, and all other variables are held constant, we expect\nOptions:\n(B)the supply of bicycles to rise.\n(C)the supply of bicycles to fall.", "target": "(B)"}
{"input": "Q: The necessity for a monopoly to lower its price in order to sell more units of its product explains why\nOptions:\n(B)the marginal revenue curve is below the demand curve for a monopoly\n(D)monopolies are able to maintain market power", "target": "(B)"}
{"input": "Q: Which of the following is the best example of a public good?\nOptions:\n(B)The volunteer fire department in your community\n(D)A bag of potato chips", "target": "(B)"}
{"input": "Q: Economics is a social science that\nOptions:\n(B)is primarily concerned with how resources are used.\n", "target": "(B)"}
{"input": "Q: Which of the following is true?\nOptions:\n(A)Marginal Social Costs = Private Marginal Costs + Negative Externality.\n(D)Tax = Positive Externality.", "target": "(A)"}
{"input": "Q: Education makes Chris a better worker, voter, parent, and citizen. Because the benefits from education go beyond those that Chris enjoys himself, education provides\nOptions:\n(A)increasing marginal utility and should be subsidized\n(D)externalities and should be subsidized", "target": "(D)"}
{"input": "Q: Which of the following is true about the pure public good?\nOptions:\n(A)The marginal cost of providing an additional unit of the good to additional citizens is greater than zero.\n(D)The good cannot be divided into discrete units.", "target": "(D)"}
{"input": "Q: Marginal cost (MC) is equal to average variable cost (AVC) and average total cost (ATC) when:\nOptions:\n(C)MC intersects AVC and ATC at their minimum points.\n", "target": "(C)"}
{"input": "Q: The Lorenz Curve is used to measure which of the following:\nOptions:\n(C)The ratio of income inequality to income equality in different countries.\n", "target": "(C)"}
{"input": "Q: Which of the following is correct?\nOptions:\n(A)In the long run, all inputs are variable.\n(C)In the long run, supply is not able to adjust fully to changes in demand.", "target": "(A)"}
{"input": "Q: Which of the following is true?\nOptions:\n(C)Average total cost = average variable cost plus marginal cost.\n(D)Average total cost = average variable cost plus average fixed cost.", "target": "(D)"}
{"input": "Q: When a firm is earning a normal profit from the production of a good, it is true that\nOptions:\n(D)total revenues from production are equal to the sum of explicit and implicit costs.\n", "target": "(D)"}
{"input": "Q: Which of the following statements is positive?\nOptions:\n(C)The production possibilities frontier is concave to the origin because of the law of increasing costs.\n(D)Nations ought to devote at least some of their resources to national defense.", "target": "(C)"}
{"input": "Q: If the price of firm A's cell phone service rises by 5 percent and the quantity demanded for firm B's cell phone service increases by 10 percent, we can say that\nOptions:\n(B)supply for firm B is price elastic.\n(C)firms A and B are substitutes because the cross-price elasticity is greater than zero.", "target": "(C)"}
{"input": "Q: Ray and Dorothy can both cook and can both pull weeds in the garden on a Saturday afternoon. For every hour of cooking, Ray can pull 50 weeds and Dorothy can pull 100 weeds. Based on this information,\nOptions:\n(B)Dorothy pulls weeds, since she has absolute advantage in cooking.\n(D)Ray cooks, since he has comparative advantage in cooking.", "target": "(D)"}
{"input": "Q: Which of the following indicates that two goods are complements?\nOptions:\n(B)A horizontal demand curve\n(C)A negative cross-price elasticity", "target": "(C)"}
{"input": "Q: With the presence of a positive externality, which of the following would correct the externality?\nOptions:\n(A)A government subsidy.\n(B)A government tax.", "target": "(A)"}
{"input": "Q: When the cross-price elasticity of demand is negative, the goods in question are necessarily\nOptions:\n(A)normal\n(C)complements", "target": "(C)"}
{"input": "Q: At the birthday party of your best friend, you see Skylar help himself to a second piece of cake. For this individual, it must be the case that\nOptions:\n(B)the total benefit received from eating cake is falling.\n(D)the marginal benefit of the second piece of cake is greater than the marginal cost.", "target": "(D)"}
{"input": "Q: Which of the following is not correct about economies of scale?\nOptions:\n(B)Economies of scale are associated with the rising or increasing portion of an average total cost (ATC) curve.\n(C)Economies of scale are associated with the declining or decreasing portions of the ATC curve.", "target": "(B)"}
{"input": "Q: In the design of a competitive market system, which of the following does NOT describe how resources are allocated?\nOptions:\n(B)Active government ownership and direction of production.\n(C)Voluntary market exchange between buyers and sellers.", "target": "(B)"}
{"input": "Q: A minimum wage in the market for fast-food workers is likely to produce\nOptions:\n(D)a surplus of fast-food workers.\n", "target": "(D)"}
{"input": "Q: Relative to a competitive input market, a monopsony\nOptions:\n(C)pays more and hires more\n(D)pays less and hires fewer", "target": "(D)"}
{"input": "Q: A monopsonist is identified by one of the following:\nOptions:\n(A)A wage payment lower than the marginal revenue product of labor.\n(D)A single seller of labor services.", "target": "(A)"}
{"input": "Q: The demand curve for a perfectly competitive firm's product is\nOptions:\n(B)perfectly elastic.\n(D)kinked at the going market price.", "target": "(B)"}
{"input": "Q: If a market is organized by a cartel, we can expect\nOptions:\n(B)an incentive for cartel firms to cheat on the cartel agreement.\n", "target": "(B)"}
{"input": "Q: Normal goods always have a/an\nOptions:\n(A)elastic demand curve\n(D)positive income elasticity", "target": "(D)"}
{"input": "Q: Which of the following tax systems is designed to redistribute income from the wealthy to the poor?\nOptions:\n(A)A progressive tax system\n(D)An excise tax system", "target": "(A)"}