{"input": "Q: What is the phenotype of a congenital disorder impairing the secretion of leptin?\n\nOptions:\n(C)Obesity, abnormal growth, hypothyroidism, hyperinsulinaemia\n(D)Underweight, abnormal growth, hypothyroidism, hyperinsulinaemia", "target": "(C)"}
{"input": "Q: Calculate the body mass index (BMI) for a patient whose height is 1.75 m and whose weight is 99 kg.\n\nOptions:\n(B)32\n(D)43", "target": "(B)"}
{"input": "Q: After consumption of a mixed meal, a complex cascade of events takes place that integrates fat metabolism at the whole body level. Which of the following is correct?\n\nOptions:\n(A)Consumption of a meal leads to suppression of lipase activity within adipose tissue leading to a decrease in plasma NEFA concentrations\n(D)All options given are correct", "target": "(D)"}
{"input": "Q: How is iron transported in the circulation from the intestine to the sites of metabolism in the body?\n\nOptions:\n(C)Bound to ferritin\n(D)Bound to transferrin", "target": "(D)"}
{"input": "Q: Which of the following is not a beneficial effect of exercise in people with diabetes:\n\nOptions:\n(B)Hypoglycaemia\n(C)increase of insulin sensitivity", "target": "(B)"}
{"input": "Q: The best evidence exists for which nutrients in the prevention of age related cognitive decline?\n\nOptions:\n(A)N-3 fatty acids\n(C)N-6 fatty acids", "target": "(A)"}
{"input": "Q: Molecules of natural polyunsaturated fatty acids in vegetable oils contain:\n\nOptions:\n(B)20 carbon atoms with at least two carbon-carbon double bonds in the cis configuration\n(D)18 carbon atoms with at least two carbon-carbon double bonds in the cis configuration", "target": "(D)"}
{"input": "Q: Which of the following could lead to iodine deficiency?\n\nOptions:\n(B)Intake only of locally grown food in central Africa\n", "target": "(B)"}
{"input": "Q: Which of the following statements about exposures is true?\n\nOptions:\n(A)'Exposure' refers to contact with some factor that may be harmful or beneficial to health.\n(D)High body mass index is a risk factor for a range of health conditions, therefore, it cannot be treated as a single exposure.", "target": "(A)"}
{"input": "Q: In human DNA, which nucleotide base is methylated at the 5' position?\n\nOptions:\n(A)Adenosine\n(C)Cytosine", "target": "(C)"}
{"input": "Q: What characteristic is not representative of a type IIb muscle fibre?\n\nOptions:\n(B)High fatigue resistance\n(C)High motor unit strength", "target": "(B)"}
{"input": "Q: Occasionally infants are born without a normally functioning immune system. What are the signs most suggestive of a severe combined immunodeficiency?\n\nOptions:\n(C)Generalised spread of the Tuberculosis strain BCG after vaccination\n(D)All of the options given are correct", "target": "(D)"}
{"input": "Q: Severe acute malnutrition in young children is defined as:\n\nOptions:\n(B)Height-for-age Z score <-3 and oedema\n(C)Height-for-age Z score <-3 or weight-for-height Z score <-3 or oedema", "target": "(C)"}
{"input": "Q: Which of the following has not at one point in the past few decades been considered as a cause of the oedema of kwashiorkor?\n\nOptions:\n(A)Altered composition of intestinal bacteria\n(D)Iron deficiency", "target": "(D)"}
{"input": "Q: Alcohol is a major risk factor for cancer development. Which alcohol metabolite plays a prominent role in cancer development?\n\nOptions:\n(C)acetaldehyde\n", "target": "(C)"}
{"input": "Q: A food additive is considered to be safe when:\n\nOptions:\n(B)Estimated Daily Intake (EDI) from its presence in food is less than its ADI\n(C)Its toxic effects are observed only at doses 100x the EDI", "target": "(B)"}
{"input": "Q: Which of the following is true about the diagnosis of \"osteopenia\" or \"osteoporosis\" in North America and Western Europe\n\nOptions:\n(A)Women over age 80 with osteopenia have above average bone mineral density for their age\n(C)Fewer than 50% of women over age 80 have osteopenia or osteoporosis", "target": "(A)"}
{"input": "Q: Which of the following statements concerning transamination is correct?\n\nOptions:\n(B)Transamination is an irreversible reaction in amino acid catabolism.\n(D)Transaminases require a coenzyme derived from vitamin B6.", "target": "(D)"}
{"input": "Q: Which of the following statements about glucose metabolism is correct?\n\nOptions:\n(A)Glucagon increases the rate of glycolysis\n(C)In glycolysis, glucose is cleaved into two three-carbon products", "target": "(C)"}
{"input": "Q: Are GM foods a valuable tool with which to address global food security and climate change?\n\nOptions:\n(B)Yes, because they can provide us with a more abundant and economical food supply for the world as well as continued improvement in nutritional quality\n(D)No, because GM foods cannot adapt to the rate of climate change", "target": "(B)"}
{"input": "Q: Although theoretically any food protein could act as a food allergen, there are eight major food allergens in Europe and North America which account for most of the allergic triggers observed in childhood. Which of the allergens pairings contains an allergen, which is not part of the group of eight major allergens?\n\nOptions:\n(B)Mustard seeds, lamb,\n(C)Soy, peanuts", "target": "(B)"}
{"input": "Q: What type of diet is recommended for weight maintenance?\n\nOptions:\n(B)High protein and high GI\n(D)High protein and low GI", "target": "(D)"}
{"input": "Q: The body mass index (BMI) of vegetarians differs on average from meat-eaters by how much?\n\nOptions:\n(C)1 unit of BMI\n", "target": "(C)"}
{"input": "Q: It is correct to state about the epidemiology of Anorexia Nervosa that:\n\nOptions:\n(C)Males from any socioeconomic background can be affected\n", "target": "(C)"}
{"input": "Q: Which of the following statements is/are true?\nHow can smoking affect breastfeeding?\n\nOptions:\n(B)Alters the composition of breast milk\n(D)all of the options given are correct", "target": "(D)"}
{"input": "Q: From the list of oral microorganisms, which is primarily responsible for the initiation of dental caries?\n\nOptions:\n(A)Mutans streptococci\n(C)Lactobacilli", "target": "(A)"}
{"input": "Q: The colonic microflora can be considered as \"an organ within an organ\". Which of the following statements best describes the functions of the microbiota?\n\nOptions:\n(B)All of the options given are correct\n", "target": "(B)"}
{"input": "Q: Toxicity and dose-response data from animal studies, together with data of which of the following types, are used to evaluate the safety of a food substance?\n\nOptions:\n(C)The daily intake of the substance by humans consuming the food\n(D)The total amount of the substance a person will consume over a lifetime", "target": "(C)"}
{"input": "Q: For certain micronutrients, 'biochemical functional indices' have been developed, to assess the adequacy of one or more biochemical pathways that respond predictably to changes in status of that specific micronutrient. One example is serum methylmalonic acid as a biochemical functional index for vitamin B12 status. What is the primary aim of such biochemical functional index measurements?\n\nOptions:\n(A)To achieve a better estimate of the dietary intake of the micronutrient.\n(D)To provide an additional status estimate that can probe critical tissue adequacy, and hence the risk of consequent clinical disease or physiological malfunction.", "target": "(D)"}
{"input": "Q: Which vitamin is a major lipid-soluble antioxidant in cell membranes?\n\nOptions:\n(A)Vitamin A\n(C)Vitamin E", "target": "(C)"}
{"input": "Q: Which of the following statements about glucose metabolism is correct?\n\nOptions:\n(A)All of the reactions of glycolysis are freely reversible for gluconeogenesis.\n(D)Red blood cells can only metabolise glucose by anaerobic glycolysis and the pentose phosphate pathway.", "target": "(D)"}
{"input": "Q: What do flavonoids (polyphenols), including isoflavones (phytoestrogens), inositol phosphates (phytates), lignans (phytoestrogens), isothiocyanates, indoles, phenols and sulphides and thiols, have in common?\n\nOptions:\n(B)They are all derived from plant foods\n(D)They are all nutrients", "target": "(B)"}
{"input": "Q: Was T.R. Malthus correct in concluding that population growth will outstrip food production growth?\n\nOptions:\n(A)No, technological and institutional innovations have permitted food supplies to more than keep pace with population growth.\n(C)No, but it is only because of the introduction of genetically modified food that supplies have kept pace with population growth.", "target": "(A)"}
{"input": "Q: Intestinal lactase deficiency leads to lactose maldigestion which subsequently can lead to lactose intolerance, i.e. causing clinical symptoms. Infants and children normally express sufficient lactase levels as not to experience clinical symptoms. Overall, adults can be classified as lactase-persisters or lactase non-persisters. What is the approximate percentage of Lactase non-persisters worldwide?\n\nOptions:\n(A)45%-50%\n(B)70%-75 %", "target": "(B)"}
{"input": "Q: The Atherogenic Lipoprotein Phenotype (ALP) is a collection of which lipoprotein abnormalities?\n\nOptions:\n(A)Reduced levels of HDL, a high proportion of small dense LDL and raised triglycerides\n(C)Raised levels of HDL, a high proportion of small dense LDL and raised triglycerides", "target": "(A)"}
{"input": "Q: What is the basic functional unit of skeletal muscle tissue?\n\nOptions:\n(B)the sarcomere\n(C)the myofibril", "target": "(B)"}
{"input": "Q: Which statement about absorption from the gastro-intestinal (GI) tract is most correct?\n\nOptions:\n(A)The absorption of glucose is associated with sodium uptake.\n(C)Galactose and fructose are absorbed by the same transporter at the brush border membrane.", "target": "(A)"}
{"input": "Q: Observational epidemiology studies have produced useful in identifying health effects of many food contaminants, but not for assessing risk, because:\n\nOptions:\n(C)Controlled animal studies provide more reliable information\n(D)Reliable dose-response data are difficult to acquire and often unavailable", "target": "(D)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(B)Starch mainly contains amylose, which is a polymer of glucose with alpha 1,4-linkages\n(D)Starch mainly contains amylose, which is a polymer of glucose with beta 1,4-linkages", "target": "(B)"}
{"input": "Q: Are most developing-country farmers engaged in subsistence or commercial production?\n\nOptions:\n(C)Virtually all small-scale producers are engage in some self-provisioning and market sales.\n", "target": "(C)"}
{"input": "Q: Which of the following are the recommended blood pressure and lipid goals for the prevention of cardiovascular disease in adults with diabetes?\n\nOptions:\n(D)BP < 130/80, Trig <150, LDL < 100\n", "target": "(D)"}
{"input": "Q: The following types of research findings provide strong evidence for an association between diet and skeletal health:\n\nOptions:\n(A)Long-term intervention studies that have a large sample size with fracture as an endpoint\n", "target": "(A)"}
{"input": "Q: Supplementation with long-chain fatty acids EPA and DHA during pregnancy and infancy will likely benefit the following:\n\nOptions:\n(A)Visual performance\n(D)Memory", "target": "(A)"}
{"input": "Q: Which of the following best explains the antioxidant action of vitamin E?\n\nOptions:\n(A)It forms a stable radical that can be reduced back to active vitamin E by reaction with vitamin C\n(B)It is converted to a stable radical by reaction with vitamin C", "target": "(A)"}
{"input": "Q: Which statement about the oral phase of digestion is INCORRECT?\n\nOptions:\n(B)Swallowing involves contraction and relaxation of at least 14 groups of muscles in about 10 seconds in healthy subjects\n(D)Salivary amylase digests the dextran film on tooth enamel formed from dietary sucrose", "target": "(D)"}
{"input": "Q: What is the primary lipoprotein secreted from the liver that is at least partially composed of dietary derived lipids?\n\nOptions:\n(C)VLDL\n(D)LDL", "target": "(C)"}
{"input": "Q: The UNICEF model of the causes of malnutrition identifies several levels of causes: immediate, underlying and basic. Which of the following is not one of the underlying causes in the UNICEF model?\n\nOptions:\n(A)Insufficient rainfall for agriculture\n(D)Insufficient health services and unhealthy environment", "target": "(A)"}
{"input": "Q: What dietary pattern shows most promise in preventing age related cognitive decline\n\nOptions:\n(B)The Mediterranean diet\n(C)Neither", "target": "(B)"}
{"input": "Q: What are the main metabolites of alcohol metabolism?\n\nOptions:\n(A)Acetaldehyde, acetate,\n(D)Acetone, lactate", "target": "(A)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(A)Sulfur dioxide is not used in foods containing thiamin because it causes destruction of the vitamin\n(B)Sulfur dioxide is not used in foods containing niacin because it causes destruction of the vitamin", "target": "(A)"}
{"input": "Q: Which statement best describes the differences between the characteristics of type 1 and type 2 diabetes:\n\nOptions:\n(C)autoimmune factors are involved in the pathogenesis of type 1 but not type 2 diabetes\n(D)persons with type 1 diabetes can increase endogenous insulin production by taking oral hypoglycemic agents", "target": "(C)"}
{"input": "Q: Risk management for chemical contaminants of food generally relies on:\n\nOptions:\n(B)Allowing levels of contamination based on what manufacturers believe is achievable\n(D)Prohibiting the introduction into commerce food containing contaminants at levels greater than a specified level (a risk-based MRL or tolerance)", "target": "(D)"}
{"input": "Q: What is leptin resistance?\n\nOptions:\n(A)Deficiency of leptin caused by a mutation in the leptin gene\n(C)High concentrations of leptin without reduction in energy intake", "target": "(C)"}
{"input": "Q: Which of the following statements about the consequence of an adaptive metabolic demand for the determination of the minimum protein requirement is correct.\n\nOptions:\n(B)The adaptive metabolic demand means that the slope of N-balance studies underestimates the efficiency of protein utilization\n(C)Variable adaptation between different N-balance studies is fully accounted for in the calculation of the safe individual protein requirement as EAR+2SD", "target": "(B)"}
{"input": "Q: Crohn's disease:\n\nOptions:\n(A)Always affects the colon\n(B)May lead to intestinal obstruction", "target": "(B)"}
{"input": "Q: The measurement of a specific biochemical status index for a micronutrient such as vitamin C is most likely to be useful in practice to estimate:\n\nOptions:\n(A)The presence or risk of a clinical deficiency, such as clinical scurvy.\n(C)The tissue levels, or body status, of that nutrient.", "target": "(C)"}
{"input": "Q: Which of the following nutritional interventions has been shown to improve child development?\n\nOptions:\n(C)Both of the interventions\n", "target": "(C)"}
{"input": "Q: Which diseases are not less frequent among vegetarians?\n\nOptions:\n(A)Respiratory diseases\n(D)Diverticular disease", "target": "(A)"}
{"input": "Q: Fibre supplements\n\nOptions:\n(A)May be helpful in diverticular disease\n", "target": "(A)"}
{"input": "Q: Deficiency of vitamin A in children causes:\n\nOptions:\n(B)Poor cognitive development\n(D)Increased risk of mortality", "target": "(D)"}
{"input": "Q: Which of the following contributes to reduced energy expenditure in older adults?\n\nOptions:\n(C)A reduction in basal metabolic rate\n(D)All of the above", "target": "(D)"}
{"input": "Q: Additional dietary protein may:\n\nOptions:\n(B)Decrease calcium excretion in the urine\n(C)Stimulate production of insulin-like growth hormone", "target": "(C)"}
{"input": "Q: It is correct to state that for the treatment of Bulimia Nervosa:\n\nOptions:\n(A)Fluoxetine is considered of benefit\n(D)Treatments should target exclusively on purging practices", "target": "(A)"}
{"input": "Q: Fruit and vegetable consumption\n\nOptions:\n(B)Has an uncertain relationship with skeletal health because research studies are confounded by associated lifestyle factors such as smoking, exercise and alcohol consumption\n", "target": "(B)"}
{"input": "Q: Doses of substances used in animal toxicity studies are usually many times greater than those experienced by people because:\n\nOptions:\n(A)Animals are generally much less sensitive than people\n(B)Such tests can detect only very large risks because of the fact that only small numbers of animals can be used", "target": "(B)"}
{"input": "Q: Which vitamin is required for calcium absorption from the small intestine?\n\nOptions:\n(A)Vitamin A\n(B)Vitamin D", "target": "(B)"}
{"input": "Q: The most direct method for measuring body composition is:\n\nOptions:\n(A)underwater weighing\n", "target": "(A)"}
{"input": "Q: The following amino acids are all essential components of the diet:\n\nOptions:\n(A)leucine, methionine and threonine\n", "target": "(A)"}
{"input": "Q: The intake of which minerals is not affected by high intakes of foods containing phytic acid?\n\nOptions:\n(B)Potassium\n", "target": "(B)"}
{"input": "Q: Adaptive thermogenesis refers to:\n\nOptions:\n(B)A decrease in non-shivering thermogenesis when exposed to cold\n(C)An increase in basal metabolic rate that is not fully explained by a change in body composition during chronic overfeeding", "target": "(C)"}
{"input": "Q: Which of the following vitamins provides the coenzyme for carboxylation reactions?\n\nOptions:\n(A)Biotin\n(D)Thiamin", "target": "(A)"}
{"input": "Q: Which of the following vitamins is involved in one-carbon metabolism?\n\nOptions:\n(A)Folate\n(B)Riboflavin", "target": "(A)"}
{"input": "Q: What nutritional strategies will not improve performance during prolonged endurance type exercise?\n\nOptions:\n(B)Tapering\n(C)The classic glycogen loading regime", "target": "(C)"}
{"input": "Q: Risk assessment is applied to data on toxicity and human exposure to:\n\nOptions:\n(A)Estimate the likelihood, or probability, of a toxic effect on exposed humans\n", "target": "(A)"}
{"input": "Q: Gluten\n\nOptions:\n(A)May increase carbohydrate malabsorption\n(C)Is the main protein in maize", "target": "(A)"}
{"input": "Q: Why might some biochemical (eg plasma or serum) indices of micronutrient status give misleading results in people with infections or inflammatory states?\n\nOptions:\n(A)Because people who are sick often alter their diets, and may eat less food.\n(D)Because an acute phase reaction results in changes in inter-tissue distributions of certain micronutrients.", "target": "(D)"}
{"input": "Q: Which foods tend to be consumed in lower quantities in Wales and Scotland (as of 2020)?\n\nOptions:\n(B)Confectionary\n(C)Fruits and vegetables", "target": "(C)"}
{"input": "Q: On a global scale, trends are suggesting that with rising incomes and urbanization we are seeing a rise in which food commodities?\n\nOptions:\n(C)Beans and lentils\n(D)Meat and Dairy products", "target": "(D)"}
{"input": "Q: Which of these factors increases the risk for lung cancer?\n\nOptions:\n(C)High dose ß-carotene supplements\n", "target": "(C)"}
{"input": "Q: Cholesterol and fatty acids absorbed from the intestinal lumen are packaged into which types of lipoproteins and secreted from the enterocytes into the lymph?\n\nOptions:\n(A)Chylomicrons and HDL\n(D)VLDL and HDL", "target": "(A)"}
{"input": "Q: Which of the following is true about dietary calcium:\n\nOptions:\n(C)There is clear evidence that people who consume more than the average amount of calcium have a lower risk of bone fractures.\n(D)Absorption efficiency is inversely related to calcium intake, so that a higher proportion is absorbed when calcium intake is low", "target": "(D)"}
{"input": "Q: What is the definition of overweight?\n\nOptions:\n(C)BMI 25-29.9 kg/m2\n(D)BMI 25-30 kg/m2", "target": "(C)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(B)Cholesterol mainly occurs in the cell walls of mammalian cells\n(C)Cholesterol mainly occurs in the cell walls of yeast cells", "target": "(B)"}
{"input": "Q: What stable isotope is commonly given for the measurement of total body water?\n\nOptions:\n(A)Deuterium\n", "target": "(A)"}
{"input": "Q: What is food security?\n\nOptions:\n(C)Its component elements include availability, utilisation, and stability, as well as access.\n(D)Food security focuses primarily on ending micronutrient malnutrition.", "target": "(C)"}
{"input": "Q: Which of the following statements is/are true?\nThere is increasing concern about the importance of adequate nutrition in the pre-conception period to support a successful pregnancy. This is because:\n\nOptions:\n(D)all of the options given are correct\n", "target": "(D)"}
{"input": "Q: Which of the following statements about the global ageing population is correct?\n\nOptions:\n(A)It is predicted that by 2040 over 25% of the world's population will be 65yr or older.\n(B)The rate of increase in the median age of populations is greater in developing countries than wealthy countries.", "target": "(B)"}
{"input": "Q: The 'mad cows disease' has had the greatest impact on food choice due to which of the following?\n\nOptions:\n(A)A difference in perception of risk\n(C)Farmers or food producers not trusting the government", "target": "(A)"}
{"input": "Q: On an average daily basis, the gross energy intake of a healthy woman is 9279 kJ, the energy content of her faeces and urine are 647 kJ and 318 kJ, respectively. Her average daily digestible energy intake and metabolisable energy intake would be, respectively,:\n\nOptions:\n(C)9279+318 kJ and 9279+647 kJ\n(D)9279-647 kJ and 9279-(647+318) kJ", "target": "(D)"}
{"input": "Q: The best available evidence for an association between amount of sugars and risk of dental caries comes from which type of study design?\n\nOptions:\n(C)Cross sectional observational\n(D)Cohort", "target": "(D)"}
{"input": "Q: Which statement about intestinal \"brakes\" and \"accelerators\" is FALSE?\n\nOptions:\n(A)Dietary starch is a potent stimulator of small intestinal motility because it causes insulin release from the pancreas\n(D)The arrival of lipid in the duodenum causes an immediate reduction in motility and a switch from the \"fasting\" to the \"feeding\" pattern.", "target": "(A)"}
{"input": "Q: Inviduals suffering from inhalant allergies may also react to cross- reacting food allergens. A person suffering from a natural latex allergy might not react to one of the following allergens\n\nOptions:\n(B)mango\n(D)figs", "target": "(D)"}
{"input": "Q: Assessing growth in routine practice should be:\n\nOptions:\n(C)Weight and height\n(D)Head circumference", "target": "(C)"}
{"input": "Q: It has been observed that a reduction in family size and improved sanitary condition have led to an increase in allergic conditions. The 'hygiene hypothesis' suggests that\n\nOptions:\n(A)The frequent use of antiseptic swipes will reduce allergies\n(B)Living on a working farm will help reducing the development of atopic diseases", "target": "(B)"}
{"input": "Q: Food supplements, including trace minerals and vitamins are frequently advertised with promising health benefits. Which of the following substance could be consumed in excess, i.e. well above the recommended daily requirement?\n\nOptions:\n(A)Vitamin C\n(B)Vitamin D", "target": "(A)"}
{"input": "Q: Which of the following is a function of folate?\n\nOptions:\n(A)Synthesis of TMP (thymidine monophosphate)\n", "target": "(A)"}
{"input": "Q: To characterize a binge eating episode one must investigate the presence of:\n\nOptions:\n(C)A subjective component of lack of control and an objective component of large consumption of food in a discrete period of time\n(D)The feeling that one cannot choose the type of food eaten even if their quantity is kept under control.", "target": "(C)"}
{"input": "Q: Infants born to mothers who are vegan may be at increased risk of deficiency of which nutrient?\n\nOptions:\n(C)Vitamin B12\n", "target": "(C)"}
{"input": "Q: Pregnancy and lactation is known to:\n\nOptions:\n(B)Result in bone mineral loss from the skeleton\n", "target": "(B)"}
{"input": "Q: These factors increase risk of osteoporotic fracture:\n\nOptions:\n(D)Poor muscle strength\n", "target": "(D)"}
{"input": "Q: De novo fatty acid synthesis usually signifies which of the following?\n\nOptions:\n(C)Only occurs with prolonged fasting\n(D)An excess of energy yielding substrates", "target": "(D)"}
{"input": "Q: In relation to Eating Disorders, it is correct that:\n\nOptions:\n(B)AN has the highest mortality across all mental disorders\n(D)Individuals with BN are predominantly impulsive and have comorbid borderline personality disorder", "target": "(B)"}
{"input": "Q: Which of the following statements is/are true? Epigenetic changes may be key to understanding the links between early experience and later health. They may:\n\nOptions:\n(C)enable one genotype to result in different phenotypes\n(D)all of the options given are correct", "target": "(D)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(A)The amount of oxygen available in the headspace of canned food is kept at a high level so as to limit losses of vitamin C\n(D)Losses of vitamin C in canned foods during storage at ambient temperature tend to be small", "target": "(D)"}
{"input": "Q: In a healthy person maintaining energy balance in equilibrium (i.e. mathematical equality of energy intake and energy expenditure) is generally achieved on a:\n\nOptions:\n(D)1-2 week basis\n", "target": "(D)"}
{"input": "Q: Food allergies:\n\nOptions:\n(C)Usually occur only after an individual has been sensitized by prior exposure\n", "target": "(C)"}
{"input": "Q: Which of the following confirmed values meet the diagnostic threshold for diabetes?\n\nOptions:\n(B)random glucose > 160 mg/dl\n(D)fasting blood glucose ≥ 126 mg/dl", "target": "(D)"}
{"input": "Q: Greater milk consumption\n\nOptions:\n(A)Has been reported to be associated with a higher incidence of fracture and higher mortality in a few studies\n(D)In countries with the highest rate of fracture suggests that milk consumption is beneficial to the skeleton.", "target": "(A)"}
{"input": "Q: Which of the following inborn errors of metabolism gives rise to zinc deficiency?\n\nOptions:\n(A)Acrodermatitis enteropathica\n(B)Wilson's disease", "target": "(A)"}
{"input": "Q: The gut microbes metabolize L-carnitine into which metabolite that has been shown increase cardiovascular disease?\n\nOptions:\n(A)choline\n(C)Trimethylamine", "target": "(C)"}
{"input": "Q: Which of the following statements about the protein:energy ratio of the requirement is correct?\n\nOptions:\n(C)Young adults need the most protein dense food\n(D)The elderly need the most protein dense food", "target": "(D)"}
{"input": "Q: Which of the factors below is NOT considered a risk factor for Eating Disorders\n\nOptions:\n(D)Parental anxiety\n", "target": "(D)"}
{"input": "Q: How will climate change affect future food security?\n\nOptions:\n(A)It will have negative impacts in most developing countries because of the increased frequency of droughts, storms and floods.\n(D)There currently is no scientific consensus as to whether climate change is occurring or whether it will over the next 50 years.", "target": "(A)"}
{"input": "Q: What is the primary method of dietary assessment used in epidemiological studies?\n\nOptions:\n(A)Weighed diary\n(D)Food frequency questionnaire", "target": "(D)"}
{"input": "Q: In adolescence:\n\nOptions:\n(C)Girls physiologically increase their percentage body fat\n", "target": "(C)"}
{"input": "Q: Which of the following vitamins provides the cofactor for hydroxylation reactions in collagen synthesis?\n\nOptions:\n(D)Vitamin C\n", "target": "(D)"}
{"input": "Q: What is the best method to estimate changes in body fat during weight loss?\n\nOptions:\n(A)BMI\n(C)Four-compartment model", "target": "(C)"}
{"input": "Q: Which of the following statements about protein synthesis is correct?\n\nOptions:\n(D)The RNA formed by transcription of DNA undergoes splicing and further modifications to form mRNA.\n", "target": "(D)"}
{"input": "Q: Which of the following contributes to vitamin B12 deficiency in older adults?\n\nOptions:\n(C)Helicobacter pylori infection\n(D)All of the above", "target": "(D)"}
{"input": "Q: Which life-style factors do not confound the interpretation of the health of vegetarians compared with meat-eaters?\n\nOptions:\n(D)Age\n", "target": "(D)"}
{"input": "Q: What endogenous substrate source provides the most energy during moderate to high intensity exercise?\n\nOptions:\n(B)Muscle glycogen\n(C)Intramuscular lipid", "target": "(B)"}
{"input": "Q: The pathogenesis of hyperglycemia in type 2 diabetes includes all the following mechanisms except for:\n\nOptions:\n(B)Impaired insulin secretion\n(D)All of the options given are correct", "target": "(D)"}
{"input": "Q: Which of the following statements about methods of evaluating protein quality in human nutrition is correct?\n\nOptions:\n(A)The rat protein efficiency ratio assay, (PER), is a good method of assessing protein quality for human nutrition.\n(C)Animal growth assays underestimate the quality of dietary proteins for human nutrition", "target": "(C)"}
{"input": "Q: Which single statement below, about the stomach, is actually correct?\n\nOptions:\n(C)The vagus nerve inhibits acid secretion after a meal has been consumed\n(D)Pepsinogen and gastric lipase are two enzymes secreted into the lumen of the stomach", "target": "(D)"}
{"input": "Q: The safety of which of the following substances must be demonstrated prior to their introduction into food?\n\nOptions:\n(C)Colour additives\n(D)All of the above", "target": "(D)"}
{"input": "Q: What are focus areas of nutritional epidemiology?\n\nOptions:\n(A)The role of nutritional factors in causing disease in a population.\n(C)Both of the options given are correct.", "target": "(C)"}
{"input": "Q: Which of the following is the yield of ATP from complete oxidation of glucose to carbon dioxide and water?\n\nOptions:\n(A)10\n(D)32", "target": "(D)"}
{"input": "Q: According to the recommendations for the nutritional management of patients with diabetes, the consumption of saturated fat should be:\n\nOptions:\n(A)<10% of total daily energy\n(B)<12%", "target": "(A)"}
{"input": "Q: The two most common causes of foodborne illness in the United States and Europe are:\n\nOptions:\n(A)Salmonella and Campylobacter\n(C)Shigella and Staphlococcus", "target": "(A)"}
{"input": "Q: What are the main enzyme systems for catalysing ethanol to acetaldehyde?\n\nOptions:\n(A)Alcohol dehydrogenase (ADH)\n(C)Alcohol dehydrogenase (ADH), cytochrome P450 2E1 (CYP2EI), catalase", "target": "(C)"}
{"input": "Q: What role do women play in food security?\n\nOptions:\n(B)They play a central role as producers of food, managers of natural resources, income earners and caretakers of household nutrition.\n", "target": "(B)"}
{"input": "Q: The risk factors for type 2 diabetes mellitus include:\n\nOptions:\n(B)being overweight\n(D)All of the options listed are correct", "target": "(D)"}
{"input": "Q: Prenatal programming:\n\nOptions:\n(B)May be effected through the epigenetic effects of intrauterine nutritional inadequacy\n(D)Only affects low birth weight children", "target": "(B)"}
{"input": "Q: Which of the following is not a function of vitamin D?\n\nOptions:\n(A)Lipid-soluble antioxidant in cell membranes\n(C)Regulation of differentiation of adipocytes", "target": "(A)"}
{"input": "Q: In the past two decades, interest in maternal nutrition has been heightened following the findings of epidemiological studies that show links between early experience and later health. Which of the following statements is true:\n\nOptions:\n(B)the observed links between early experience and later health have only been seen in UK studies\n(D)the epidemiological evidence shows programmed differences in physiology are linked to events before birth and in early postnatal life", "target": "(D)"}
{"input": "Q: The pancreas secretes a large amount of digestive enzymes after a meal. Which statement about this process is correct?\n\nOptions:\n(B)Pancreatic á-amylase will hydrolyse starch to free glucose\n(C)Enteropeptidase converts trypsinogen to trypsin by cleavage of a peptide sequence that blocks the active site of trypsin.", "target": "(C)"}
{"input": "Q: Higher dietary sodium (salt) intake is generally associated with:\n\nOptions:\n(A)Decreased calcium excretion in the urine\n(D)Negative calcium balance and bone mineral loss", "target": "(D)"}
{"input": "Q: Insulin deficiency is associated with\n\nOptions:\n(B)Increased ketogenesis\n(C)Reduced gluconeogenesis", "target": "(B)"}
{"input": "Q: Which membrane fatty acids are precursors for eicosanoids?\n\nOptions:\n(C)C20 and C22 monounsaturated fatty acids\n(D)C20 and C22 polyunsaturated fatty acids", "target": "(D)"}
{"input": "Q: The vitamins which are lost most readily during cooking are:\n\nOptions:\n(A)vitamin E and niacin\n(D)vitamin C and thiamin", "target": "(D)"}
{"input": "Q: Basal Metabolic Rate (BMR):\n\nOptions:\n(B)is unaltered in hypothyroidism and hyperthyroidism\n(C)Is higher after weight gain because part of the excess weight is fat-free mass.", "target": "(C)"}
{"input": "Q: Which of the following statements about amino acid scoring for predicting protein quality in human nutrition is correct?\n\nOptions:\n(D)Different amino acid scoring patterns are used for different age groups.\n", "target": "(D)"}
{"input": "Q: What are the main causes of the obesity epidemic?\n\nOptions:\n(A)Increased energy quantity/density and a more sedentary life-style\n", "target": "(A)"}
{"input": "Q: Which of the following statements is true?\nImpaired foetal growth is described as intrauterine growth retardation (IUGR). IUGR has the same definition as:\n\nOptions:\n(B)very low birthweight (VLBW)\n(C)birth weight below a population threshold for gestational age", "target": "(C)"}
{"input": "Q: Colonic microbiome:\n\nOptions:\n(A)Is present in babies in utero\n(D)May be changed with consumption of oligo-saccharides", "target": "(D)"}
{"input": "Q: Which of the following statements about the nutritional status of older people is correct?\n\nOptions:\n(A)The risk of high iron stores is greater than the risk of iron deficiency in older people.\n(B)All older people living in Western countries have low vitamin D status.", "target": "(A)"}
{"input": "Q: How does agricultural research help reduce hunger and poverty?\n\nOptions:\n(C)Research focused on the problems of poor farmers and consumers is a 'public good' with little profit potential but high social benefits; public investment is needed to support it.\n(D)Pro-poor research should only focus on organic farming.", "target": "(C)"}
{"input": "Q: Confounding is a particular challenge in nutritional epidemiology because\n\nOptions:\n(D)different dietary components are correlated with each other, making it difficult to separate their effects.\n", "target": "(D)"}
{"input": "Q: The critical pH below which demineralisation of tooth enamel occurs is usually around:\n\nOptions:\n(B)5.7\n(C)5.5", "target": "(C)"}
{"input": "Q: Eosinophilic oesophagitis\n\nOptions:\n(A)Leads to oesophageal diverticular\n(B)May cause oesopgageal obstruction", "target": "(B)"}
{"input": "Q: According to trials on diabetes prevention, high-risk individuals can reduce their risk to develop diabetes by doing the following:\n\nOptions:\n(A)Eating a very low carbohydrate diet\n(C)Losing 5-7% of body weight through a hypocaloric low fat diet and 30 minutes of daily activity", "target": "(C)"}
{"input": "Q: Bariatric surgery is used for obesity treatment but how much is the incidence of type 2 diabetes reduced in obese individuals after surgery?\n\nOptions:\n(A)80-90%\n(B)No reduction in the incidence", "target": "(A)"}
{"input": "Q: Ulcerative Colitis\n\nOptions:\n(A)Carries a risk of colonic cancer\n(C)Can be caused by small intestinal bacterial overgrowth", "target": "(A)"}
{"input": "Q: Which of the following statements about the diets and nutritional status of older people is correct?\n\nOptions:\n(C)Older people generally have a lower energy intake than younger adults.\n", "target": "(C)"}
{"input": "Q: Endurance type exercise training modulates fuel storage and substrate use. Adaptive responses include:\n\nOptions:\n(D)Increasing intramuscular lipid use during exercise\n", "target": "(D)"}
{"input": "Q: What is the prevalence of alcoholic myopathy in alcoholics\n\nOptions:\n(B)40 to 60%\n(C)20 to 40%", "target": "(B)"}
{"input": "Q: How many kcal are there in one gram of ethanol?\n\nOptions:\n(B)19.7 kJ or 4.1 kcal per g\n(C)29.7 kJ or 7.1 kcal per g", "target": "(C)"}
{"input": "Q: When epidemiologists judge the evidence to establish possible causes of a health outcome, they consider\n\nOptions:\n(A)The estimated strength of the association between an exposure and the outcome.\n(D)All of the options given.", "target": "(D)"}
{"input": "Q: Which of the treatments below has not demonstrated efficacy in BED\n\nOptions:\n(A)Cognitive Behavioural Therapy\n(D)Benzodizepines (Diazepam, Alprazolam)", "target": "(D)"}
{"input": "Q: The Worldwide HIV/AIDS campaigns have made significant progress over the last years. The HIV infection rates in Europe\n\nOptions:\n(B)Have been unchanged\n(C)Have been increasing", "target": "(B)"}
{"input": "Q: What are histones?\n\nOptions:\n(C)Nucleotides\n(D)Proteins", "target": "(D)"}
{"input": "Q: Deficiencies of which of the following nutrients can lead to anaemia?\n\nOptions:\n(B)Copper and iron\n", "target": "(B)"}
{"input": "Q: What difference will urbanisation make for hunger and malnutrition?\n\nOptions:\n(C)Urban dwellers depend more than rural people on purchases to acquire food, have little opportunity to grow their own food, and so are much more vulnerable to food price increases.\n", "target": "(C)"}
{"input": "Q: It is possible to reduce (though not eliminate) information bias in assessment of dietary intake by\n\nOptions:\n(B)collecting data about dietary intake at the onset of a study, before people have experienced symptoms of disease.\n(D)making sure that the study sample is representative of the population.", "target": "(B)"}
{"input": "Q: Which one of the following statements about protein nutrition is correct?\n\nOptions:\n(B)The requirement for dietary protein is for individual amino acids, not simply the total amount of protein in the diet.\n", "target": "(B)"}
{"input": "Q: The daily amount of protein oxidized in the body of a person spending 24 hours in a respiratory chamber can be determined from his/her:\n\nOptions:\n(C)Breath collection\n(D)Total urinary nitrogen excretion alone", "target": "(D)"}
{"input": "Q: What should elite athletes ideally consume during prolonged high intensity exercise (>2.5 hours)?\n\nOptions:\n(B)60 g glucose plus fructose per hour\n(D)90 g glucose plus fructose per hour", "target": "(D)"}
{"input": "Q: Which of the following will provide the main fuel for muscle contraction during short-term intense activity such as sprinting?\n\nOptions:\n(D)Muscle glycogen\n", "target": "(D)"}
{"input": "Q: Infants and children with a suspected food allergy e.g. cow's milk allergy/intolerance could display the following symptoms and signs:\n\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q: Vitamin D deficiency can often be found as a single nutrient deficiency, that is, in an otherwise well-nourished person. The main reason this can happen is because:\n\nOptions:\n(C)Most vitamin D in the body does not come from food so access to food is not an important determinant of vitamin D status.\n(D)Diets containing sufficient other nutrients to promote growth can increase the requirement of vitamin D so that it becomes limiting.", "target": "(C)"}
{"input": "Q: The WHO made a strong recommendation that the maximum intake of free sugars by individuals within populations should be\n\nOptions:\n(C)<10%\n", "target": "(C)"}
{"input": "Q: Which of the following methods is recommended to screen for malnutrition on admission to hospital?\n\nOptions:\n(B)The MUST tool\n(D)Demi-span", "target": "(B)"}
{"input": "Q: Which are the FIVE main series of apoproteins that have been identified?\n\nOptions:\n(B)apoA, apo(a), apoB, apoC and apoE\n(D)apoB, apoC, apoD, apoE and apoM", "target": "(B)"}
{"input": "Q: What is meant by the term 'functional isolation'?\n\nOptions:\n(B)A child that is isolated from proper nutrition and therefore not developing adequately\n(C)A malnourished, apathetic child that is not receiving the same stimulation from the environment affecting his/her development negatively", "target": "(C)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(A)The flavonoid class comprises flavonoids and isoflavonoids.\n", "target": "(A)"}
{"input": "Q: The thermic effect of food\n\nOptions:\n(C)is partly related to sympathetic activity stimulation in the postprandial phase\n(D)is not attenuated by food malabsorption.", "target": "(C)"}
{"input": "Q: What is the typical body composition of a normal weight young adult man?\n\nOptions:\n(A)Fat = 17%, Fat Free Mass=83%, Intracellular Fluid= 40%, Extracellular Fluid= 20%\n", "target": "(A)"}
{"input": "Q: The stomach lining contains several types of cells. Which statement about them is correct?\n\nOptions:\n(A)Mucous cells secrete the glycoprotein mucin\n(C)Parietal cells secrete pepsinogen, the inactive precursor of pepsin", "target": "(A)"}
{"input": "Q: In which form is selenium found in the 25 human selenoproteins?\n\nOptions:\n(B)Selenocysteine\n", "target": "(B)"}
{"input": "Q: The body's adjustment of heat production to changes in the plane of nutrition (under- or over-nutrition) and to minimize energy imbalance is known as:\n\nOptions:\n(B)Thermic effect of food\n(C)Adaptive thermogenesis", "target": "(C)"}
{"input": "Q: Which of the following lipoproteins is produced via the exogenous lipoprotein pathway?\n\nOptions:\n(C)Chylomicrons\n", "target": "(C)"}
{"input": "Q: Which statement about protein digestion and absorption is most correct?\n\nOptions:\n(A)The products of protein digestion may be absorbed as free amino acids or as di- or tripeptides\n", "target": "(A)"}
{"input": "Q: IBS\n\nOptions:\n(B)Is a contra-indication to colonoscopy\n(C)May be associated with constipation", "target": "(C)"}
{"input": "Q: Which of two hormones act on the hypothalamus to increase satiety and hunger, respectively?\n\nOptions:\n(A)Leptin and insulin\n(B)Leptin and ghrelin", "target": "(B)"}
{"input": "Q: Children who are obese should:\n\nOptions:\n(C)Reduce their total energy intake, increase their activity level and reduce their screen time\n", "target": "(C)"}
{"input": "Q: Which of these factors increases the risk for postmenopausal breast cancer?\n\nOptions:\n(B)Dietary fat\n(D)Obesity", "target": "(D)"}
{"input": "Q: Intestinal failiure:\n\nOptions:\n(A)Always requires parenteral nutritional suport\n(D)May benefit from sodium supplementation of >=90mmol/l", "target": "(D)"}
{"input": "Q: Which of the following is the main nitrogenous compound in urine?\n\nOptions:\n(C)Urea\n", "target": "(C)"}
{"input": "Q: Which of the following statements about human amino acid requirements in human nutrition is correct?\n\nOptions:\n(B)The amino acid requirements determined for adults is assumed to be the requirements for maintenance for all ages.\n(D)The amino acid pattern of human tissue protein is assumed to be the requirement patterns for infants and young children.", "target": "(B)"}
{"input": "Q: All babies lose weight after birth, you should be concerned when:\n\nOptions:\n(A)Weight loss is 5%\n(D)Weight loss in > than 10% or birth weight is not regained by day 14", "target": "(D)"}
{"input": "Q: Which of the following foods do not contain free sugars\n\nOptions:\n(A)Cows' milk\n", "target": "(A)"}
{"input": "Q: What are the limitations of food balance sheets? (select all that apply)?\n\nOptions:\n(A)No account is taken of waste or losses of food\n(D)All of the options given are correct", "target": "(D)"}
{"input": "Q: Obesity increases the risk of endometrial cancer. Which hormone is thought to mediate this effect?\n\nOptions:\n(B)Oestrogen\n(C)Insulin-like growth factor-1", "target": "(B)"}
{"input": "Q: Which of these factors increases the risk for cancer of the stomach?\n\nOptions:\n(B)Sugar\n(C)Salt and salt-preserved foods", "target": "(C)"}
{"input": "Q: Lactose\n\nOptions:\n(A)Is always the cause of milk intolerance\n(D)Is excluded on a low FODMAP diet", "target": "(D)"}
{"input": "Q: What is the estimated global prevalence of untreated dental caries?\n\nOptions:\n(B)40%\n(C)60%", "target": "(B)"}
{"input": "Q: Which of the following statements is incorrect regarding fatty acid ß-oxidation?\n\nOptions:\n(A)The major site of fatty acid ß-oxidation is the peroxisomes, the mitochondria also contain enzymes for this pathway\n(C)The rate of b-oxidation is regulated by the availability of fatty acids and the rate of utilisation of b-oxidation products", "target": "(A)"}
{"input": "Q: Which of the following statements is correct?\n\nOptions:\n(D)Mycotoxins contaminate foods containing fungi formed during storage under moist conditions\n", "target": "(D)"}
{"input": "Q: Nitrites are added to processed meats mainly to prevent the growth of the following genus of microorganisms\n\nOptions:\n(B)clostridium\n", "target": "(B)"}
{"input": "Q: How many stages within the food supply chain can food availability and consumption be measured?\n\nOptions:\n(A)10\n(B)5", "target": "(B)"}