{"input": "Q: What is a replay attack?\nOptions:\n(C)An attack that uses the system's own messages and so cannot be defended against\n(D)The attacker resends a captured message, and the site accept its and responds in the attacker's favor", "target": "(D)"}
{"input": "Q: A sender must not be able to deny sending a message that was sent, is known as\nOptions:\n(A)Message Nonrepudiation\n(D)Message Sending", "target": "(A)"}
{"input": "Q: Which of the following is not a security exploit?\nOptions:\n(B)Cross-site scripting\n(C)Authentication", "target": "(C)"}
{"input": "Q: Statement 1| A U2F USB dongle prevents malware on the user’s computer from stealing the user’s second factor to authenticate as that user even when the user’s computer is turned off. Statement 2| A server using U2F can reliably determine that the user who is attempting to login is indeed behind the computer that sent the login request.\nOptions:\n(C)True, False\n", "target": "(C)"}
{"input": "Q: Man in the middle attack can endanger the security of Diffie Hellman method if two parties are not\nOptions:\n(B)Authenticated\n(C)Submitted", "target": "(B)"}
{"input": "Q: What tool can be used to perform SNMP enumeration?\nOptions:\n(C)Nslookup\n(D)IP Network Browser", "target": "(D)"}
{"input": "Q: What does EXE do when the STP solver times out on a constraint query for a particular path?\nOptions:\n(B)Assume that the query is not satisfiable and stop executing the path\n(D)Remove a subset of the constraints and retry the query.", "target": "(B)"}
{"input": "Q: When a wireless user authenticates to any AP, both of them go in the course of four-step authentication progression which is called _____________\nOptions:\n(A)AP-handshaking\n(B)4-way handshake", "target": "(B)"}
{"input": "Q: A session symmetric key between two parties is used\nOptions:\n(A)Only once\n", "target": "(A)"}
{"input": "Q: Which of the following is not a block cipher operating mode?\nOptions:\n(C)CBF\n(D)CBC", "target": "(C)"}
{"input": "Q: The stack is memory for storing\nOptions:\n(A)Local variables\n", "target": "(A)"}
{"input": "Q: The sub key length at each round of DES is__________\nOptions:\n(A)32\n(B)56", "target": "(B)"}
{"input": "Q: Why would a ping sweep be used?\nOptions:\n(A)To identify live systems\n(C)To identify open ports", "target": "(A)"}
{"input": "Q: Let suppose a search box of an application can take at most 200 words, and you’ve inserted more than that and pressed the search button; the system crashes. Usually this is because of limited __________\nOptions:\n(A)buffer\n(C)processing power", "target": "(A)"}
{"input": "Q: Which of the following is true of mutation-based fuzzing?\nOptions:\n(A)It generates each different input by modifying a prior input\n", "target": "(A)"}
{"input": "Q: A digital signature needs a\nOptions:\n(C)Public-key system\n", "target": "(C)"}
{"input": "Q: How do you prevent SQL injection?\nOptions:\n(A)Escape queries\n(D)All of the above", "target": "(A)"}
{"input": "Q: In Message Condentiality, the transmitted message must make sense to only intended\nOptions:\n(A)Receiver\n(D)Translator", "target": "(A)"}
{"input": "Q: How is IP address spoofing detected?\nOptions:\n(B)Comparing the TTL values of the actual and spoofed addresses\n", "target": "(B)"}
{"input": "Q: In a _____________ attack, the extra data that holds some specific instructions in the memory for actions is projected by a cyber-criminal or penetration tester to crack the system.\nOptions:\n(A)Phishing\n(C)Buffer-overflow", "target": "(C)"}
{"input": "Q: A ___________ is a method in which a computer security mechanism is bypassed untraceable for accessing the computer or its information.\nOptions:\n(B)backdoor\n(C)clickjacking", "target": "(B)"}
{"input": "Q: Message authentication is a service beyond\nOptions:\n(B)Message Integrity\n(D)Message Sending", "target": "(B)"}
{"input": "Q: A/an ___________ is a program that steals your logins & passwords for instant messaging applications.\nOptions:\n(A)IM – Trojans\n", "target": "(A)"}
{"input": "Q: The message must be encrypted at the sender site and decrypted at the\nOptions:\n(C)Receiver site\n(D)Conferencing", "target": "(C)"}
{"input": "Q: How does a buffer overflow on the stack facilitate running attacker-injected code?\nOptions:\n(A)By overwriting the return address to point to the location of that code\n(D)By changing the name of the running executable, stored on the stack", "target": "(A)"}
{"input": "Q: A packet filter firewall filters at the\nOptions:\n(A)Application or transport\n(D)Network or transport layer", "target": "(D)"}
{"input": "Q: Why is it that the compiler does not know the absolute address of a local variable?\nOptions:\n(A)Programs are not allowed to reference memory using absolute addresses\n(C)As a stack-allocated variable, it could have different addresses depending on when its containing function is called", "target": "(C)"}
{"input": "Q: Which of the following is not a transport layer vulnerability?\nOptions:\n(A)Mishandling of undefined, poorly defined variables\n(D)Unauthorized network access", "target": "(D)"}
{"input": "Q: Based on the paper “Click Trajectories: End-to-End Analysis of the Spam Value Chain”, which of the following statements are true? “Spammers” here refer to operators of various parts of the “spam value chain.”\nOptions:\n(A)Spammers run their spam-advertised web sites on compromised user machines that are part of a botnet.\n(D)B and C", "target": "(D)"}
{"input": "Q: ______________ is a widespread app’s coding mistake made by developers which could be exploited by an attacker for gaining access or malfunctioning your system.\nOptions:\n(B)Buffer-overrun\n", "target": "(B)"}
{"input": "Q: What is a nop sled\nOptions:\n(B)It is a sequence of nops preceding injected shellcode, useful when the return address is unknown\n(C)It is a method of removing zero bytes from shellcode", "target": "(B)"}
{"input": "Q: What does it mean to \"be stealthy\" during a penetration test?\nOptions:\n(A)Performing the tests from an undisclosed location\n(D)Taking care to avoid activities during a penetration test that might attract attention, e.g., by operators or IDS services", "target": "(D)"}
{"input": "Q: A _________________ may be a hidden part of a program, a separate infected program a Trojan in disguise of an executable or code in the firmware of any system’s hardware.\nOptions:\n(C)backdoor\n", "target": "(C)"}
{"input": "Q: The AH Protocol provides source authentication and data integrity, but not\nOptions:\n(A)Integrity\n(B)Privacy", "target": "(B)"}
{"input": "Q: To verify a digital signature we need the\nOptions:\n(B)Sender’s Public key\n", "target": "(B)"}
{"input": "Q: The Message condentiality or privacy means that the sender and the receiver expect\nOptions:\n(B)Condentiality\n(D)Nonrepudiation", "target": "(B)"}
{"input": "Q: Assume that a TLS connection has been established successfully between a client and a server. Establishing the session included checking the server certificate and executing a DiffieHelmann exchange, but the client did not provide a client certificate. Further, assume that the client and server are honest, that the client and server don’t leak their keys, and that the cryptography is good. Which of the following attacks does TLS protect against?\n1. An attacker replacing bytes sent by a client with bytes of the attacker’s own choosing.\n2. An attacker reading the plaintext bytes sent by a client.\nOptions:\n(A)True, True\n(C)True, False", "target": "(A)"}
{"input": "Q: Which Nmap scan is does not completely open a TCP connection?\nOptions:\n(A)SYN stealth scan\n(D)ACK scan", "target": "(A)"}
{"input": "Q: ____________________ is the anticipation of unauthorized access or break to computers or data by means of wireless networks.\nOptions:\n(B)Wireless security\n(D)Wired device apps", "target": "(B)"}
{"input": "Q: The __________ was a huge marketplace of Dark Web specifically famous for selling of illegal drugs & narcotics as well as you can find a wide range of other goods for sale.\nOptions:\n(A)Silk Road\n(B)Cotton Road", "target": "(A)"}
{"input": "Q: Can a stream cipher have perfect secrecy?\nOptions:\n(A)Yes, if the PRG is really “secure”\n(D)No, since the key is shorter than the message", "target": "(D)"}
{"input": "Q: You are given a message (m) and its OTP encryption (c). Can you compute the OTP key from m and c ?\nOptions:\n(A)No, I cannot compute the key.\n(B)Yes, the key is k = m xor c.", "target": "(B)"}
{"input": "Q: MIT’s Kerberos KDC server has a maximum ticket lifetime of 24 hours (for most user principals). What ensures that an expired Kerberos ticket can no longer be used?\nOptions:\n(B)When a client connects to a server, the server sets a 24-hour timer to terminate the connection, which ensures a client cannot remain connected past the ticket’s maximum lifetime.\n(C)When a client connects to a server, the server compares the ticket’s expiration time to the server’s current clock, and refuses to authenticate the user if the ticket expiration time is in the past.", "target": "(C)"}
{"input": "Q: _______________ is a popular tool used for network analysis in multiprotocol diverse network.\nOptions:\n(B)SuperScan\n(D)EtterPeak", "target": "(D)"}
{"input": "Q: ___________________ is alike as that of Access Point (AP) from 802.11, & the mobile operators uses it for offering signal coverage.\nOptions:\n(B)Base Transmitter Station\n(C)Base Transceiver Station", "target": "(C)"}
{"input": "Q: Which of the following does authorization aim to accomplish?\nOptions:\n(A)Restrict what operations/data the user can access\n", "target": "(A)"}
{"input": "Q: Let F: K \\times R \\to MF:K×R→M be a secure PRF. For m \\in Mm∈M define E(k,m) = \\big[ r \\gets R,\\ \\text{output } \\big(r,\\ F(k,r) \\oplus m\\big)\\ \\big]E(k,m)=[r←R, output (r, F(k,r)⊕m) ] Is EE symantically secure under CPA?\nOptions:\n(C)Yes, but only if R is large enough so r never repeats (w.h.p)\n(D)It depends on what F is used", "target": "(C)"}
{"input": "Q: What is a web proxy?\nOptions:\n(A)A piece of software that intercepts and possibly modifies requests (and responses) between a web browser and web server\n(B)An agent that makes decisions on the client's behalf when interacting with web applications", "target": "(A)"}
{"input": "Q: Which form of encryption does WPA use?\nOptions:\n(B)LEAP\n(C)TKIP", "target": "(C)"}
{"input": "Q: The openSSL implementation described in “Remote Timing Attacks are Practical” (by Brumley and Boneh) uses the following performance optimizations: Chinese Remainder (CR), Montgomery Representation (MR), Karatsuba Multiplication (KM), and Repeated squaring and Sliding windows (RS). Which of the following options would close the timing channel attack described in the paper if you turned the listed optimizations off?\n1. CR and MR\n2. CR\nOptions:\n(A)True, True\n(C)True, False", "target": "(A)"}
{"input": "Q: Which of the following is a remote Trojan?\nOptions:\n(A)Troya\n(B)DaCryptic", "target": "(A)"}
{"input": "Q: What was the first buffer overflow attack?\nOptions:\n(A)Love Bug\n(C)Morris Worm", "target": "(C)"}
{"input": "Q: What are the port states determined by Nmap?\nOptions:\n(C)Open, filtered, unfiltered\n(D)Active, closed, unused", "target": "(C)"}
{"input": "Q: Suppose Unix did not provide a way of passing file descriptors between processes, but still allowed inheriting file descriptors from a parent on fork and exec. What aspects of the OKWS design would break without file descriptor passing?\n1. It would be impossible for services to get a TCP connection to the client web browser.\n2. It would be impossible for okd to run as a non-root user.\nOptions:\n(C)True, False\n", "target": "(C)"}
{"input": "Q: When the data must arrive at the receiver exactly as they were sent, its called\nOptions:\n(B)Message Integrity\n(D)Message Sending", "target": "(B)"}
{"input": "Q: Three of the following are classic security properties; which one is not?\nOptions:\n(B)Availability\n", "target": "(B)"}
{"input": "Q: When does a buffer overflow occur, generally speaking?\nOptions:\n(C)when a pointer is used to access memory not allocated to it\n", "target": "(C)"}
{"input": "Q: Which of the following is not an example of presentation layer issues?\nOptions:\n(A)Poor handling of unexpected input can lead to the execution of arbitrary instructions\n(D)Weak or non-existent authentication mechanisms", "target": "(D)"}
{"input": "Q: Which of the following is an authentication method?\nOptions:\n(B)Biometric\n(D)All of the above", "target": "(D)"}
{"input": "Q: ____________ is also a part of darknet that is employed for transferring files anonymously.\nOptions:\n(A)Freenet\n", "target": "(A)"}
{"input": "Q: Failed sessions allow brute-force attacks on access credentials. This type of attacks are done in which layer of the OSI model?\nOptions:\n(C)Session layer\n(D)Presentation layer", "target": "(C)"}
{"input": "Q: Which of the following are benefits of penetration testing?\nOptions:\n(A)Results are often reproducible\n(C)Compositionality of security properties means tested components are secure even if others change", "target": "(A)"}
{"input": "Q: Suppose Unix did not provide a way of passing file descriptors between processes, but still allowed inheriting file descriptors from a parent on fork and exec. What aspects of the OKWS design would break without file descriptor passing?\n1. It would be impossible for services to send messages to oklogd.\n2. It would be impossible for services to get a TCP connection to a database proxy.\nOptions:\n(B)False, False\n(C)True, False", "target": "(B)"}
{"input": "Q: Which of the following deals with network intrusion detection and real-time traffic analysis?\nOptions:\n(C)Snort\n(D)Nessus", "target": "(C)"}
{"input": "Q: Which of the following is a Wireless traffic Sniffing tool?\nOptions:\n(D)Wireshark\n", "target": "(D)"}
{"input": "Q: Suppose you want to use fuzzing on a program to try to find memory errors; which of the following statements is true?\nOptions:\n(C)Compiling the program with address sanitizer (ASAN) will make the source of a memory error easier to find\n(D)Fuzzing doesn't find memory errors, it finds crashes and hangs", "target": "(C)"}
{"input": "Q: What is the difference between a direct leak and a side channel?\nOptions:\n(C)A direct leak comes via the software system's intended interaction mechanism, where as a side channel leak comes from measurements of other system features, like timing, power usage, or space usage\n(D)There is no difference", "target": "(C)"}
{"input": "Q: What is Nmap?\nOptions:\n(A)It is a scanner which works by injecting packets to a range of addresses, and inferring what hosts and services might be at those addresses, based on the responses\n(D)It is a suite of tools for scripting attacks: probe, construct, encode, inject, wait for response", "target": "(A)"}
{"input": "Q: Suppose that Alice and Bob sent confidential text messages to one another last month through an encrypted messaging system. Alice and Bob are worried that an adversary might compromise one of their computers today, while they are taking the 6.858 final exam, and would then be able to decrypt those messages. Which of the following security properties can address Alice and Bob’s concern?\nOptions:\n(A)Authentication.\n(C)Forward secrecy", "target": "(C)"}
{"input": "Q: The ______________ can cost you money, by sending text messages from your mobile phone numbers.\nOptions:\n(C)SMS Trojan\n(D)Ransom Trojan", "target": "(C)"}
{"input": "Q: ___________________ began to show up few years back on wireless access points as a new way of adding or connecting new devices.\nOptions:\n(C)WPS\n(D)WEP", "target": "(C)"}
{"input": "Q: Which among the following is the least strong security encryption standard?\nOptions:\n(A)WEP\n", "target": "(A)"}
{"input": "Q: Old operating systems like _______ and NT-based systems have buffer-overflow attack a common vulnerability.\nOptions:\n(A)Windows 7\n(D)UNIX", "target": "(D)"}
{"input": "Q: An integer overflow occurs when\nOptions:\n(C)an integer is used to access a buffer outside of the buffer's bounds\n(D)there is no more space to hold integers in the program", "target": "(D)"}
{"input": "Q: The four Primary Security Principles related to messages are\nOptions:\n(A)Confidentiality, Integrity, Non repudiation and Authentication\n(B)Confidentiality, Access Control, Integrity, Non repudiation", "target": "(A)"}
{"input": "Q: A special tool is necessary for entering the network which is _______________ that helps the anonymous internet users to access into the Tor’s network and use various Tor services.\nOptions:\n(A)Opera browser\n(D)Tor browser", "target": "(D)"}
{"input": "Q: Let HH be a Merkle-Damgard hash function is H:X^{\\leq L} \\to TH:X^≤L  →T. Construct a MAC from this HH as follows: \\ \\ S(k,m) = H(k \\| m)  S(k,m)=H(k∥m). This mac is insecure because:\nOptions:\n(A)Given H(k \\| m)H(k∥m) anyone can compute H(w \\| k \\| m \\| \\text{PB})H(w∥k∥m∥PB) for any ww\n(C)Given H(k \\| m)H(k∥m) anyone can compute H(k \\| m \\| \\text{PB} \\| w)H(k∥m∥PB∥w) for any ww", "target": "(C)"}
{"input": "Q: The ______________ is categorized as an unknown segment of the Deep Web which has been purposely kept hidden & is inaccessible using standard web browsers.\nOptions:\n(C)Dark web\n(D)Surface web", "target": "(C)"}
{"input": "Q: A __________ is a sequential segment of the memory location that is allocated for containing some data such as a character string or an array of integers.\nOptions:\n(B)queue\n(D)buffer", "target": "(D)"}
{"input": "Q: Encapsulating Security Payload (ESP) belongs to which Internet Security Protocol?\nOptions:\n(B)Secure IP Protocol\n(D)Transport Layer Security Protocol", "target": "(B)"}
{"input": "Q: Let I = (S,V)I=(S,V) be a MAC. Suppose S(k,m)S(k,m) is always 5 bits long. Can this MAC be secure?\nOptions:\n(A)No, an attacker can simply guess the tag for messages\n(B)It depends on the details of the MAC", "target": "(A)"}
{"input": "Q: The openSSL implementation described in “Remote Timing Attacks are Practical” (by Brumley and Boneh) uses the following performance optimizations: Chinese Remainder (CR), Montgomery Representation (MR), Karatsuba Multiplication (KM), and Repeated squaring and Sliding windows (RS). Which of the following options would close the timing channel attack described in the paper if you turned the listed optimizations off?\n1. RS and KM\n2. RS and MR\nOptions:\n(C)True, False\n(D)False, True", "target": "(D)"}
{"input": "Q: In Brumley and Boneh’s paper on side-channel attacks, why does blinding prevent the timing attack from working?\nOptions:\n(A)Blinding prevents the server from using the CRT optimization, which is essential to the timing attack.\n(C)Blinding randomizes the ciphertext being decrypted, thus obscuring the correlation between an adversary’s input and the timing differences.", "target": "(C)"}
{"input": "Q: The digest created by a hash function is normally called a\nOptions:\n(A)Modication detection code (MDC)\n", "target": "(A)"}
{"input": "Q: Public key encryption is advantageous over Symmetric key Cryptography because of\nOptions:\n(C)Key exchange\n(D)Key length", "target": "(C)"}
{"input": "Q: Assume that a TLS connection has been established successfully between a client and a server. Establishing the session included checking the server certificate and executing a DiffieHelmann exchange, but the client did not provide a client certificate. Further, assume that the client and server are honest, that the client and server don’t leak their keys, and that the cryptography is good. Which of the following attacks does TLS protect against?\n1. An attacker replaying bytes that a client sent earlier.\n2. An attacker impersonating the server.\nOptions:\n(A)True, True\n(C)True, False", "target": "(A)"}
{"input": "Q: Applications developed by programming languages like ____ and ______ have this common buffer-overflow error.\nOptions:\n(A)C, Ruby\n(C)C, C++", "target": "(C)"}
{"input": "Q: Why apps developed in languages like C, C++ is prone to Buffer-overflow?\nOptions:\n(A)No string boundary checks in predefined functions\n(D)No database check", "target": "(A)"}
{"input": "Q: Which among them has the strongest wireless security?\nOptions:\n(B)WPA\n(D)WPA3", "target": "(D)"}
{"input": "Q: What are the types of scanning?\nOptions:\n(B)Network, vulnerability, and port \n", "target": "(B)"}
{"input": "Q: In MD-5 the length of the message digest is\nOptions:\n(B)128\n", "target": "(B)"}
{"input": "Q: Based on the paper “SoK: SSL and HTTPS: Revisiting past challenges and evaluating certificates trust model enhancements”, which of the following statements are false?\nOptions:\n(A)Valid DV certificates provide more confidence to a user that she is connecting to the intended party than valid EV certificates.\n(D)Server key-pinning makes it harder for an adversary to convince a CA to mint a certificate for a site and launch an MITM attack on that site.", "target": "(A)"}
{"input": "Q: 1. _________ framework made cracking of vulnerabilities easy like point and click.\nOptions:\n(A).Net\n(B)Metasploit", "target": "(B)"}
{"input": "Q: _______________ is the central node of 802.11 wireless operations.\nOptions:\n(B)Access Point\n(C)WAP", "target": "(B)"}
{"input": "Q: Consider the paper Native Client: A Sandbox for Portable, Untrusted x86 Native Code by Yee et al. Ben Bitdiddle notes that NaCl uses Intel x86 segmentation to ensure that the sandboxed module does not read or write memory outside its own data area, and does not execute instructions outside its own code. Ben thinks that with these restrictions alone, executing the sandboxed module must be safe; that is, he thinks validation is not needed. Ben is wrong. Circle the types of x86 machine instructions that the validator always forbids in sandboxed code. Please ignore trampoline and springboard code.\nOptions:\n(A)all instructions that modify segment state\n", "target": "(A)"}
{"input": "Q: Which of the following are most vulnerable to injection attacks?\nOptions:\n(C)Network communications\n(D)SQL queries based on user input", "target": "(D)"}
{"input": "Q: Buffer-overflow may remain as a bug in apps if __________ are not done fully.\nOptions:\n(B)memory checks\n(C)boundary checks", "target": "(C)"}
{"input": "Q: A proxy rewall lters at the\nOptions:\n(B)Application layer\n(D)Network layer", "target": "(B)"}
{"input": "Q: Which of the following styles of fuzzer is more likely to explore paths covering every line of code in the following program?\nOptions:\n(C)Whitebox\n", "target": "(C)"}
{"input": "Q: Encryption and decryption provide secrecy, or condentiality, but not\nOptions:\n(B)Integrity\n(C)Privacy", "target": "(B)"}