{"input": "Q:  What two problems does individualism lead us into, according to Hourdequin?\nOptions:\n(A)It leads to failures of developing integration and integrality.\n(D)We both tend to think of our moral obligations as only personal obligations, and so think that we can only advocate for policy in \"tragedy of the commons\" situations.", "target": "(D)"}
{"input": "Q:  More than communicating to an individual, McGregor argues that rape\nOptions:\n(B)expresses contempt for the democratic system of government.\n(C)expresses the inferiority of women as a group to the wider community.", "target": "(C)"}
{"input": "Q:  Lukianoff and Haidt argue that trigger warnings involve which kind of pathological thinking?\nOptions:\n(B)blaming\n(D)resentment", "target": "(B)"}
{"input": "Q:  Which of the following claims would Leopold clearly accept?\nOptions:\n(B)We should think in terms of \"the balance of nature\" to properly appreciate the value of the natural environment.\n(C)The problems associated with how we should use our natural environment are not merely economic problems.", "target": "(C)"}
{"input": "Q:  Sarah Fine's \"internal critique\" of Wellman's argument targets his claim that\nOptions:\n(B)freedom of association implies that a legitimate state has a presumptive right to exclude anyone from its territory.\n", "target": "(B)"}
{"input": "Q:  Which of the following is an example of a vice of character?\nOptions:\n(D)cowardice\n", "target": "(D)"}
{"input": "Q:  Which of the following is a possible source of obligations, according to Cohen?\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q:  According to Aquinas, every law is ordained to\nOptions:\n(C)the common good.\n(D)individual happiness.", "target": "(C)"}
{"input": "Q:  One kind of externality imposed on the world's poor by the economic activity of wealthy nation is\nOptions:\n(A)unequal social order.\n(D)pollution.", "target": "(D)"}
{"input": "Q:  What does Marquis think is the main reason why it is wrong to kill a fetus?\nOptions:\n(C)Killing the fetus would deprive it of a valuable future.\n", "target": "(C)"}
{"input": "Q:  According to Shapiro, the standard view has to explain the preeminence of controlled use by arguing that\nOptions:\n(B)drug laws have no effect on access to illegal drugs.\n(C)drug laws reduce access to illegal drugs.", "target": "(C)"}
{"input": "Q:  Shapiro discusses experiments about the role of expectations in the experience of drug use to show that\nOptions:\n(C)there is no such thing as drug addiction.\n(D)sometimes a drug's effects are the direct result of what one expects from the drug.", "target": "(D)"}
{"input": "Q:  Mill defends which of the following liberty-limiting principles?\nOptions:\n(A)the harm principle\n(C)the principle of legal paternalism", "target": "(A)"}
{"input": "Q:  Wellman's response to the \"egalitarian\" objection to the state's right to exclude is that states can fulfill their duties to outsiders without allowing them into their territory. Fine thinks Wellman's response is insufficient because\nOptions:\n(A)egalitarians are committed to utilitarian principles.\n(C)excluding people who wish to pursue interests specific to that state is still potentially harmful.", "target": "(C)"}
{"input": "Q:  In reproductive cloning, the cloned individual will have nearly the same genetic makeup as\nOptions:\n(A)the female who carries the zygote to term.\n(B)the individual who donates the nucleus.", "target": "(B)"}
{"input": "Q:  In accordance with the theory of justice proposed by John Rawls, Stephen Macedo argues,\"We must consider the justifiability of policies from the standpoint of the _____ well-off among our fellow citizens.\"\nOptions:\n(A)most\n(B)least", "target": "(B)"}
{"input": "Q:  Mill thinks that each person desires\nOptions:\n(C)his or her own happiness.\n(D)none of the above", "target": "(C)"}
{"input": "Q:  On McGregor's view, our rights carve out\nOptions:\n(C)the domain of our personal identity.\n", "target": "(C)"}
{"input": "Q:  Dershowitz discusses the hypothetical case where the hijacked planes of 9/11 must be shot down to argue that important decisions like these\nOptions:\n(B)should be made with visibility and accountability by the highest-level officials.\n(C)have no objective answer.", "target": "(B)"}
{"input": "Q:  Van den Haag thinks that we can't know whether a murderer who receives the death penalty\nOptions:\n(B)suffers more than the victim.\n(C)is morally degraded.", "target": "(B)"}
{"input": "Q:  In Singer's view, the question of when it's wrong to painlessly kill an animal is one\nOptions:\n(A)to which we need to give a precise answer.\n(B)to which we need give no precise answer.", "target": "(B)"}
{"input": "Q:  What kind of consequentialist theory does Dershowitz think can justify terrorism in certain extreme particular cases?\nOptions:\n(B)rule-based hedonism\n(D)act utilitarianism", "target": "(D)"}
{"input": "Q:  In response to the argument that embryos are not persons because they lack certain rights that all persons have (such as the right to life), Lee and George argue that\nOptions:\n(A)the right to life belongs to a human being at all times that he or she exists.\n", "target": "(A)"}
{"input": "Q:  Corvino considers the following argument: Homosexuals are \"born that way\"; therefore, homosexual activity is good and natural. Corvino claims that this argument is unsound. Why?\nOptions:\n(B)It assumes that all innate desires are good ones.\n(D)None of the above", "target": "(B)"}
{"input": "Q:  West argues that feminist rhetoric has\nOptions:\n(A)obscures the harms of noncoerced, consensual sex by implying that because what is coerced is bad what is noncoerced is good.\n", "target": "(A)"}
{"input": "Q:  In his objection to \"the second prong of the libertarian case for open borders,\" Wellman responds to the objection that he is essentially denying that we have a right to freedom of movement. Which of the following is part of his response?\nOptions:\n(A)He would say this begs the question because the immigration question is identical to the freedom-of-movement question.\n(C)He would argue that some rights are not absolute (e.g., the right to marriage doesn't allow you to marry an unwilling partner).", "target": "(C)"}
{"input": "Q:  Carens argues that a policy of exclusion does not always imply that the culture and people being protected are superior because\nOptions:\n(B)the exclusion may simply reflect an attachment to what is one's own (rather than a belief in superiority).\n(D)only superior cultures have freedom of movement.", "target": "(B)"}
{"input": "Q:  Instead of asking why the act of destroying the environment might be immoral, Hill wants to ask\nOptions:\n(B)why people who destroy the environment might be bad people.\n(D)whether plants have interests.", "target": "(B)"}
{"input": "Q:  Kant's Universal Law formulation does not refer to an agent's wants; rather, it represents\nOptions:\n(A)an ethical dilemma.\n(D)a kind of consistency test.", "target": "(D)"}
{"input": "Q:  What is the overall percentage of capital cases that are overturned because of serious errors?\nOptions:\n(C)68 percent\n(D)82 percent", "target": "(C)"}
{"input": "Q:  Callahan discusses the Dutch Commission on Euthanasia in 1990 to show that\nOptions:\n(B)doctors who perform euthanasia may not report doing so.\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Velleman believes that the option of euthanasia may harm some patients. What does he think is the most significant way in which this might happen?\nOptions:\n(A)by burdening a patient with having to justify his or her continued existence\n", "target": "(A)"}
{"input": "Q:  Utilitarian arguments depend heavily on factual claims about\nOptions:\n(D)the overall comparative effects of contemplated courses of action.\n", "target": "(D)"}
{"input": "Q:  Why can't animals be bearers of rights according to Cohen?\nOptions:\n(A)because rights are essentially human\n(D)none of the above; Cohen holds that animals can have rights", "target": "(A)"}
{"input": "Q:  One of the premises of the \"lack of imagination\" argument that Kamm discusses is that\nOptions:\n(C)most people's conception of the varieties of goods is limited.\n(D)we ought to always leave the development of valuable traits up to chance.", "target": "(C)"}
{"input": "Q:  A utilitarian who recognizes rights will attempt to explain rights on the basis of utility by claiming that\nOptions:\n(C)a moral right is a kind of claim that is justified by the fact that its recognition will contribute to the maximization of overall welfare.\n", "target": "(C)"}
{"input": "Q:  Which of the following is an example of a duty-based moral theory?\nOptions:\n(B)natural law theory\n(C)Kantian moral theories", "target": "(C)"}
{"input": "Q:  Michael Gill begins by discussing arguments against autonomy-based justifications of euthanasia. According to these arguments, autonomy-based justifications are contradictory because\nOptions:\n(A)the value of autonomy relates only to the making of big decisions.\n(C)killing a person destroys his or her ability to make autonomous decisions.", "target": "(C)"}
{"input": "Q:  According to Corvino, the \"unnaturalness\" charge can carry moral weight only if those who level it can do two things:\nOptions:\n(B)(i) specify exactly what they mean by \"unnaturalness\" and (ii) explain why unnaturalness (so defined) matters morally.\n", "target": "(B)"}
{"input": "Q:  Sandel believes that the use of genetic enhancement is inherently wrong because\nOptions:\n(A)its use would be unsafe.\n(D)none of the above", "target": "(D)"}
{"input": "Q:  Which of the following is a basic intrinsic good, according to Aquinas's version of natural law theory?\nOptions:\n(A)human life\n(D)all of the above", "target": "(D)"}
{"input": "Q:  Norcross claims that if morality demands that we not torture puppies merely to enhance our own eating pleasure, morality also demands that\nOptions:\n(C)we not support factory farming.\n", "target": "(C)"}
{"input": "Q:  Aristotle claims that a state of character arises from the repetition of similar\nOptions:\n(C)activities.\n(D)opinions.", "target": "(C)"}
{"input": "Q:  Fine asks us to consider the example of a yoga group that practices in Central Park and is free to reject prospective members but isn't free to exclude others from making use of Central Park. The point of this example is to show that\nOptions:\n(B)there is a difference between rules of membership and rules about settlement within a physical territory.\n(D)Wellman is committed to an absurd theory of group membership.", "target": "(B)"}
{"input": "Q:  Which of the following is a \"positional good,\" according to Peter Singer's definition?\nOptions:\n(A)being at least six feet tall (in a population where this is above average)\n", "target": "(A)"}
{"input": "Q:  On Mill's view, the collision with error makes\nOptions:\n(A)the impression of truth all the clearer.\n", "target": "(A)"}
{"input": "Q:  Which of the following is not an example of vice?\nOptions:\n(B)obesity\n", "target": "(B)"}
{"input": "Q:  Baron cites a summary of Ali Soufan's Senate testimony to suggest that\nOptions:\n(A)torture works in only limited situations.\n(C)successful interrogation may not require torture.", "target": "(C)"}
{"input": "Q:  Philippa Foot explains the moral relevance of the killing/letting die distinction by appealing to\nOptions:\n(C)both A and B\n", "target": "(C)"}
{"input": "Q:  Biocentrism is the view that\nOptions:\n(C)all living beings, because they are living, possess direct moral standing.\n(D)the primary bearers of direct moral standing are ecosystems in virtue of their functional integrity.", "target": "(C)"}
{"input": "Q:  Ecoholism is the view that\nOptions:\n(A)only whole ecosystems (not any of the individuals that make up those ecosystems) have direct moral standing.\n(B)ecosystems and some of the individuals that make them up have direct moral standing.", "target": "(B)"}
{"input": "Q:  Which of the following is not an objection Pence gives to the argument that SCNT is not best for the child?\nOptions:\n(A)The argument assumes genetic determinism or genetic reductionism.\n(D)If people's prejudicial attitudes do not change, then we should not allow SCNT.", "target": "(D)"}
{"input": "Q:  Since we who live in wealthy countries have directly caused harm, Pogge argues that we have very stringent\nOptions:\n(C)negative dutiestowards the global poor\n(D)egalitarian duties towards the global poor.", "target": "(C)"}
{"input": "Q:  Lukianoff and Haidt argue that the disinvitation of certain speakers\nOptions:\n(B)will only serve to promote intellectual homogeneity on college and universities.\n(D)All of the above.", "target": "(B)"}
{"input": "Q:  Which of the following is, according to the introduction to chapter 8, typically defined as the act or practice of killing or allowing someone to die?\nOptions:\n(B)ethical killing\n(D)euthanasia", "target": "(D)"}
{"input": "Q:  An oocyte is\nOptions:\n(A)an unfertilized egg.\n(B)the nucleus that is implanted into the ovum during SCNT.", "target": "(A)"}
{"input": "Q:  All cases of euthanasia in which the patient has consented to the active bringing of his or her death are cases of\nOptions:\n(A)voluntary euthanasia.\n", "target": "(A)"}
{"input": "Q:  According to Norcross, any attempt to justify the claim that humans have a higher moral status than other animals by appealing to some version of rationality as the morally relevant difference between humans and animals will\nOptions:\n(A)fail to give an adequate answer to the argument from marginal cases.\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Which of the following best characterizes Rachels's argument?\nOptions:\n(C)There is no inherent moral difference between killing and letting die; therefore, there is no inherent moral difference between active and passive euthanasia.\n(D)There is no inherent moral difference between killing and letting die; therefore, both active and passive euthanasia are morally wrong.", "target": "(C)"}
{"input": "Q:  Thomson's appeal to the vices of callousness and self-centeredness relates to what kind of approach to abortion?\nOptions:\n(C)virtue ethics approach\n(D)consequentalist approach", "target": "(C)"}
{"input": "Q:  Hourdequin argues that one flaw of consequentialist calculation is that\nOptions:\n(A)it fails to reconcile prima facie duties.\n(B)it can run counter to a person's being able to integrate her commitments at various levels.", "target": "(B)"}
{"input": "Q:  Reiman suggests that the refusal to execute criminals teaches\nOptions:\n(A)the wrongfulness of murder.\n", "target": "(A)"}
{"input": "Q:  According to Hardin, the \"ratchet effect\" refers to the fact that\nOptions:\n(D)the use of a world food bank to feed the hungry leads to an escalating series of emergency situations.\n", "target": "(D)"}
{"input": "Q:  Ashford defines a structural human rights violation as\nOptions:\n(A)violations of human rights that pertain to the structure of a person's practical, social, and political agency.\n(B)ongoing patterns of behavior by a large number of agents which predictably result in many others coming to be deprived of the object of a fundamental human right: the means of subsistence.", "target": "(B)"}
{"input": "Q:  According to Aquinas, the first precept of natural law is\nOptions:\n(A)\"good is to be done, evil to be avoided.\"\n(D)\"pleasure is to be sought, pain to be avoided.\"", "target": "(A)"}
{"input": "Q:  Mary is a person, and as such she plausibly deserves moral consideration because of features inherent to her (e.g., being self-aware). This suggests that she has\nOptions:\n(A)direct moral standing.\n(B)indirect moral standing.", "target": "(A)"}
{"input": "Q:  According to Carruthers, which of the following groups should not be accorded direct moral standing?\nOptions:\n(C)the mentally disabled\n(D)none of the above", "target": "(D)"}
{"input": "Q:  Mill thinks that if something is desirable, but not desirable as an end, then it must be\nOptions:\n(B)desirable in theory.\n(C)desirable as a means.", "target": "(C)"}
{"input": "Q:  Altman believes that there are significant difficulties associated with defending a pro-censorship position based solely on claims of which of the following kinds of harm?\nOptions:\n(C)physical harm\n(D)intentional harm", "target": "(D)"}
{"input": "Q:  In Corvino's reading of Aquinas, \"unnatural\" sexual acts are those that are\nOptions:\n(B)non-consensual.\n(D)uncommonly practiced among adults.", "target": "(B)"}
{"input": "Q:  According to Altman, expressive harm is\nOptions:\n(A)a causal consequence of hate speech.\n(B)a harm that derives from the kind of attitude expressed in the act of hate speech.", "target": "(A)"}
{"input": "Q:  The decision to remove Terri Schiavo's feeding tube, thus allowing her to die of dehydration, is a case of:\nOptions:\n(A)voluntary euthanasia.\n(C)passive euthanasia.", "target": "(C)"}
{"input": "Q:  According to rule consequentialism, the rightness or wrongness of an action depends on\nOptions:\n(C)whether a virtuous person would endorse a rule requiring, permitting, or prohibiting that action.\n(D)whether that action is required, permitted, or prohibited by a rule the consequences of which are best.", "target": "(D)"}
{"input": "Q:  Stephen Macedo approaches the ethical issue of immigration from the perspective of _____ justice.\nOptions:\n(C)distributive\n", "target": "(C)"}
{"input": "Q:  Singer argues that developing nations are harming poor nations by\nOptions:\n(A)causing global warming.\n(C)ignoring important aspects of their culture.", "target": "(A)"}
{"input": "Q:  Ross claims that the essential defect of utilitarianism is that it ignores\nOptions:\n(C)epistemological responsibility.\n(D)the personal character of duty.", "target": "(D)"}
{"input": "Q:  What is the main reason why Arthur doesn't think that the poor have a right to aid from the affluent?\nOptions:\n(C)The consequences of helping the poor would be worse than the consequences of not helping them.\n(D)This kind of right would require a contract or agreement, and the affluent haven't entered into a contract or agreement with the poor.", "target": "(D)"}
{"input": "Q:  The view that moral considerations do not apply to war is known as\nOptions:\n(B)antiwar pacifism.\n(D)moral nihilism.", "target": "(D)"}
{"input": "Q:  According to Marquis, abortion is\nOptions:\n(A)absolutely wrong.\n(B)seriously presumptively wrong.", "target": "(B)"}
{"input": "Q:  Aristotle's moral theory is a version of\nOptions:\n(A)virtue ethics.\n(B)consequentialism.", "target": "(A)"}
{"input": "Q:  Kass worries that cloned individuals:\nOptions:\n(C)both of the above\n(D)none of the above", "target": "(C)"}
{"input": "Q:  Why, according to Gill, does Leon Kass think the notion of being \"better off dead\" is incoherent?\nOptions:\n(A)because dead people no longer exist, and thus cannot benefit from choosing to die.\n(C)because there has yet to be a satisfactory philosophical explanation of why death is bad.", "target": "(A)"}
{"input": "Q:  Callahan is against the legalization of euthanasia because he believes legalization would\nOptions:\n(B)teach society the wrong kind of lesson.\n(D)none of the above", "target": "(B)"}
{"input": "Q:  In Carruther's view, the justification for moral criticism for things that we do (or don't to do) to an animal derives from\nOptions:\n(C)the bad qualities of character that our actions evince.\n(D)none of the above", "target": "(C)"}
{"input": "Q:  One suggestion that Lukianoff and Haidt make to challenge vindictive protectiveness is\nOptions:\n(B)to defund the Department of Education.\n(C)to promote greater understanding of historical and contemporary oppression.", "target": "(B)"}
{"input": "Q:  Patrick Lee and Robert George argue that human embryos are complete human beings because\nOptions:\n(C)both A and B\n(D)neither A nor B", "target": "(C)"}
{"input": "Q:  Carens's main conclusion is that\nOptions:\n(A)liberal egalitarianism should almost always press for more openness toward immigrants and refugees.\n", "target": "(A)"}
{"input": "Q:  What assumption does Pence think people who object to SCNT make when they say that SCNT is not best for the child?\nOptions:\n(A)The parents have good motives.\n", "target": "(A)"}
{"input": "Q:  In Altman's characterization, racial epithets and similar terms of abuse are communicative tools for expressing an extreme form of which of the following?\nOptions:\n(C)moral contempt\n", "target": "(C)"}
{"input": "Q:  According to Aristotle, if something has a function, then its good depends on\nOptions:\n(A)its function.\n(B)its substance.", "target": "(A)"}
{"input": "Q:  The goal of cognitive-behavioral therapy is to\nOptions:\n(A)build grit.\n(B)minimize distorted thinking.", "target": "(A)"}
{"input": "Q:  According to consequentialist theories of punishment, a lawbreaker should be punished only if\nOptions:\n(A)the punishment would likely produce as much overall intrinsic value as would any other alternative punishment.\n(C)the punishment is proportional to the wrongness of the crime.", "target": "(A)"}
{"input": "Q:  On Metz's view, what kind of punishment is justified for wrongdoers?\nOptions:\n(B)Unfriendly action that is proportionate to the unfriendly wrongdoing, aimed at correcting the wrongdoing.\n(D)All of the above.", "target": "(B)"}
{"input": "Q:  Macedo describes his position on immigration as politically\nOptions:\n(A)liberal.\n(D)neutral.", "target": "(A)"}
{"input": "Q:  One objection to care ethics is thatit seems to imply that we areresponsible for our attitudes, even though they seem not to be under our voluntary control. Collins responds by arguing that\nOptions:\n(B)we can often bring ourselves to have attitudes of care indirectly\n(D)Collins agrees with the objection.", "target": "(B)"}
{"input": "Q:  Which of the following conditions would make a slippery-slope argument fallacious?\nOptions:\n(C)both A and B are correct; either condition would make the argument fallacious.\n(D)neither A nor B is correct; neither condition would make the argument fallacious.", "target": "(C)"}
{"input": "Q:  Which of the following statements would Macedo disagree with?\nOptions:\n(B)Immigration policies can have powerful economic effects.\n(C)Self-governance is morally irrelevant to the immigration debate.", "target": "(C)"}
{"input": "Q:  According to de Marneffe, which of the following is a reason we might call someone a drug addict?\nOptions:\n(C)Although they believe they should use the drug when they decide to use it, at other times they believe they should not use the drug anymore.\n(D)all of the above", "target": "(D)"}
{"input": "Q:  If Thomson's conclusion is correct, then\nOptions:\n(A)the abortion issue cannot be settled just by determining at what stage (if any) the fetus is a person.\n(C)abortion is never morally permissible.", "target": "(A)"}
{"input": "Q:  The consequentialist approach to punishment is at odds with\nOptions:\n(A)retributive theories of punishment.\n(C)legal theories of punishment.", "target": "(A)"}
{"input": "Q:  According to Lukianoff and Haidt, the recent trend to uncover microaggressions encourages\nOptions:\n(C)labeling, by assigning global negative traits to persons.\n", "target": "(C)"}
{"input": "Q:  On Kant's view, it is morally permissible to:\nOptions:\n(C)engage in consensual sexual activity outside of marriage.\n(D)None of the above.", "target": "(D)"}
{"input": "Q:  The best explanation for drug addiction, according to Shapiro, appeals to\nOptions:\n(A)one's individual mindset and social setting.\n(D)specific psychological disorders such as obsessive-compulsive disorder.", "target": "(A)"}
{"input": "Q:  One problem with treating the ticking bomb case as involving only a single instance of torture, according to Baron, is that\nOptions:\n(B)it is virtually impossible for torture to be limited to just one instance.\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Which of the following is an example of a virtue of character?\nOptions:\n(B)honesty\n(D)simplicity", "target": "(B)"}
{"input": "Q:  Nathanson believes that killing another person in self-defense is compatible with\nOptions:\n(A)respect for the dignity of persons.\n", "target": "(A)"}
{"input": "Q:  In response to the objection that it would be wrong to prohibit the manufacture and sale of fatty foods and tobacco products, de Marneffe argues that\nOptions:\n(A)fatty foods and tobacco products are not actually harmful.\n(B)there is nothing wrong with limiting people's access to products that are harmful to them.", "target": "(B)"}
{"input": "Q:  Wellman argues that insisting on unlimited property rights commits one to\nOptions:\n(A)deontological theory.\n(D)anarchy.", "target": "(D)"}
{"input": "Q:  Which of the following is not one of the four main excuses for terrorism that Michael Walzer discusses?\nOptions:\n(A)Terrorism is a form of freedom of speech.\n(C)Terrorism benefits oppressed groups.", "target": "(A)"}
{"input": "Q:  In Gardiner's analysis, which of the following is a characteristic of the climate change problem?\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q:  According to Sandel, eugenics and genetic enhancement can be seen to be wrong from a religious perspective because\nOptions:\n(A)their use would lead to atheism or agnosticism.\n(B)in using them, we would confuse our role in creation with God's role.", "target": "(B)"}
{"input": "Q:  Christopher Heath Wellman defends the position that\nOptions:\n(A)anti-egalitarianism is compatible with liberal cosmopolitanism.\n(D)nation-states have a presumptive right to close their borders to all potential immigrants.", "target": "(D)"}
{"input": "Q:  Cases in which a doctor is involved to some degree in assisting an individual to commit suicide are known as\nOptions:\n(B)physician-assisted suicide.\n(D)all of the above", "target": "(B)"}
{"input": "Q:  Which of the following is not a requirement on the definition of \"legal punishment\"?\nOptions:\n(A)It must be for an offense against legal rules.\n(C)It must not necessarily be of an actual or supposed offender.", "target": "(C)"}
{"input": "Q:  One of the main factors that Hardin links to world hunger and poverty is\nOptions:\n(A)reproduction rates.\n", "target": "(A)"}
{"input": "Q:  One common objection to utilitarianism is that the principle of utility is\nOptions:\n(B)too demanding.\n(C)too easy to satisfy.", "target": "(B)"}
{"input": "Q:  Which of the following is not an objection that Kass makes against cloning?\nOptions:\n(C)It will produce harmful biological mutations as clones produce further clones.\n", "target": "(C)"}
{"input": "Q:  According to Confucian the model of persons,\nOptions:\n(A)we learn to be persons through familial relations and by learning from other's example.\n(B)we are persons because we have immortal, individual souls.", "target": "(A)"}
{"input": "Q:  According to Aquinas's moral theory, morality is ultimately grounded in\nOptions:\n(A)agreements made between individuals.\n(C)facts about human nature.", "target": "(C)"}
{"input": "Q:  Sinnott-Armstrong is most interested in examining issues about the moral obligations of\nOptions:\n(A)individuals.\n(D)families.", "target": "(A)"}
{"input": "Q:  Thomson discusses a different version of the violinist case wherein the violinist only needs to use your kidneys for one hour to survive. Her own view about this case is that\nOptions:\n(C)because you ought to let the violinist use your kidneys for that hour, we should conclude that he or she has a right to use your kidneys for that hour.\n(D)even though you ought to let the violinist use your kidneys for that hour, we should not conclude that he or she has a right to use your kidneys for that hour.", "target": "(D)"}
{"input": "Q:  One message that Nathanson argues we can send by abolishing the death penalty is that\nOptions:\n(A)we respect the dignity of human life.\n(C)there is no punishment that is proportional to murder.", "target": "(A)"}
{"input": "Q:  Richardson-Self discusses which of the following kinds of speech?\nOptions:\n(A)hate speech\n(D)all of the above", "target": "(D)"}
{"input": "Q:  What is the \"intergenerational storm\" of climate change?\nOptions:\n(D)the problem that countries are possibly biased toward the interests of the current generation, which largely benefits from carbon dioxide emissions.\n", "target": "(D)"}
{"input": "Q:  According to Sinnott-Armstrong, the fact your government morally ought to do something\nOptions:\n(B)does not prove that you ought to do it.\n", "target": "(B)"}
{"input": "Q:  Why does Metz think that extant dignity-based arguments based on African values fail?\nOptions:\n(B)They prove too much. They seem to entail that any instance of killing in self-defense is wrong.\n(C)Both A and B", "target": "(C)"}
{"input": "Q:  In satisfying Kant's Humanity formulation of the categorical imperative, we are obligated to adopt two very general goals: the goal of promoting the (morally permissible) ends of others and the goal of\nOptions:\n(A)self-perfection.\n(B)producing happiness.", "target": "(A)"}
{"input": "Q:  Van den Haag responds to the \"miscarriages of justice\" objection by claiming that\nOptions:\n(A)miscarriages of justice are offset by the moral benefits and usefulness of doing justice.\n(D)none of the above", "target": "(A)"}
{"input": "Q:  In the context of Gardiner's article, \"the fragmentation of agency\" refers to what?\nOptions:\n(C)the vast number of individuals and agents who contribute to climate change\n", "target": "(C)"}
{"input": "Q:  Nathanson proposes a form of retributivism that requires all of the following except\nOptions:\n(D)the death penalty for the most serious crimes.\n", "target": "(D)"}
{"input": "Q:  Which of the following is a method of torture that Dershowitz believes is appropriate in those cases where torture is permissible?\nOptions:\n(A)having a sterilized needle shoved under the victim's fingernails\n(B)electrocution at nonlethal levels", "target": "(A)"}
{"input": "Q:  Mary's laptop deserves moral consideration only because she owns it and cares about it. Thus, Mary's laptop has\nOptions:\n(B)indirect moral standing.\n(D)inherent or intrinsic worth.", "target": "(B)"}
{"input": "Q:  According to Collins, one key claim of care ethics is that\nOptions:\n(A)Deliberation should include sympathy and direct attendance to concrete particulars.\n", "target": "(A)"}
{"input": "Q:  A truly environmental ethic must hold that which of the following has direct moral standing?\nOptions:\n(B)at least some nonconscious beings\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Shapiro discusses Mediterranean cultures' use of alcohol to show that\nOptions:\n(C)increased use of a drug does not always lead to increased addiction.\n", "target": "(C)"}
{"input": "Q:  Ashford thinks that the right test of whether or not legal and economic structures are minimally just is to see whether or not\nOptions:\n(B)they minimize the amount of suffering in the world.\n(C)they recognize, enforce, and implement duties not to violate human rights.", "target": "(C)"}
{"input": "Q:  What does SCNT stand for, as used in the discussion on cloning?\nOptions:\n(C)somatic cell nuclear transfer\n", "target": "(C)"}
{"input": "Q:  Which of the following is an example of a value-based moral theory?\nOptions:\n(B)virtue ethics\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Velleman worries that, by offering a patient the option of euthanasia,\nOptions:\n(A)we allow the patient to harm him- or herself.\n(D)we harm the patient.", "target": "(D)"}
{"input": "Q:  On Pogge's view, affluent citizens are harming the poor by\nOptions:\n(C)both A and B\n(D)None of the above", "target": "(C)"}
{"input": "Q:  Mill considers which of the following cases?\nOptions:\n(A)censoring an opinion that is true.\n(D)All of the above.", "target": "(D)"}
{"input": "Q:  Which of the following is one of de Marneffe's responses to the objection that drug prohibition would be paternalistic?\nOptions:\n(A)Drug prohibition would be done for the benefit of others, not the benefit of those who wish to produce/sell drugs, so it is not paternalistic in an objectionable sense.\n(B)Drug prohibition would be paternalistic, but its consequences would be good enough to outweigh considerations about paternalism.", "target": "(A)"}
{"input": "Q:  Which of the following is an example of a \"right of noninterference\" according to Arthur?\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q:  Velleman worries that the word dignity is sometimes used (incorrectly) to glorify which of the following:\nOptions:\n(C)Western culture's obsession with youth, strength, and independence\n", "target": "(C)"}
{"input": "Q:  In contrast to other moral theories, care ethics emphasizes\nOptions:\n(B)the concepts of care and compassion.\n(D)all of the above.", "target": "(D)"}
{"input": "Q:  Papadaki argues that the narrow view of sexual objectification\nOptions:\n(A)is correct.\n(B)fails to account for cases where there can be unintentional disregard of a person's humanity.", "target": "(B)"}
{"input": "Q:  According to Lukianoff and Haidt, institutionalizing vindictive protectiveness will\nOptions:\n(C)harm their ability to learn.\n", "target": "(C)"}
{"input": "Q:  Which of the following is a value that Arthur believes is more fundamental than rights and desert?\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q:  According to Carruthers, whenever someone is required to act in a certain way toward an animal for the sake of the animal, what explains that fact are facts about\nOptions:\n(B)the wider effects on human beings.\n(D)neither A nor B", "target": "(B)"}
{"input": "Q:  Which of the following is an example of a virtue?\nOptions:\n(B)courage\n(D)all of the above", "target": "(D)"}
{"input": "Q:  Papadaki thinks that in cases where partners in a relationship mutually deny each other's humanity that\nOptions:\n(A)sexual objectification occurs.\n(C)there is no straightforward answer to the question of whether or not sexual objectification occurs.", "target": "(C)"}
{"input": "Q:  Baxter argues that we should view our treatment of the environment as a matter of various trade-offs whose aim is\nOptions:\n(A)to minimize damage incurred by all individual living beings.\n(D)to promote human welfare.", "target": "(D)"}
{"input": "Q:  Which of the following is not a prima facie duty that Ross discusses?\nOptions:\n(A)the duty to keep promises\n(C)the duty to protect our natural environment", "target": "(C)"}
{"input": "Q:  Carruthers argues that, on contractualist grounds, nonhuman animals may be accorded which of the following kinds of moral standing?\nOptions:\n(B)indirect\n", "target": "(B)"}
{"input": "Q:  In Singer's understanding, the principle of the equality of human beings is\nOptions:\n(C)a prescription of how we should treat nonhuman animals.\n(D)a prescription of how we should treat humans.", "target": "(D)"}
{"input": "Q:  Against Kant's view of sexual objectification, Papadaki argues that\nOptions:\n(A)it is not clear how sexual use sacrifices humanity.\n(D)Papadaki actually agrees with Kant's view", "target": "(A)"}
{"input": "Q:  According to Kass, one problem with cloning is that\nOptions:\n(A)cloned individuals are likely to experience psychological and social identity problems.\n(B)cloned individuals cannot be created quickly enough.", "target": "(A)"}
{"input": "Q:  In response to Sandel's argument about the relationship between genetic enhancement and parent-child relationships, Kamm argues that\nOptions:\n(A)genetic transformation will actually strengthen the bond between parent and child.\n(C)Sandel's reasoning does not rule out the use of moderate, worthwhile genetic transformation.", "target": "(C)"}
{"input": "Q:  The retributive theory of punishment does not claim that\nOptions:\n(B)specific punishments are justified based on the overall intrinsic value that they produce\n", "target": "(B)"}
{"input": "Q:  According to Norcross, which of the following arguments poses a formidable challenge to any proposed criterion of full moral standing that excludes animals?\nOptions:\n(B)the argument from cosmology\n(C)the argument from marginal cases", "target": "(C)"}
{"input": "Q:  The annual death-toll from poverty related causes is, according to Pogge,\nOptions:\n(A)around one quarter of all human deaths.\n(D)none of the above.", "target": "(A)"}
{"input": "Q:  According to the basic principle of natural law theory, an action is right if and only if (and because)\nOptions:\n(C)in performing the action one does not directly violate any of the basic values.\n", "target": "(C)"}
{"input": "Q:  Kant's humanity formulation of the categorical imperative makes it impermissible for us to, he argues,\nOptions:\n(C)both A and B\n", "target": "(C)"}
{"input": "Q:  According to Carruthers, our duties to animals are\nOptions:\n(A)direct and basic.\n(B)indirect and derivative.", "target": "(B)"}
{"input": "Q:  The most common form of cosmopolitanism is _____ cosmopolitanism, according to which those in a position to do so have an obligation to assist those in need because of poverty and to promote basic human rights.\nOptions:\n(A)moral\n", "target": "(A)"}
{"input": "Q:  A central premise of Wellman's argument is that the state's right to freedom of association implies a right to _____ prospective members:\nOptions:\n(A)exclude\n(C)advocate", "target": "(A)"}
{"input": "Q:  In Rachels's thought experiment with Smith and Jones, Jones's action (i.e., his watching the child, who slipped accidentally, drowned in the tub) is supposed to be an example of\nOptions:\n(B)letting die.\n", "target": "(B)"}
{"input": "Q:  Suppose Nathan argues that while neither nonhuman nor nonsentient beings have direct moral standing, we still ought to have a certain noninstrumental regard for the environment because failing to do so involves a deficiency in one's moral character. Nathan is most likely applying what moral theory?\nOptions:\n(A)virtue ethics\n", "target": "(A)"}
{"input": "Q:  Timmons suggests that many people believe in moral relativism because\nOptions:\n(C)They realize that some ethical claims seem true in some contexts but not in others.\n(D)All of the above.", "target": "(D)"}
{"input": "Q:  Collins suggests that the moral value of caring actions comes from\nOptions:\n(B)how well any caring actions fulfills the recipient's interests and the strength of one's intention to fulfill the recipient's interest.\n(C)the degree to which those actions produces the greatest amount of happiness in the recipient of care.", "target": "(B)"}
{"input": "Q:  Callahan cites the Oregon Death with Dignity Legal Defense and the Education Center's finding that \"after four full years .. there have been no missteps, abuses or coercive tendencies\" regarding laws permitting euthanasia. In response he argues that\nOptions:\n(A)they can't know this to be true without an anonymous survey.\n(B)other studies have found contrary results.", "target": "(A)"}
{"input": "Q:  Joseph Carens argues that restrictions on free migration can be justified if\nOptions:\n(B)the restrictions are necessary to preserve a distinct culture or way of life.\n(C)both A and B are true", "target": "(B)"}
{"input": "Q:  Little argues that we should accept a prerogative on the part of mothers to end a pregnancy until the fetus is a person because\nOptions:\n(A)we should accept a prerogative to decline radical changes to one's practical identity.\n", "target": "(A)"}
{"input": "Q:  According to Reiman, van den Haag's argument leads to the conclusion that\nOptions:\n(A)we should refrain from imposing the death penalty.\n(C)we should institute death by torture.", "target": "(C)"}
{"input": "Q:  Which of the following potentially morally relevant differences between Fred's behavior and the behavior of the consumers of factory-raised meat does Norcross not discuss?\nOptions:\n(B)The suffering of the puppies is necessary for gustatory pleasure, whereas the suffering of animals on factory farms is simply a by-product of the conditions dictated by economic considerations.\n(D)none of the above", "target": "(D)"}
{"input": "Q:  Shapiro claims that humans are social or cultural animals, which is significant for his view because it implies that\nOptions:\n(A)social norms or rules play a significant role in influencing behavior.\n(C)past experience plays a significant role in influencing behavior.", "target": "(A)"}
{"input": "Q:  In response to the argument that embryos are not persons because they do not exercise higher mental capacities, Lee and George argue that\nOptions:\n(D)to have killed a human embryos that developed into you would have been the same thing as killing you.\n", "target": "(D)"}
{"input": "Q:  On the proposal that we need to establish world food banks to help those who are in need, Hardin would say that\nOptions:\n(C)it would be subject to the tragedy of the commons.\n", "target": "(C)"}
{"input": "Q:  Audi proposed that we expand Ross's list of prima facie duties to include\nOptions:\n(D)all of the above\n", "target": "(D)"}
{"input": "Q:  Wellman accepts that there are other values besides the freedom of association, such as\nOptions:\n(A)egalitarian values concerning the elimination of inequalities that make people vulnerable to oppression.\n(C)both A and B", "target": "(C)"}
{"input": "Q:  Mill argues on that even a false opinion should not be censored because\nOptions:\n(B)you don't really know the true view unless you can explain why false views are false.\n(C)you don't really know whether or not anything is false.", "target": "(B)"}
{"input": "Q:  According to Mill, the value of a particular pleasure depends on\nOptions:\n(C)both its quantity and its quality.\n", "target": "(C)"}
{"input": "Q:  Which of the following are forms of misogynist speech according to Richardson-Self?\nOptions:\n(D)A and B only\n", "target": "(D)"}
{"input": "Q:  According to West, which of the following reasons for a women to engage in sex with her male partner may cause her harm?\nOptions:\n(C)Her refusal might result in a violent outburst.\n(D)All of the above.", "target": "(D)"}
{"input": "Q:  What does Hursthouse say about the claim that any adequate action-guiding (i.e., moral) theory must provide clear guidance about what ought and ought not to be done that any intelligent person could follow?\nOptions:\n(B)She says the claim is implausible.\n(C)She says the claim is self-evident.", "target": "(B)"}
{"input": "Q:  To say that an action is intrinsically permissible (a feature mentioned in the doctrine of double effect) is to say that\nOptions:\n(A)the action, apart from its effects, is morally permissible.\n", "target": "(A)"}
{"input": "Q:  According to the Humanity formulation of Kant's principle, we must treat persons\nOptions:\n(A)never as a means.\n(B)never as a mere means.", "target": "(B)"}
{"input": "Q:  Wellman cites a number of \"unpalatable implications that follow from denying a country's right to freedom of association,\" including\nOptions:\n(C)both A and B\n(D)neither A nor B", "target": "(C)"}
{"input": "Q:  Fine asks us to consider an example in which a private club \"regularly arranges noisy late-night gatherings\" to show that\nOptions:\n(B)the actions of groups can affect members outside that group.\n(C)there is no difference between an individual's and a group's freedom of association.", "target": "(B)"}
{"input": "Q:  Hardin's approach to the moral issues of hunger and poverty is essentially\nOptions:\n(A)a consequentialist approach.\n(C)an ethics of prime facie duty approach.", "target": "(A)"}
{"input": "Q:  According to Singer, which of the following is the single relevant factor in determining whether something has moral status?\nOptions:\n(C)sentience\n", "target": "(C)"}
{"input": "Q:  According to Altman, justifications of speech codes that take account of which of the following kinds of harm have the best prospects for success?\nOptions:\n(B)expressive harm\n(D)auxiliary harm", "target": "(D)"}
{"input": "Q:  According to Altman, a viewpoint-biased speech restriction should be troubling to whom?\nOptions:\n(A)those who value a strong right to privacy\n", "target": "(A)"}
{"input": "Q:  Ross's moral theory is a version of\nOptions:\n(A)consequentialism.\n(B)the ethics of prime facie duty.", "target": "(B)"}
{"input": "Q:  In his definition of terrorism, Valls defines \"violence\" as\nOptions:\n(B)including bodily harm to persons and the destruction of property.\n(D)none of the above", "target": "(B)"}
{"input": "Q:  In therapeutic cloning, the goal is to\nOptions:\n(C)treat disease.\n(D)none of the above", "target": "(C)"}
{"input": "Q:  Leopold claims that history has shown that \"the conqueror role is eventually self-defeating.\" It is self-defeating, in this view, because\nOptions:\n(C)the conqueror doesn't know what and who is worthless in community life.\n(D)all of the above", "target": "(D)"}
{"input": "Q:  Of the following social problems that could result from a genetic supermarket, which does Singer think is the least serious?\nOptions:\n(A)loss of human diversity\n(B)the effects of engineering children to have positional goods", "target": "(A)"}
{"input": "Q:  Van den Haag is\nOptions:\n(A)a distributionist.\n(C)a retentionist.", "target": "(C)"}
{"input": "Q:  According to some defenders of meat-eating, the suffering of animals counts less than the suffering of humans (if at all) because\nOptions:\n(B)humans are rational and animals are not.\n", "target": "(B)"}