{"input": "Q: Differential distribution of substances in the egg most typically results in:\nOptions:\n(A)differences in gene expression which may establish a pattern in the embryo as the cells divide\n", "target": "(A)"}
{"input": "Q: Regarding exons, which, if any, of the following statements is correct?\nOptions:\n(A)Some exons in protein-coding genes consist of noncoding DNA.\n", "target": "(A)"}
{"input": "Q: The mutation in sickle-cell disease consists of:\nOptions:\n(A)a deletion.\n(D)a point mutation.", "target": "(D)"}
{"input": "Q: QTL analysis is used to\nOptions:\n(A)identify chromosome regions associated with a complex trait in a genetic cross\n(C)map genes in bacterial viruses", "target": "(A)"}
{"input": "Q: Familial hypercholesterolaemia is caused by mutations in the gene which encodes what?\nOptions:\n(D)Low density lipoprotein receptor\n", "target": "(D)"}
{"input": "Q: The likelihood of an individual in a population carrying two specific alleles of a human DNA marker, each of which has a frequency of 0.2, will be:\nOptions:\n(C)0.08\n(D)0.02", "target": "(C)"}
{"input": "Q: An Hfr strain of E. coli contains:\nOptions:\n(C)a bacterial chromosome with the F factor inserted\n", "target": "(C)"}
{"input": "Q: If both parents are affected with the same autosomal recessive disorder then the probability that each of their children will be affected equals ___.\nOptions:\n(B)1 in 2\n(D)1", "target": "(D)"}
{"input": "Q: Which of the following diagnostic techniques is of no value for the diagnosis of neural tube defects?\nOptions:\n(B)Chorion villus sampling (CVS)\n(C)Maternal serum screening", "target": "(B)"}
{"input": "Q: It is currently estimated that there are ______ human protein-coding genes although this estimate may be reduced over time.\nOptions:\n(B)19,000–20,000\n(D)100,000", "target": "(B)"}
{"input": "Q: In DNA adenine normally pairs with:\nOptions:\n(A)cytosine.\n(C)thymine.", "target": "(C)"}
{"input": "Q: In a condition such as schizophrenia the recurrence risk will be greatest for which of the following relatives of an affected individual?\nOptions:\n(A)Brother\n(C)Grandchild", "target": "(A)"}
{"input": "Q: Intergenerational transmission to offspring can occur as a result of parental exposures to ______.\nOptions:\n(D)all of these\n", "target": "(D)"}
{"input": "Q: The risk of abnormality in the child of a mother with untreated phenylketonuria is:\nOptions:\n(B)10%\n(D)Almost 100%", "target": "(D)"}
{"input": "Q: Twin studies in humans are useful because\nOptions:\n(A)they allow genetic as opposed to environmental influences on variation in a trait to be estimated\n(C)they allow improved expression of genes", "target": "(A)"}
{"input": "Q: The risk for miscarriage associated with amniocentesis is approximately ____.\nOptions:\n(C)1 in 100 to 1 in 200\n", "target": "(C)"}
{"input": "Q: The pattern of inheritance shown by glucose-6-phosphate dehydrogenase (G6PD) deficiency is:\nOptions:\n(C)X-linked dominant.\n(D)X-linked recessive.", "target": "(D)"}
{"input": "Q: The proportion of genes shared by first cousins is on average ___.\nOptions:\n(B)1.0/4\n(C)1.0/8", "target": "(C)"}
{"input": "Q: Which of the following causes female pseudohermaphroditism?\nOptions:\n(B)Campomelic dysplasia\n(C)Congenital adrenal hyperplasia", "target": "(C)"}
{"input": "Q: If an X-linked recessive disorder is in Hardy-Weinberg equilibrium and the incidence in males equals 1 in 100, then the expected incidence of affected homozygous females would be _______.\nOptions:\n(C)1 in 10 000\n", "target": "(C)"}
{"input": "Q: Which of the following genes conveys susceptibility for polygenic Alzheimer disease?\nOptions:\n(D)APOE\n", "target": "(D)"}
{"input": "Q: Which of the following is not a familial cancer syndrome\nOptions:\n(C)Von Hippel-Lindau syndrome\n(D)Waardenburg syndrome", "target": "(D)"}
{"input": "Q: The presence of two or more cell lines from different zygotes in a single individual is known as:\nOptions:\n(A)mosaicism.\n(D)chimaerism.", "target": "(D)"}
{"input": "Q: Exon skipping is associated with:\nOptions:\n(A)nonsense mutations.\n(C)RNA processing mutations.", "target": "(C)"}
{"input": "Q: Which of the following disorders is not suitable for population carrier screening?\nOptions:\n(B)Oculocutaneous albinism\n", "target": "(B)"}
{"input": "Q: The ______ is the set of observable characteristics and is the sum of genetic and environmental effects.\nOptions:\n(B)phenotype\n(D)neither genotype or phenotype", "target": "(B)"}
{"input": "Q: In humans, each cell normally contains ______ of chromosomes.\nOptions:\n(B)23 pairs\n", "target": "(B)"}
{"input": "Q: Nature is more important for ______ differences, while nurture has greater influence on ______ differences.\nOptions:\n(A)structural and anatomical; psychological and social\n", "target": "(A)"}
{"input": "Q: A homeotic mutation is one which\nOptions:\n(B)substitutes one body part for another in development\n", "target": "(B)"}
{"input": "Q: Advantages of using adenoviruses for gene therapy include:\nOptions:\n(A)long term expression.\n(B)low risk of insertional mutagenesis.", "target": "(B)"}
{"input": "Q: Complete the following sentence. The Philadelphia chromosome:\nOptions:\n(B)is a product of a reciprocal translocation.\n(C)causes Burkitt's lymphoma.", "target": "(B)"}
{"input": "Q: Male to male transmission is a key feature of which pattern of inheritance?\nOptions:\n(A)Autosomal dominant\n(C)X-linked dominant", "target": "(A)"}
{"input": "Q: A cross between two true breeding lines one with dark blue flowers and one with bright white flowers produces F1 offspring that are light blue. When the F1 progeny are selfed a 1:2:1 ratio of dark blue to light blue to white flowers is observed. What genetic phenomenon is consistent with these results?\nOptions:\n(B)incomplete dominance\n", "target": "(B)"}
{"input": "Q: A nonsense mutation involves:\nOptions:\n(A)a regulatory sequence.\n(D)the creation of a stop codon.", "target": "(D)"}
{"input": "Q: If the frequency of males affected with an X-linked recessive condition in a human population is .10 (one in ten), what will be the expected frequency of affected females?\nOptions:\n(A)0.01\n", "target": "(A)"}
{"input": "Q: The pattern of inheritance shown by malignant hyperthermia (hyperpyrexia) is:\nOptions:\n(A)autosomal dominant.\n(B)autosomal recessive.", "target": "(A)"}
{"input": "Q: Assuming that the level of glucose is low, a mutation in the repressor associated with the lac operon of E. coli which prevents binding of the repressor to lactose should result in: \nOptions:\n(B)lack of expression or reduced expression of the lac operon genes under all circumstances\n(C)expression of the genes only when lactose is present", "target": "(B)"}
{"input": "Q: In meiosis, recombination occurs in:\nOptions:\n(B)Prophase I.\n", "target": "(B)"}
{"input": "Q: Which of the following conditions is not caused by a mutation in FGFR3?\nOptions:\n(A)Achondroplasia\n(D)Waardenburg syndrome", "target": "(D)"}
{"input": "Q: Asp235Phe in a molecular report indicates that:\nOptions:\n(B)phenylalanine has been replaced by asparagine.\n(C)aspartic acid has been replaced by phenylalanine.", "target": "(C)"}
{"input": "Q: Which of the following karyotypes is diagnostic of Down syndrome\nOptions:\n(A)46,XX,der(14;21)(q10;q10)pat+21\n(D)46,XY,t(2;3)(q21;q12)", "target": "(A)"}
{"input": "Q: Research from Moshe Szyf and colleagues has provided significant findings on the epigenetic influences of prenatal maternal stress. This work has been labelled ______.\nOptions:\n(B)social epigenetics\n(D)maternal epigenetics", "target": "(B)"}
{"input": "Q: The DiGeorge/Shprintzen syndrome is caused by a deletion in which chromosome?\nOptions:\n(C)15\n(D)22", "target": "(D)"}
{"input": "Q: Transcriptional activator proteins\nOptions:\n(A)bind regions near a eukaryotic gene and allow an RNA polymerase to transcribe a gene\n(B)bind to ribosomes to activate the production of specific proteins", "target": "(A)"}
{"input": "Q: The normal human chromosome diploid number is:\nOptions:\n(C)46\n(D)48", "target": "(C)"}
{"input": "Q: Which of the following findings on prenatal ultrasound examination would not raise suspicion of a chromosome abnormality?\nOptions:\n(C)Hydrops fetalis\n(D)Monozygotic twins", "target": "(D)"}
{"input": "Q: Most new mutations appear to be\nOptions:\n(B)neutral or deleterious\n(D)detectable using allozyme studies (protein electrophoresis)", "target": "(B)"}
{"input": "Q: Simple tandem repeat polymorphisms in humans are most useful for\nOptions:\n(A)solving criminal and paternity cases\n(B)reconstructing the relationships of humans and chimps.", "target": "(A)"}
{"input": "Q: Positional cloning refers to\nOptions:\n(C)isolating a gene by PCR using primers from another species\n(D)mapping a gene to a chromosomal region and then identifying and cloning a genomic copy of the gene from the region", "target": "(D)"}
{"input": "Q: Normal adult haemoglobin (Hb A) consists of:\nOptions:\n(A)two α (alpha) and two β (beta) chains.\n(C)two α and two δ (delta) chains.", "target": "(A)"}
{"input": "Q: ______ explained genetic disorders such as alkaptonuria and albinism.\nOptions:\n(A)Recessive inheritance has\n(D)Y chromosomes", "target": "(A)"}
{"input": "Q: Tay-Sachs disease is caused by deficiency of _________________?\nOptions:\n(C)Hexosaminidase A\n", "target": "(C)"}
{"input": "Q: Which of the following is not a recognized complication of cystic fibrosis?\nOptions:\n(A)Cancer of the oesophagus\n(D)Liver cirrhosis", "target": "(A)"}
{"input": "Q: The maternal serum level of alpha-fetoprotein (AFP) is lower than average in which situation?\nOptions:\n(A)Down syndrome\n(B)Exomphalos", "target": "(A)"}
{"input": "Q: Which of the following is not a chromosome instability syndrome?\nOptions:\n(A)Klinefelter syndrome\n(D)Bloom syndrome", "target": "(A)"}
{"input": "Q: Assuming Hardy-Weinberg equilibrium, the genoypte frequency of heterozygotes, if the frequency of the two alleles at the gene being studied are 0.6 and 0.4, will be:\nOptions:\n(C)0.48\n(D)0.32", "target": "(C)"}
{"input": "Q: Recombinant alpha-iduronidase is used for the treatment of which disease/syndrome?\nOptions:\n(C)Hurler syndrome\n(D)Pompe disease", "target": "(C)"}
{"input": "Q: Which of the following trisomy karyotypes has the mildest effect on human development?\nOptions:\n(A)47,XXX\n", "target": "(A)"}
{"input": "Q: Arabidopsis is advantageous for plant genetic research because:\nOptions:\n(D)it is a small plant with a small genome size which can be raised inexpensively\n", "target": "(D)"}
{"input": "Q: Male breast cancer is associated with mutations in ___.\nOptions:\n(B)BRCA2\n(C)NF1", "target": "(B)"}
{"input": "Q: The polymerase chain reaction or PCR is a technique that\nOptions:\n(A)was used to demonstrate DNA as the genetic material\n(C)uses short DNA primers and a thermostable DNA polymerase to replicate specific DNA sequences in vitro.", "target": "(C)"}
{"input": "Q: An increase in the inbreeding coefficient, F, is likely to result in:\nOptions:\n(A)reduced likelihood of heterozygotes being present in a population\n", "target": "(A)"}
{"input": "Q: Which of the following conditions shows anticipation in paternal transmission?\nOptions:\n(A)Huntington disease\n(D)Fragile X syndrome", "target": "(A)"}
{"input": "Q: The epigenetic inheritance system has been described as ______ (Mayr and Provine, 1980).\nOptions:\n(B)soft inheritance\n(D)hard inheritance", "target": "(B)"}
{"input": "Q: Which of the following is not a tumour suppressor gene?\nOptions:\n(A)APC\n(D)RET", "target": "(D)"}
{"input": "Q: The proportion of babies that have an abnormality identifiable at birth is _____.\nOptions:\n(A)1 in 10\n(B)1 in 40", "target": "(B)"}
{"input": "Q: The mutational mechanism in δβ-thalassaemia consists of:\nOptions:\n(A)a deletion.\n", "target": "(A)"}
{"input": "Q: Which of the following disorders does not show X-linked inheritance?\nOptions:\n(A)Duchenne muscular dystrophy\n(B)Tay-Sachs disease", "target": "(B)"}
{"input": "Q: ______ has been described as the phenomenon by which one genotype can give rise to a range of different physiological or morphological states in response to different environmental conditions during development (West-Eberhard, 1989).\nOptions:\n(C)Developmental plasticity\n(D)Environmental plasticity", "target": "(C)"}
{"input": "Q: What would be the frequency of AABBCC individuals from a mating of two AaBbCc individuals?\nOptions:\n(A)1.0/64\n(B)1.0/32", "target": "(A)"}
{"input": "Q: Zinc finger proteins and helix-turn-helix proteins are\nOptions:\n(A)types of DNA-binding proteins\n(D)part of the hemoglobin in blood cells", "target": "(A)"}
{"input": "Q: Which of the following conditions is a peroxisomal disorder?\nOptions:\n(A)Acute intermittent porphyria\n(D)Zellweger syndrome", "target": "(D)"}
{"input": "Q: Marked microsatellite instability is a feature of:\nOptions:\n(B)hereditary non-polyposis colon cancer (HNPCC).\n", "target": "(B)"}
{"input": "Q: A high blood ammonia level occurs in:\nOptions:\n(B)Hurler's syndrome.\n(C)ornithine transcarbamylase (OTC) deficiency.", "target": "(C)"}
{"input": "Q: With which of the following relatives is an individual most likely to share a common HLA haplotype?\nOptions:\n(C)Sister\n(D)Son", "target": "(C)"}
{"input": "Q: Which of the following karyotypes is not compatible with survival to birth?\nOptions:\n(D)45,Y\n", "target": "(D)"}
{"input": "Q: Consanguinity shows a strong association with which pattern of inheritance?\nOptions:\n(A)Autosomal dominant\n(B)Autosomal recessive", "target": "(B)"}
{"input": "Q: X-chromosome inactivation\nOptions:\n(A)results in genetically turning off one of the two X chromosomes in female mammals\n", "target": "(A)"}
{"input": "Q: Which of the following is a feature of X-linked dominant inheritance?\nOptions:\n(A)Parental consanguinity\n(D)Transmitted by males only to females", "target": "(D)"}
{"input": "Q: Which of the following conditions is caused by a trinucleotide (triplet) repeat expansion?\nOptions:\n(C)Huntington disease\n", "target": "(C)"}
{"input": "Q: Pseudocholinesterase deficiency is associated with increased sensitivity to what?\nOptions:\n(D)Succinylcholine\n", "target": "(D)"}
{"input": "Q: Plasmid vectors for cloning\nOptions:\n(B)grow within bacteria, and are present in bacterial colonies on an agar plate\n", "target": "(B)"}
{"input": "Q: In a Robertsonian translocation fusion occurs at the:\nOptions:\n(B)centromeres.\n", "target": "(B)"}
{"input": "Q: The most common cystic fibrosis mutation consists of:\nOptions:\n(A)a deletion.\n", "target": "(A)"}
{"input": "Q: The most common chromosome abnormality in first trimester spontaneous miscarriages is:\nOptions:\n(A)trisomy.\n(D)tetrasomy.", "target": "(A)"}
{"input": "Q: In genome-wide association studies, known SNPs explain ______ of the variation in body mass index despite the evidence of greater than 50% heritability from twin and family studies.\nOptions:\n(B)less than 1%\n(D)less than 2%", "target": "(D)"}
{"input": "Q: Mapping of human chromosomes:\nOptions:\n(B)proceeded much more successfully as large numbers of DNA markers became available.\n", "target": "(B)"}
{"input": "Q: Which of the following is an example of monosomy?\nOptions:\n(C)69,XYY\n(D)45,X", "target": "(D)"}
{"input": "Q: The common mutation in α-thalassaemia consists of:\nOptions:\n(A)a deletion.\n(C)an insertion.", "target": "(A)"}
{"input": "Q: Leber's hereditary optic atrophy is caused by a mutation in:\nOptions:\n(D)mitochondrial DNA.\n", "target": "(D)"}
{"input": "Q: Autozygosity mapping is used to map disorders that show which pattern of inheritance?\nOptions:\n(B)Autosomal recessive\n(D)X-linked recessive", "target": "(B)"}
{"input": "Q: Severe anaemia at birth is a feature of what?\nOptions:\n(A)Alpha-thalassaemia\n(C)Hereditary persistence of fetal haemoglobin", "target": "(A)"}
{"input": "Q: Mutations that cause achondroplasia exert an effect which can be classified as:\nOptions:\n(B)gain-of-function.\n(C)haploinsufficiency.", "target": "(B)"}
{"input": "Q: Homeobox sequences\nOptions:\n(A)are present in the genome of many animal species\n(B)are found in prokaryotes but not in eukaryotes", "target": "(A)"}
{"input": "Q: A baby born with pulmonary hypoplasia secondary to oligohydramnios caused by renal agenesis would be classified as having:\nOptions:\n(A)an association.\n(C)a sequence.", "target": "(C)"}
{"input": "Q: On average, how many fragments would a restriction enzyme which recognizes a specific 4 base sequence in DNA be expected to cleave a double-stranded bacteriophage with a genome size of 5,000 bp into?\nOptions:\n(C)about 20\n(D)about 50", "target": "(C)"}
{"input": "Q: Which of the following would result in Angelman syndrome?\nOptions:\n(A)Maternal UPD 15\n(B)Paternal UPD 15", "target": "(B)"}
{"input": "Q: Enzyme assay can be used to identify carriers of:\nOptions:\n(B)Fragile X syndrome.\n(D)Tay-Sachs disease.", "target": "(D)"}
{"input": "Q: Which of the following statements about Hirschsprung disease is incorrect?\nOptions:\n(B)It is more common in girls than in boys.\n", "target": "(B)"}
{"input": "Q: Which component of transcribed RNA in eukaryotes is present in the initial transcript but is removed before translation occurs?\nOptions:\n(A)Intron\n(C)Ribosome binding site", "target": "(A)"}